fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
    /* L2CAP Spec Error */
    BLE_ERR_L2CAP_PSM_NOT_SUPPORTED         = 0x4002,
    BLE_ERR_L2CAP_NO_RESOURCE               = 0x4004,
    BLE_ERR_L2CAP_INSUF_AUTHEN              = 0x4005,
    BLE_ERR_L2CAP_INSUF_AUTHOR              = 0x4006,
    BLE_ERR_L2CAP_INSUF_ENC_KEY_SIZE        = 0x4007,
    BLE_ERR_L2CAP_REFUSE_INSUF_ENC          = 0x4008,
    BLE_ERR_L2CAP_REFUSE_INVALID_SCID       = 0x4009,
    BLE_ERR_L2CAP_REFUSE_SCID_ALREADY_ALLOC = 0x400A,
    BLE_ERR_L2CAP_REFUSE_UNACCEPTABLE_PARAM = 0x400B,
};

/******************************************************************************************************************//**
 * @} (end addtogroup BLE_API)
 *********************************************************************************************************************/

/* =================================================== GAP Macro =================================================== */

/** @addtogroup GAP_API
 *  @ingroup BLE_API
 *  @{
 */

/**
 * @ingroup GAP_API
 * @def BLE_BD_ADDR_LEN
 * Bluetooth Device Address Size
 */
#define BLE_BD_ADDR_LEN                                (0x06)

/**
 * @def BLE_MASTER
 * Master Role.
 */
#define BLE_MASTER                                     (0x00)

/**
 * @def BLE_SLAVE
 * Slave Role.
 */
#define BLE_SLAVE                                      (0x01)

/* Bluetooth Device Address Type */

/**
 * @def BLE_GAP_ADDR_PUBLIC
 * Public Address.
 */
#define BLE_GAP_ADDR_PUBLIC                            (0x00)

/**
 * @def BLE_GAP_ADDR_RAND
 * Random Address.
 */
#define BLE_GAP_ADDR_RAND                              (0x01)

/**
 * @def BLE_GAP_ADDR_RPA_ID_PUBLIC
 * @brief Resolvable Private Address.
 * @details If the IRK of local device has not been registered in Resolving List,
 *          public address is used.
 */
#define BLE_GAP_ADDR_RPA_ID_PUBLIC                     (0x02)

/**
 * @def BLE_GAP_ADDR_RPA_ID_RANDOM
 * @brief Resolvable Private Address.
 * @details If the IRK of local device has not been registered in Resolving List,
 *          random address is used.
 */
#define BLE_GAP_ADDR_RPA_ID_RANDOM                     (0x03)

/* Adv Flag */

/**
 * @def BLE_GAP_AD_FLAGS_LE_LIM_DISC_MODE
 * @brief LE Limited Discoverable Mode flag used in AD type.
 */
#define BLE_GAP_AD_FLAGS_LE_LIM_DISC_MODE              (0x01)

/**
 * @def BLE_GAP_AD_FLAGS_LE_GEN_DISC_MODE
 * @brief LE General Discoverable Mode flag used in AD type.
 */
#define BLE_GAP_AD_FLAGS_LE_GEN_DISC_MODE              (0x02)

/**
 * @def BLE_GAP_AD_FLAGS_BR_EDR_NOT_SUPPORTED
 * @brief BR/EDR Not Supported flag used in AD type.
 */
#define BLE_GAP_AD_FLAGS_BR_EDR_NOT_SUPPORTED          (0x04)

/**
 * @def BLE_GAP_ADV_DATA_MODE
 * @brief Advertising data.
 */
#define BLE_GAP_ADV_DATA_MODE                          (0x00)

/**
 * @def BLE_GAP_SCAN_RSP_DATA_MODE
 * @brief Scan response data.
 */
#define BLE_GAP_SCAN_RSP_DATA_MODE                     (0x01)

/**
 * @def BLE_GAP_PERD_ADV_DATA_MODE
 * @brief Periodic advertising data.
 */
#define BLE_GAP_PERD_ADV_DATA_MODE                     (0x02)

/* Advertising channel map */

/**
 * @def BLE_GAP_ADV_CH_37
 * @brief Use 37 CH.
 */
#define BLE_GAP_ADV_CH_37                              (0x01)

/**
 * @def BLE_GAP_ADV_CH_38
 * @brief Use 38 CH.
 */
#define BLE_GAP_ADV_CH_38                              (0x02)

/**
 * @def BLE_GAP_ADV_CH_39
 * @brief Use 39 CH.
 */
#define BLE_GAP_ADV_CH_39                              (0x04)

/**
 * @def BLE_GAP_ADV_CH_ALL
 * @brief Use 37 - 39 CH.
 */
#define BLE_GAP_ADV_CH_ALL                             (0x07)

/* Scan Type */

/**
 * @def BLE_GAP_SCAN_PASSIVE
 * @brief Passive Scan.
 */
#define BLE_GAP_SCAN_PASSIVE                           (0x00)

/**
 * @def BLE_GAP_SCAN_ACTIVE
 * @brief Active Scan.
 */
#define BLE_GAP_SCAN_ACTIVE                            (0x01)

/*  Scan interval */

/**
 * @def BLE_GAP_SCAN_INTV_MIN
 * @brief Active Scan.
 */
#define BLE_GAP_SCAN_INTV_MIN                          (0x0004)

/*  Filter duplicates */

/**
 * @def BLE_GAP_SCAN_FILT_DUPLIC_DISABLE
 * @brief Duplicate filter disabled.
 */
#define BLE_GAP_SCAN_FILT_DUPLIC_DISABLE               (0x00)

/**
 * @def BLE_GAP_SCAN_FILT_DUPLIC_ENABLE
 * @brief Duplicate filter enabled.
 */
#define BLE_GAP_SCAN_FILT_DUPLIC_ENABLE                (0x01)

/**
 * @def BLE_GAP_SCAN_FILT_DUPLIC_ENABLE_FOR_PERIOD
 * @brief Duplicate filtering enabled, reset for each scan period.
 */
#define BLE_GAP_SCAN_FILT_DUPLIC_ENABLE_FOR_PERIOD     (0x02)

/*   Scan filter policy */

/**
 * @def BLE_GAP_SCAN_ALLOW_ADV_ALL
 * @brief Accept all advertising and scan response PDUs except directed advertising PDUs not addressed to local device.
 */
#define BLE_GAP_SCAN_ALLOW_ADV_ALL                     (0x00)

/**
 * @def BLE_GAP_SCAN_ALLOW_ADV_WLST
 * @brief Accept only advertising and scan response PDUs from remote devices
 *        whose address is registered in the White List.
 *        Directed advertising PDUs which are not addressed to local device is ignored.
 */
#define BLE_GAP_SCAN_ALLOW_ADV_WLST                    (0x01)

/**
 * @def BLE_GAP_SCAN_ALLOW_ADV_EXCEPT_DIRECTED
 * @brief Accept all advertising and scan response PDUs except directed advertising PDUs
 *        whose the target address is identity address but doesn't address local device.
 *        However directed advertising PDUs whose the target address is the local resolvable private address
 *        are accepted.
 */
#define BLE_GAP_SCAN_ALLOW_ADV_EXCEPT_DIRECTED         (0x02)

/**
 * @def BLE_GAP_SCAN_ALLOW_ADV_EXCEPT_DIRECTED_WLST
 * @brief Accept all advertising and scan response PDUs.<BR/>
 *        The following are excluded.
 *        - Advertising and scan response PDUs where the advertiser's identity address is not in the White List.
 *        - Directed advertising PDUs whose the target address is identity address
 *          but doesn't address local device. However directed advertising PDUs
 *          whose the target address is the local resolvable private address are accepted.
 */
#define BLE_GAP_SCAN_ALLOW_ADV_EXCEPT_DIRECTED_WLST    (0x03)

/*  Initiator Filter policy */

/**
 * @def BLE_GAP_INIT_FILT_USE_ADDR
 * @brief White List is not used.
 */
#define BLE_GAP_INIT_FILT_USE_ADDR                     (0x00)

/**
 * @def BLE_GAP_INIT_FILT_USE_WLST
 * @brief White List is used.
 */
#define BLE_GAP_INIT_FILT_USE_WLST                     (0x01)

/**
 * @def BLE_GAP_DATA_0_CLEAR
 * @brief Clear the advertising data/scan response data/periodic advertising data in the advertising set.
 */
#define BLE_GAP_DATA_0_CLEAR                           (0x01)

/**
 * @def BLE_GAP_DATA_0_DID_UPD
 * @brief Update Advertising DID without changing advertising data.
 */
#define BLE_GAP_DATA_0_DID_UPD                         (0x02)

/* Privacy Mode related Definitions */

/**
 * @def BLE_GAP_NET_PRIV_MODE
 * @brief Network Privacy Mode.
 */
#define BLE_GAP_NET_PRIV_MODE                          (0x00)

/**
 * @def BLE_GAP_DEV_PRIV_MODE
 * @brief Device Privacy Mode.
 */
#define BLE_GAP_DEV_PRIV_MODE                          (0x01)

/**
 * @def BLE_GAP_REM_FEATURE_SIZE
 * @brief The length of the features supported by a remote device.
 */
#define BLE_GAP_REM_FEATURE_SIZE                       (0x08)

/* Authorization Flag Definitions */

/**
 * @def BLE_GAP_NOT_AUTHORIZED
 * @brief Not authorize the remote device.
 */
#define BLE_GAP_NOT_AUTHORIZED                         (0x00)

/**
 * @def BLE_GAP_AUTHORIZED
 * @brief Authorize the remote device.
 */
#define BLE_GAP_AUTHORIZED                             (0x01)

/* Remove ADV Set related */

/**
 * @def BLE_GAP_RMV_ADV_SET_REM_OP
 * @brief Delete an advertising set.
 */
#define BLE_GAP_RMV_ADV_SET_REM_OP                     (0x01)

/**
 * @def BLE_GAP_RMV_ADV_SET_CLR_OP
 * @brief Delete all the advertising sets.
 */
#define BLE_GAP_RMV_ADV_SET_CLR_OP                     (0x02)

/* scan procedure type */

/**
 * @def BLE_GAP_SC_PROC_GEN
 * @brief General Discovery Procedure.
 */
#define BLE_GAP_SC_PROC_GEN                            (0x02)

/**
 * @def BLE_GAP_SC_PROC_LIM
 * @brief Limited Discovery Procedure.
 */
#define BLE_GAP_SC_PROC_LIM                            (0x01)

/**
 * @def BLE_GAP_SC_PROC_OBS
 * @brief Observation Procedure.
 */
#define BLE_GAP_SC_PROC_OBS                            (0x00)

