fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
/* White List Operation */
/* Resolvable List Operation */
/* Periodic advertiser List Operation */

/**
 * @def BLE_GAP_LIST_ADD_DEV
 * @brief Add the device to the list.
 */
#define BLE_GAP_LIST_ADD_DEV             (0x01)

/**
 * @def BLE_GAP_LIST_REM_DEV
 * @brief Delete the device from the list.
 */
#define BLE_GAP_LIST_REM_DEV             (0x02)

/**
 * @def BLE_GAP_LIST_CLR
 * @brief Clear the list.
 */
#define BLE_GAP_LIST_CLR                 (0x03)

/**
 * @def BLE_GAP_WHITE_LIST_MAX_ENTRY
 * @brief The maximum entry number of White List.
 */
#define BLE_GAP_WHITE_LIST_MAX_ENTRY     (0x04)

/**
 * @def BLE_GAP_RSLV_LIST_MAX_ENTRY
 * @brief The maximum entry number of Resolving List.
 */
#define BLE_GAP_RSLV_LIST_MAX_ENTRY      (0x08)

/**
 * @def BLE_GAP_PERD_LIST_MAX_ENTRY
 * @brief The maximum entry number of Periodic Advertiser List.
 */
#define BLE_GAP_PERD_LIST_MAX_ENTRY      (0x04)

/* Set Address Resolution */

/**
 * @def BLE_GAP_RPA_DISABLED
 * @brief Disable RPA generation/resolution.
 */
#define BLE_GAP_RPA_DISABLED             (0x00)

/**
 * @def BLE_GAP_RPA_ENABLED
 * @brief Enable RPA generation/resolution.
 */
#define BLE_GAP_RPA_ENABLED              (0x01)

/* Set Local IRK type */

/**
 * @def BLE_GAP_RL_LOC_KEY_ALL_ZERO
 * @brief  All-zero IRK.
 */
#define BLE_GAP_RL_LOC_KEY_ALL_ZERO      (0x00)

/**
 * @def BLE_GAP_RL_LOC_KEY_REGISTERED
 * @brief  The IRK registered by R_BLE_GAP_SetLocIdInfo().
 */
#define BLE_GAP_RL_LOC_KEY_REGISTERED    (0x01)

/* Number of advertising set supported */

/**
 * @def BLE_MAX_NO_OF_ADV_SETS_SUPPORTED
 * @brief  The maximum number of advertising set for the Abstraction API.
 */
#if (BLE_CFG_LIBRARY_TYPE == 0)
 #define BLE_MAX_NO_OF_ADV_SETS_SUPPORTED    (4)
#else                                  /* (BLE_CFG_LIB_TYPE == 0) */
 #define BLE_MAX_NO_OF_ADV_SETS_SUPPORTED    (1)
#endif /* (BLE_CFG_LIB_TYPE == 0) */

/* Advertising Properties  */
/* Legacy Advertising PDU */
#if (BLE_CFG_LIBRARY_TYPE == 0)

/**
 * @def BLE_GAP_LEGACY_PROP_ADV_IND
 * @brief  Connectable and scannable undirected Legacy Advertising Packet.
 */
 #define BLE_GAP_LEGACY_PROP_ADV_IND               (0x0013)

/**
 * @def BLE_GAP_LEGACY_PROP_ADV_DIRECT_IND
 * @brief  Connectable directed (low duty cycle) Legacy Advertising Packet.
 */
 #define BLE_GAP_LEGACY_PROP_ADV_DIRECT_IND        (0x0015)

/**
 * @def BLE_GAP_LEGACY_PROP_ADV_HDC_DIRECT_IND
 * @brief  Connectable directed (high duty cycle) Legacy Advertising Packet.
 */
 #define BLE_GAP_LEGACY_PROP_ADV_HDC_DIRECT_IND    (0x001D)

/**
 * @def BLE_GAP_LEGACY_PROP_ADV_SCAN_IND
 * @brief  Scannable undirected Legacy Advertising Packet.
 */
 #define BLE_GAP_LEGACY_PROP_ADV_SCAN_IND          (0x0012)

/**
 * @def BLE_GAP_LEGACY_PROP_ADV_NONCONN_IND
 * @brief  Non-connectable and non-scannable undirected Legacy Advertising Packet.
 */
 #define BLE_GAP_LEGACY_PROP_ADV_NONCONN_IND       (0x0010)

#else                                  /* (BLE_CFG_LIBRARY_TYPE == 0) */

/**
 * @def BLE_GAP_LEGACY_PROP_ADV_IND
 * @brief  Connectable and scannable undirected Legacy Advertising Packet.
 */
 #define BLE_GAP_LEGACY_PROP_ADV_IND               (0x0000)

/**
 * @def BLE_GAP_LEGACY_PROP_ADV_DIRECT_IND
 * @brief  Connectable directed (low duty cycle) Legacy Advertising Packet.
 */
 #define BLE_GAP_LEGACY_PROP_ADV_DIRECT_IND        (0x0004)

/**
 * @def BLE_GAP_LEGACY_PROP_ADV_HDC_DIRECT_IND
 * @brief  Connectable directed (high duty cycle) Legacy Advertising Packet.
 */
 #define BLE_GAP_LEGACY_PROP_ADV_HDC_DIRECT_IND    (0x0001)

/**
 * @def BLE_GAP_LEGACY_PROP_ADV_SCAN_IND
 * @brief  Scannable undirected Legacy Advertising Packet.
 */
 #define BLE_GAP_LEGACY_PROP_ADV_SCAN_IND          (0x0002)

/**
 * @def BLE_GAP_LEGACY_PROP_ADV_NONCONN_IND
 * @brief  Non-connectable and non-scannable undirected Legacy Advertising Packet.
 */
 #define BLE_GAP_LEGACY_PROP_ADV_NONCONN_IND       (0x0003)

#endif                                 /* (BLE_CFG_LIBRARY_TYPE == 0) */

/* Extended Advertising PDU */

/**
 * @def BLE_GAP_EXT_PROP_ADV_CONN_NOSCAN_UNDIRECT
 * @brief  Connectable and non-scannable undirected Extended Advertising Packet.
 */
#define BLE_GAP_EXT_PROP_ADV_CONN_NOSCAN_UNDIRECT        (0x0001)

/**
 * @def BLE_GAP_EXT_PROP_ADV_CONN_NOSCAN_DIRECT
 * @brief  Connectable and non-scannable directed (low duty cycle) Extended Advertising Packet.
 */
#define BLE_GAP_EXT_PROP_ADV_CONN_NOSCAN_DIRECT          (0x0005)

/**
 * @def BLE_GAP_EXT_PROP_ADV_CONN_NOSCAN_HDC_DIRECT
 * @brief  Connectable and non-scannable directed (high duty cycle) Extended Advertising Packet.
 */
#define BLE_GAP_EXT_PROP_ADV_CONN_NOSCAN_HDC_DIRECT      (0x000D)

/**
 * @def BLE_GAP_EXT_PROP_ADV_NOCONN_SCAN_UNDIRECT
 * @brief  Non-connectable and scannable undirected Extended Advertising Packet.
 */
#define BLE_GAP_EXT_PROP_ADV_NOCONN_SCAN_UNDIRECT        (0x0002)

/**
 * @def BLE_GAP_EXT_PROP_ADV_NOCONN_SCAN_DIRECT
 * @brief  Non-connectable and scannable directed (low duty cycle) Extended Advertising Packet.
 */
#define BLE_GAP_EXT_PROP_ADV_NOCONN_SCAN_DIRECT          (0x0006)

/**
 * @def BLE_GAP_EXT_PROP_ADV_NOCONN_SCAN_HDC_DIRECT
 * @brief  Non-connectable and scannable directed (high duty cycle) Extended Advertising Packet.
 */
#define BLE_GAP_EXT_PROP_ADV_NOCONN_SCAN_HDC_DIRECT      (0x000E)

/**
 * @def BLE_GAP_EXT_PROP_ADV_NOCONN_NOSCAN_UNDIRECT
 * @brief  Non-connectable and non-scannable undirected Extended Advertising Packet.
 */
#define BLE_GAP_EXT_PROP_ADV_NOCONN_NOSCAN_UNDIRECT      (0x0000)

/**
 * @def BLE_GAP_EXT_PROP_ADV_NOCONN_NOSCAN_DIRECT
 * @brief  Non-connectable and non-scannable directed (low duty cycle) Extended Advertising Packet.
 */
#define BLE_GAP_EXT_PROP_ADV_NOCONN_NOSCAN_DIRECT        (0x0004)

/**
 * @def BLE_GAP_EXT_PROP_ADV_NOCONN_NOSCAN_HDC_DIRECT
 * @brief  Non-connectable and non-scannable directed (high duty cycle) Extended Advertising Packet.
 */
#define BLE_GAP_EXT_PROP_ADV_NOCONN_NOSCAN_HDC_DIRECT    (0x000C)

/* Anonymous advertising  */

/**
 * @def BLE_GAP_EXT_PROP_ADV_ANONYMOUS
 * @brief  Omit the advertiser address from Extended Advertising Packet.
 */
#define BLE_GAP_EXT_PROP_ADV_ANONYMOUS                   (0x0020)

/**
 * @def BLE_GAP_EXT_PROP_ADV_INCLUDE_TX_POWER
 * @brief  Indicate that the advertising data includes TX Power.
 */
#define BLE_GAP_EXT_PROP_ADV_INCLUDE_TX_POWER            (0x0040)

/* Advertising Filter Policy */

/**
 * @def BLE_GAP_ADV_ALLOW_SCAN_ANY_CONN_ANY
 * @brief  Process scan and connection requests from all devices.
 */
#define BLE_GAP_ADV_ALLOW_SCAN_ANY_CONN_ANY              (0x00)

/**
 * @def BLE_GAP_ADV_ALLOW_SCAN_WLST_CONN_ANY
 * @brief  Process connection requests from all devices and scan requests from only devices that are in the White List.
 */
#define BLE_GAP_ADV_ALLOW_SCAN_WLST_CONN_ANY             (0x01)

/**
 * @def BLE_GAP_ADV_ALLOW_SCAN_ANY_CONN_WLST
 * @brief  Process scan requests from all devices and connection requests from only devices that are in the White List.
 */
#define BLE_GAP_ADV_ALLOW_SCAN_ANY_CONN_WLST             (0x02)

/**
 * @def BLE_GAP_ADV_ALLOW_SCAN_WLST_CONN_WLST
 * @brief  Process scan and connection requests from only devices in the White List.
 */
#define BLE_GAP_ADV_ALLOW_SCAN_WLST_CONN_WLST            (0x03)

/* Primary & Secondary Advertising PHY  */

/**
 * @def BLE_GAP_ADV_PHY_1M
 * @brief  Use 1M PHY.
 */
#define BLE_GAP_ADV_PHY_1M                               (0x01)

/**
 * @def BLE_GAP_ADV_PHY_2M
 * @brief  Use 2M PHY.
 */
#define BLE_GAP_ADV_PHY_2M                               (0x02)

/**
 * @def BLE_GAP_ADV_PHY_CD
 * @brief  Use Coded PHY.
 */
#define BLE_GAP_ADV_PHY_CD                               (0x03)

/* Scan Request Notification Enable */

/**
 * @def BLE_GAP_SCAN_REQ_NTF_DISABLE
 * @brief  Disable Scan Request Notification.
 */
#define BLE_GAP_SCAN_REQ_NTF_DISABLE                     (0x00)

/**
 * @def BLE_GAP_SCAN_REQ_NTF_ENABLE
 * @brief  Enable Scan Request Notification.
 */
#define BLE_GAP_SCAN_REQ_NTF_ENABLE                      (0x01)

/* Periodic Advertising Properties  */

/**
 * @def BLE_GAP_PERD_PROP_TX_POWER
 * @brief  Indicate that periodic advertising data includes Tx Power.
 */
#define BLE_GAP_PERD_PROP_TX_POWER                       (0x0040)

/**
 * @def BLE_GAP_INVALID_ADV_HDL
 * @brief  Invalid advertising handle.
 */
#define BLE_GAP_INVALID_ADV_HDL                          (0xFF)

/**
 * @def BLE_GAP_SET_PHYS_HOST_PREF_1M
 * @brief  Use 1M PHY.
 */
#define BLE_GAP_SET_PHYS_HOST_PREF_1M                    (0x01)

/**
 * @def BLE_GAP_SET_PHYS_HOST_PREF_2M
 * @brief  Use 2M PHY.
 */
#define BLE_GAP_SET_PHYS_HOST_PREF_2M                    (0x02)

/**
 * @def BLE_GAP_SET_PHYS_HOST_PREF_CD
 * @brief  Use Coded PHY.
 */
#define BLE_GAP_SET_PHYS_HOST_PREF_CD                    (0x04)

/**
 * @def BLE_GAP_SET_PHYS_OP_HOST_NO_PREF
 * @brief  No preferred coding.
 */
#define BLE_GAP_SET_PHYS_OP_HOST_NO_PREF                 (0x00)

/**
 * @def BLE_GAP_SET_PHYS_OP_HOST_PREF_S_2
 * @brief  Use S=2 coding.
 */
#define BLE_GAP_SET_PHYS_OP_HOST_PREF_S_2                (0x01)

/**
 * @def BLE_GAP_SET_PHYS_OP_HOST_PREF_S_8
 * @brief  Use S=8 coding.
 */
#define BLE_GAP_SET_PHYS_OP_HOST_PREF_S_8                (0x02)

/* connection update parameter */

/**
 * @def BLE_GAP_CONN_UPD_MODE_REQ
 * @brief  Request for updating the connection parameters.
 */
#define BLE_GAP_CONN_UPD_MODE_REQ                        (0x01)

/**
 * @def BLE_GAP_CONN_UPD_MODE_RSP
 * @brief  Reply a connection parameter update request.
 */
#define BLE_GAP_CONN_UPD_MODE_RSP                        (0x02)

