fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
/* connection update response  */

/**
 * @def BLE_GAP_CONN_UPD_ACCEPT
 * @brief  Accept the update request.
 */
#define BLE_GAP_CONN_UPD_ACCEPT                          (0x0000)

/**
 * @def BLE_GAP_CONN_UPD_REJECT
 * @brief  Reject the update request.
 */
#define BLE_GAP_CONN_UPD_REJECT                          (0x0001)

/* channel map size */

/**
 * @def BLE_GAP_CH_MAP_SIZE
 * @brief  The size of channel map.
 */
#define BLE_GAP_CH_MAP_SIZE                              (0x05)

/**
 * @def BLE_GAP_INVALID_CONN_HDL
 * @brief  Invalid Connection handle.
 */
#define BLE_GAP_INVALID_CONN_HDL                         (0xFFFF)

/**
 * @def BLE_GAP_NOT_USE_CONN_HDL
 * @brief  This macro indicates that connection handle is not used.
 */
#define BLE_GAP_NOT_USE_CONN_HDL                         BLE_GAP_INVALID_CONN_HDL

/**
 * @def BLE_GAP_INIT_CONN_HDL
 * @brief  Initial Connection handle.
 */
#define BLE_GAP_INIT_CONN_HDL                            BLE_GAP_INVALID_CONN_HDL

/**
 * @def BLE_GAP_PAIRING_ACCEPT
 * @brief  Accept a request regarding pairing.
 */
#define BLE_GAP_PAIRING_ACCEPT                           (0x00)

/**
 * @def BLE_GAP_PAIRING_REJECT
 * @brief  Reject a request regarding pairing.
 */
#define BLE_GAP_PAIRING_REJECT                           (0x01)

/**
 * @def BLE_GAP_LTK_REQ_ACCEPT
 * @brief  Reply for the LTK request.
 */
#define BLE_GAP_LTK_REQ_ACCEPT                           (0x00)

/**
 * @def BLE_GAP_LTK_REQ_DENY
 * @brief  Reject the LTK request.
 */
#define BLE_GAP_LTK_REQ_DENY                             (0x01)

/**
 * @def BLE_GAP_LESC_PASSKEY_ENTRY_STARTED
 * @brief  Notify that passkey entry started.
 */
#define BLE_GAP_LESC_PASSKEY_ENTRY_STARTED               (0x00)

/**
 * @def BLE_GAP_LESC_PASSKEY_DIGIT_ENTERED
 * @brief  Notify that passkey digit entered.
 */
#define BLE_GAP_LESC_PASSKEY_DIGIT_ENTERED               (0x01)

/**
 * @def BLE_GAP_LESC_PASSKEY_DIGIT_ERASED
 * @brief  Notify that passkey digit erased.
 */
#define BLE_GAP_LESC_PASSKEY_DIGIT_ERASED                (0x02)

/**
 * @def BLE_GAP_LESC_PASSKEY_CLEARED
 * @brief  Notify that passkey cleared.
 */
#define BLE_GAP_LESC_PASSKEY_CLEARED                     (0x03)

/**
 * @def BLE_GAP_LESC_PASSKEY_ENTRY_COMPLETED
 * @brief  Notify that passkey entry completed.
 */
#define BLE_GAP_LESC_PASSKEY_ENTRY_COMPLETED             (0x04)

/**
 * @def BLE_GAP_SEC_MITM_BEST_EFFORT
 * @brief  MITM Protection not required.
 */
#define BLE_GAP_SEC_MITM_BEST_EFFORT                     (0x00)

/**
 * @def BLE_GAP_SEC_MITM_STRICT
 * @brief  MITM Protection required.
 */
#define BLE_GAP_SEC_MITM_STRICT                          (0x01)

/**
 * @def BLE_GAP_KEY_DIST_ENCKEY
 * @brief  LTK
 */
#define BLE_GAP_KEY_DIST_ENCKEY                          (0x01)

/**
 * @def BLE_GAP_KEY_DIST_IDKEY
 * @brief  IRK and Identity Address.
 */
#define BLE_GAP_KEY_DIST_IDKEY                           (0x02)

/**
 * @def BLE_GAP_KEY_DIST_SIGNKEY
 * @brief  CSRK
 */
#define BLE_GAP_KEY_DIST_SIGNKEY                         (0x04)

/**
 * @def BLE_GAP_ID_ADDR_SIZE
 * @brief  The size of identity address.
 */
#define BLE_GAP_ID_ADDR_SIZE                             (0x07)

/**
 * @def BLE_GAP_IRK_SIZE
 * @brief  The size of IRK.
 */
#define BLE_GAP_IRK_SIZE                                 (0x10)

/**
 * @def BLE_GAP_CSRK_SIZE
 * @brief  The size of CSRK.
 */
#define BLE_GAP_CSRK_SIZE                                (0x10)

/**
 * @def BLE_GAP_LTK_SIZE
 * @brief  The size of LTK.
 */
#define BLE_GAP_LTK_SIZE                                 (0x10)

/**
 * @def BLE_GAP_EDIV_SIZE
 * @brief  The size of EDIV.
 */
#define BLE_GAP_EDIV_SIZE                                (0x02)

/**
 * @def BLE_GAP_RAND_64_BIT_SIZE
 * @brief The size of Rand.
 */
#define BLE_GAP_RAND_64_BIT_SIZE                         (0x08)

/**
 * @def BLE_GAP_UNAUTH_PAIRING
 * @brief Unauthenticated pairing.
 */
#define BLE_GAP_UNAUTH_PAIRING                           (0x01)

/**
 * @def BLE_GAP_AUTH_PAIRING
 * @brief Authenticated pairing.
 */
#define BLE_GAP_AUTH_PAIRING                             (0x02)

/**
 * @def BLE_GAP_LEGACY_PAIRING
 * @brief  Legacy pairing.
 */
#define BLE_GAP_LEGACY_PAIRING                           (0x01)

/**
 * @def BLE_GAP_LESC_PAIRING
 * @brief Secure Connections.
 */
#define BLE_GAP_LESC_PAIRING                             (0x02)

/**
 * @def BLE_GAP_BONDING_NONE
 * @brief The device doesn't support Bonding.
 */
#define BLE_GAP_BONDING_NONE                             (0x00)

/**
 * @def BLE_GAP_BONDING
 * @brief The device supports Bonding.
 */
#define BLE_GAP_BONDING                                  (0x01)

/**
 * @def BLE_GAP_IOCAP_DISPLAY_ONLY
 * @brief Display Only iocapability.
 * @details  Output function : Local device has the ability to display a 6 digit decimal number.\n
 *           Input function : None
 */
#define BLE_GAP_IOCAP_DISPLAY_ONLY                       (0x00)

/**
 * @def BLE_GAP_IOCAP_DISPLAY_YESNO
 * @brief Display Yes/No iocapability.
 * @details  Output function : Output function : Local device has the ability to display a 6 digit decimal number.\n
 *           Input function : Local device has the ability to indicate 'yes' or 'no'
 */
#define BLE_GAP_IOCAP_DISPLAY_YESNO                      (0x01)

/**
 * @def BLE_GAP_IOCAP_KEYBOARD_ONLY
 * @brief Keyboard Only iocapability.
 * @details  Output function : None\n
 *           Input function : Local device has the ability to input the number '0' - '9'.
 */
#define BLE_GAP_IOCAP_KEYBOARD_ONLY                      (0x02)

/**
 * @def BLE_GAP_IOCAP_NOINPUT_NOOUTPUT
 * @brief No Input No Output iocapability.
 * @details  Output function : None\n
 *           Input function : None
 */
#define BLE_GAP_IOCAP_NOINPUT_NOOUTPUT                   (0x03)

/**
 * @def BLE_GAP_IOCAP_KEYBOARD_DISPLAY
 * @brief Keyboard Display iocapability.
 * @details  Output function : Output function : Local device has the ability to display a 6 digit decimal number.\n
 *           Input function : Local device has the ability to input the number '0' - '9'.
 */
#define BLE_GAP_IOCAP_KEYBOARD_DISPLAY                   (0x04)

/**
 * @def BLE_GAP_OOB_DATA_NOT_PRESENT
 * @brief Reply that No OOB data has been received when pairing.
 */
#define BLE_GAP_OOB_DATA_NOT_PRESENT                     (0x00)

/**
 * @def BLE_GAP_OOB_DATA_PRESENT
 * @brief Reply that the OOB data has been received when pairing.
 */
#define BLE_GAP_OOB_DATA_PRESENT                         (0x01)

/**
 * @def BLE_GAP_SC_BEST_EFFORT
 * @brief Accept Legacy pairing and Secure Connections.
 */
#define BLE_GAP_SC_BEST_EFFORT                           (0x00)

/**
 * @def BLE_GAP_SC_STRICT
 * @brief Accept only Secure Connections.
 */
#define BLE_GAP_SC_STRICT                                (0x01)

/**
 * @def BLE_GAP_SC_KEY_PRESS_NTF_NOT_SPRT
 * @brief Not support for Key Press Notification.
 */
#define BLE_GAP_SC_KEY_PRESS_NTF_NOT_SPRT                (0x00)

/**
 * @def BLE_GAP_SC_KEY_PRESS_NTF_SPRT
 * @brief Support for Key Press Notification.
 */
#define BLE_GAP_SC_KEY_PRESS_NTF_SPRT                    (0x01)

/**
 * @def BLE_GAP_LEGACY_OOB_SIZE
 * @brief The size of Temporary Key for OOB in legacy pairing.
 */
#define BLE_GAP_LEGACY_OOB_SIZE                          (0x10)

/**
 * @def BLE_GAP_OOB_CONFIRM_VAL_SIZE
 * @brief The size of Confirmation Value for OOB in Secure Connections.
 */
#define BLE_GAP_OOB_CONFIRM_VAL_SIZE                     (0x10)

/**
 * @def BLE_GAP_OOB_RANDOM_VAL_SIZE
 * @brief The size of Rand for OOB in Secure Connections.
 */
#define BLE_GAP_OOB_RANDOM_VAL_SIZE                      (0x10)

/**
 * @def BLE_GAP_SEC_DEL_LOC_NONE
 * @brief Delete no local keys.
 */
#define BLE_GAP_SEC_DEL_LOC_NONE                         (0x00)

/**
 * @def BLE_GAP_SEC_DEL_LOC_IRK
 * @brief Delete local IRK.
 */
#define BLE_GAP_SEC_DEL_LOC_IRK                          (0x01)

/**
 * @def BLE_GAP_SEC_DEL_LOC_CSRK
 * @brief Delete local CSRK.
 */
#define BLE_GAP_SEC_DEL_LOC_CSRK                         (0x02)

/**
 * @def BLE_GAP_SEC_DEL_LOC_ALL
 * @brief Delete all local keys.
 */
#define BLE_GAP_SEC_DEL_LOC_ALL                          (0x03)

/**
 * @def BLE_GAP_SEC_DEL_REM_NONE
 * @brief Delete no remote device keys.
 */
#define BLE_GAP_SEC_DEL_REM_NONE                         (0x00)

/**
 * @def BLE_GAP_SEC_DEL_REM_SA
 * @brief Delete a key specified by the p_addr parameter.
 */
#define BLE_GAP_SEC_DEL_REM_SA                           (0x01)

/**
 * @def BLE_GAP_SEC_DEL_REM_NOT_CONN
 * @brief Delete keys of not connected remote devices.
 */
#define BLE_GAP_SEC_DEL_REM_NOT_CONN                     (0x02)

/**
 * @def BLE_GAP_SEC_DEL_REM_ALL
 * @brief Delete all remote device keys.
 */
#define BLE_GAP_SEC_DEL_REM_ALL                          (0x03)

/* CTE values */

/**
 * @def BLE_GAP_CTE_DISABLED
 * @brief Disable CTE transmission or receive
 */
#define BLE_GAP_CTE_DISABLED                             (0x00)

/**
 * @def BLE_GAP_CTE_ENABLED
 * @brief Enable CTE transmission or receive
 */
#define BLE_GAP_CTE_ENABLED                              (0x01)

/**
 * @def BLE_GAP_CTE_MAX_ANTENNA
 * @brief Max antenna number
 */
#define BLE_GAP_CTE_MAX_ANTENNA                          (0x4B)

/**
 * @def BLE_GAP_CTE_TYPE_AOA
 * @brief CTE type AoA
 */
#define BLE_GAP_CTE_TYPE_AOA                             (0)

/**
 * @def BLE_GAP_CTE_TYPE_AOD_1US
 * @brief CTE type AoD with slot of 1 us
 */
#define BLE_GAP_CTE_TYPE_AOD_1US                         (1)

/**
 * @def BLE_GAP_CTE_TYPE_AOD_2US
 * @brief CTE type AoD with slot of 2 us
 */
#define BLE_GAP_CTE_TYPE_AOD_2US                         (2)

/**
 * @def BLE_PAST_ALL_PERD
 * @brief
 */
#define BLE_PAST_ALL_PERD                                (0x00)

/**
 * @def BLE_PAST_CTE_TYPE_NO_AOA
 */
#define BLE_PAST_CTE_TYPE_NO_AOA                         (0x01)

/**
 * @def BLE_PAST_CTE_TYPE_NO_AOD_1US
 */
#define BLE_PAST_CTE_TYPE_NO_AOD_1US                     (0x02)

/**
 * @def BLE_PAST_CTE_TYPE_NO_AOD_2US
 */
#define BLE_PAST_CTE_TYPE_NO_AOD_2US                     (0x04)

/**
 * @def BLE_PAST_CTE_TYPE_NO_CTE
 */
#define BLE_PAST_CTE_TYPE_NO_CTE                         (0x08)

/**
 * @def BBLE_PAST_CTE_TYPE_ONLY_CTE
 */
#define BLE_PAST_CTE_TYPE_ONLY_CTE                       (0x10)

/**@} (end addtogroup GAP_API)*/

