fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
/* =================================================== ISO Macro =================================================== */

/** @addtogroup ISO_API
 *  @ingroup BLE_API
 *  @{
 */

/**
 * @def BLE_ISO_MAX_GROUP_ISO_COUNT
 * @brief
 */
#define BLE_ISO_MAX_GROUP_ISO_COUNT                      (4)

/**
 * @def BLE_ISO_PACKING_SEQUENTIAL
 * @brief sequential method of arranging subevents of multiple ISO stream
 */
#define BLE_ISO_PACKING_SEQUENTIAL                       (0x00)

/**
 * @def BLE_ISO_PACKING_INTERLEAVED
 * @brief interleaved method of arranging subevents of multiple ISO stream
 */
#define BLE_ISO_PACKING_INTERLEAVED                      (0x01)

/**
 * @def BLE_ISO_FRAMING_UNFRAMED
 * @brief Unframed format for sending ISO PDUs
 */
#define BLE_ISO_FRAMING_UNFRAMED                         (0x00)

/**
 * @def BLE_ISO_FRAMING_FRAMED
 * @brief Framed format for sending ISO PDUs
 */
#define BLE_ISO_FRAMING_FRAMED                           (0x01)

/**
 * @def BLE_ISO_BROADCAST_CODE_SIZE
 * @brief Broadcast code size in BIG
 */
#define BLE_ISO_BROADCAST_CODE_SIZE                      (16)

/**
 * @def BLE_ISO_TIMESTAMP_NONE
 * @brief timestamp value when ts_valid is 0
 */
#define BLE_ISO_TIMESTAMP_NONE                           (0)

/**
 * @def BLE_ISO_SYNC_MSE_AUTO
 * @brief Let controller choose the max subevent
 */
#define BLE_ISO_SYNC_MSE_AUTO                            (0x00)

/**
 * @def BLE_ISO_CIS_ACCEPT
 * @brief  Accept a CIS request.
 */
#define BLE_ISO_CIS_ACCEPT                               (0x00)

/**
 * @def BLE_ISO_CIS_REJECT
 * @brief  Reject a CIS request.
 */
#define BLE_ISO_CIS_REJECT                               (0x01)

/**
 * @def BLE_ISO_DATA_PATH_HCI
 * @brief Value to set the ISO data path over HCI.
 */
#define BLE_ISO_DATA_PATH_HCI                            (0x00)

/**
 * @def BLE_ISO_DATA_PATH_DIR_INPUT
 * @brief audio datapath directions: App to BLE
 */
#define BLE_ISO_DATA_PATH_DIR_INPUT                      (0x00)

/**
 * @def BLE_ISO_DATA_PATH_DIR_OUTPUT
 * @brief audio datapath directions: BLE to App
 */
#define BLE_ISO_DATA_PATH_DIR_OUTPUT                     (0x01)

/**
 * @def BLE_ISO_DATA_MAX_PDU
 * @brief maximum number of data octets of ISO Data PDU
 */
#define BLE_ISO_DATA_MAX_PDU                             (251)

/**
 * @def BLE_ISO_DATA_MAX_SDU
 * @brief maximum number of data octets of ISO Data SDU
 */
#define BLE_ISO_DATA_MAX_SDU                             (4095)

/**@} (end addtogroup ISO_API)*/

/* =================================================== GATT Macro ================================================== */

/** @addtogroup GATT_SERVER_API
 *  @ingroup BLE_API
 *  @{
 */

/* GATT Common Macro */

/**
 * @ingroup GATT_SERVER_API
 * @def BLE_GATT_DEFAULT_MTU
 * @brief GATT Default MTU.
 */
#define BLE_GATT_DEFAULT_MTU                         (23)

/**
 * @def BLE_GATT_16_BIT_UUID_FORMAT
 * @brief GATT Identification for 16-bit UUID Format.
 */
#define BLE_GATT_16_BIT_UUID_FORMAT                  (0x01)

/**
 * @def BLE_GATT_128_BIT_UUID_FORMAT
 * @brief GATT Identification for 128-bit UUID Format.
 */
#define BLE_GATT_128_BIT_UUID_FORMAT                 (0x02)

/**
 * @def BLE_GATT_16_BIT_UUID_SIZE
 * @brief GATT 16-bit UUID Size.
 */
#define BLE_GATT_16_BIT_UUID_SIZE                    (2)

/**
 * @def BLE_GATT_128_BIT_UUID_SIZE
 * @brief GATT 128-bit UUID Size.
 */
#define BLE_GATT_128_BIT_UUID_SIZE                   (16)

/**
 * @def BLE_GATT_INVALID_ATTR_HDL_VAL
 * @brief GATT Invalid Attribute Handle Value.
 */
#define BLE_GATT_INVALID_ATTR_HDL_VAL                (0x0000)

/**
 * @def BLE_GATT_ATTR_HDL_START_RANGE
 * @brief GATT Attribute Handle Start Range.
 */
#define BLE_GATT_ATTR_HDL_START_RANGE                (0x0001)

/**
 * @def BLE_GATT_ATTR_HDL_END_RANGE
 * @brief GATT Attribute Handle End Range.
 */
#define BLE_GATT_ATTR_HDL_END_RANGE                  (0xFFFF)

/* GATT Server Macro */

/**
 * @def BLE_GATTS_CLI_CNFG_NOTIFICATION
 * @brief GATT Client Configuration values. Enable Notification.
 */
#define BLE_GATTS_CLI_CNFG_NOTIFICATION              (0x0001)

/**
 * @def BLE_GATTS_CLI_CNFG_INDICATION
 * @brief GATT Client Configuration values. Enable Indication.
 */
#define BLE_GATTS_CLI_CNFG_INDICATION                (0x0002)

/**
 * @def BLE_GATTS_CLI_CNFG_DEFAULT
 * @brief GATT Client Configuration values. Default value or disable notification/indication.
 */
#define BLE_GATTS_CLI_CNFG_DEFAULT                   (0x0000)

/**
 * @def BLE_GATTS_SER_CNFG_BROADCAST
 * @brief GATT Server Configuration values. Enable broadcast.
 */
#define BLE_GATTS_SER_CNFG_BROADCAST                 (0x0001)

/**
 * @def BLE_GATTS_SER_CNFG_DEFAULT
 * @brief GATT Server Configuration values. Default value.
 */
#define BLE_GATTS_SER_CNFG_DEFAULT                   (0x0000)

/**
 * @def BLE_GATTS_MAX_CB
 * @brief GATT Server Callback Number.
 */
#define BLE_GATTS_MAX_CB                             (15)

/* GATT Server Operation */

/**
 * @def BLE_GATTS_OP_CHAR_VALUE_READ_REQ
 * @brief Characteristic Value Local Read Operation.
 */
#define BLE_GATTS_OP_CHAR_VALUE_READ_REQ             (0x01)

/**
 * @def BLE_GATTS_OP_CHAR_VALUE_WRITE_REQ
 * @brief Characteristic Value Local Write Operation.
 */
#define BLE_GATTS_OP_CHAR_VALUE_WRITE_REQ            (0x02)

/**
 * @def BLE_GATTS_OP_CHAR_VALUE_WRITE_WITHOUT_REQ
 * @brief Characteristic Value Local Write Without Response Operation.
 */
#define BLE_GATTS_OP_CHAR_VALUE_WRITE_WITHOUT_REQ    (0x03)

/**
 * @def BLE_GATTS_OP_CHAR_CLI_CNFG_READ_REQ
 * @brief Characteristic Client Configuration Local Read Operation.
 */
#define BLE_GATTS_OP_CHAR_CLI_CNFG_READ_REQ          (0x11)

/**
 * @def BLE_GATTS_OP_CHAR_CLI_CNFG_WRITE_REQ
 * @brief Characteristic Client Configuration Local Write Operation.
 */
#define BLE_GATTS_OP_CHAR_CLI_CNFG_WRITE_REQ         (0x12)

/**
 * @def BLE_GATTS_OP_CHAR_SER_CNFG_READ_REQ
 * @brief Characteristic Server Configuration Local Read Operation.
 */
#define BLE_GATTS_OP_CHAR_SER_CNFG_READ_REQ          (0x21)

/**
 * @def BLE_GATTS_OP_CHAR_SER_CNFG_WRITE_REQ
 * @brief Characteristic Server Configuration Local Write Operation.
 */
#define BLE_GATTS_OP_CHAR_SER_CNFG_WRITE_REQ         (0x22)

/**
 * @def BLE_GATTS_OP_CHAR_PEER_READ_REQ
 * @brief Characteristic Value Peer Read Operation.
 */
#define BLE_GATTS_OP_CHAR_PEER_READ_REQ              (0x81)

/**
 * @def BLE_GATTS_OP_CHAR_PEER_WRITE_REQ
 * @brief Characteristic Value Peer Write Operation.
 */
#define BLE_GATTS_OP_CHAR_PEER_WRITE_REQ             (0x82)

/**
 * @def BLE_GATTS_OP_CHAR_PEER_WRITE_CMD
 * @brief Characteristic Value Peer Write Command.
 */
#define BLE_GATTS_OP_CHAR_PEER_WRITE_CMD             (0x84)

/**
 * @def BLE_GATTS_OP_CHAR_PEER_CLI_CNFG_READ_REQ
 * @brief Characteristic Client Configuration Peer Read Operation.
 */
#define BLE_GATTS_OP_CHAR_PEER_CLI_CNFG_READ_REQ     (0x91)

/**
 * @def BLE_GATTS_OP_CHAR_PEER_CLI_CNFG_WRITE_REQ
 * @brief Characteristic Client Configuration Peer Write Operation.
 */
#define BLE_GATTS_OP_CHAR_PEER_CLI_CNFG_WRITE_REQ    (0x92)

/**
 * @def BLE_GATTS_OP_CHAR_PEER_SER_CNFG_READ_REQ
 * @brief Characteristic Server Configuration Peer Read Operation.
 */
#define BLE_GATTS_OP_CHAR_PEER_SER_CNFG_READ_REQ     (0xA1)

/**
 * @def BLE_GATTS_OP_CHAR_PEER_SER_CNFG_WRITE_REQ
 * @brief Characteristic Server Configuration Peer Write Operation.
 */
#define BLE_GATTS_OP_CHAR_PEER_SER_CNFG_WRITE_REQ    (0xA2)

/**
 * @def BLE_GATTS_OP_CHAR_PEER_USR_DESC_READ_REQ
 * @brief Characteristic User Description Peer Read Operation.
 */
#define BLE_GATTS_OP_CHAR_PEER_USR_DESC_READ_REQ     (0xB1)

/**
 * @def BLE_GATTS_OP_CHAR_PEER_USR_DESC_WRITE_REQ
 * @brief Characteristic User Description Peer Write Operation.
 */
#define BLE_GATTS_OP_CHAR_PEER_USR_DESC_WRITE_REQ    (0xB2)

/**
 * @def BLE_GATTS_OP_CHAR_PEER_HLD_DESC_READ_REQ
 * @brief Characteristic Higher Layer Defined Descriptor Peer Read Operation.
 */
#define BLE_GATTS_OP_CHAR_PEER_HLD_DESC_READ_REQ     (0xF1)

/**
 * @def BLE_GATTS_OP_CHAR_PEER_HLD_DESC_WRITE_REQ
 * @brief Characteristic Higher Layer Defined Descriptor Peer Write Operation.
 */
#define BLE_GATTS_OP_CHAR_PEER_HLD_DESC_WRITE_REQ    (0xF2)

/**
 * @def BLE_GATTS_OP_CHAR_REQ_AUTHOR
 * @brief Operation Required Authorization.
 */
#define BLE_GATTS_OP_CHAR_REQ_AUTHOR                 (0x08)

