fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
/* GATT Database */

/**
 * @def BLE_GATT_DB_READ
 * @brief Allow clients to read.
 */
#define BLE_GATT_DB_READ                             (0x01)

/**
 * @def BLE_GATT_DB_WRITE
 * @brief Allow clients to write.
 */
#define BLE_GATT_DB_WRITE                            (0x02)

/**
 * @def BLE_GATT_DB_WRITE_WITHOUT_RSP
 * @brief Allow clients to write without response.
 */
#define BLE_GATT_DB_WRITE_WITHOUT_RSP                (0x04)

/**
 * @def BLE_GATT_DB_READ_WRITE
 * @brief Allow clients to access of all.
 */
#define BLE_GATT_DB_READ_WRITE \
    (BLE_GATT_DB_READ | BLE_GATT_DB_WRITE | BLE_GATT_DB_WRITE_WITHOUT_RSP)

/**
 * @def BLE_GATT_DB_NO_AUXILIARY_PROPERTY
 * @brief No auxiliary properties.
 */
#define BLE_GATT_DB_NO_AUXILIARY_PROPERTY         (0x00)

/**
 * @def BLE_GATT_DB_FIXED_LENGTH_PROPERTY
 * @brief Fixed length attribute value.
 */
#define BLE_GATT_DB_FIXED_LENGTH_PROPERTY         (0x01)

/**
 * @def BLE_GATT_DB_AUTHORIZATION_PROPERTY
 * @brief  Attributes requiring authorization.
 */
#define BLE_GATT_DB_AUTHORIZATION_PROPERTY        (0x02)

/**
 * @def BLE_GATT_DB_ATTR_DISABLED
 * @brief  The attribute is disabled.
 *         If this value is set, the attribute cannot be found and accessed by a GATT Client.
 */
#define BLE_GATT_DB_ATTR_DISABLED                 (0x10)

/**
 * @def BLE_GATT_DB_128_BIT_UUID_FORMAT
 * @brief Attribute with 128 bit UUID.
 */
#define BLE_GATT_DB_128_BIT_UUID_FORMAT           (0x20)

/**
 * @def BLE_GATT_DB_PEER_SPECIFIC_VAL_PROPERTY
 * @brief Attribute managed by each GATT Client.
 */
#define BLE_GATT_DB_PEER_SPECIFIC_VAL_PROPERTY    (0x40)

/**
 * @def BLE_GATT_DB_CONST_ATTR_VAL_PROPERTY
 * @brief Fixed attribute value.
 */
#define BLE_GATT_DB_CONST_ATTR_VAL_PROPERTY       (0x80)

/**
 * @def BLE_GATT_DB_SER_SECURITY_UNAUTH
 * @brief Unauthenticated pairing(Security Mode1 Security Level 2, Security Mode 2 Security Level 1).
 *        Unauthenticated pairing is required to access the service.
 */
#define BLE_GATT_DB_SER_SECURITY_UNAUTH           (0x00000001)

/**
 * @def BLE_GATT_DB_SER_SECURITY_AUTH
 * @brief Authenticated pairing(Security Mode1 Security Level 3, Security Mode 2 Security Level 2).
 *        Authenticated pairing is required to access the service.
 */
#define BLE_GATT_DB_SER_SECURITY_AUTH             (0x00000002)

/**
 * @def BLE_GATT_DB_SER_SECURITY_SECONN
 * @brief Authenticated LE secure connections that generates 16bytes LTK(Security Mode1 Security Level 4).
 *        Authenticated LE secure connections pairing that generates 16bytes LTK is required to access the service.
 *        If this bit is set, bit24-27 are ignored.
 */
#define BLE_GATT_DB_SER_SECURITY_SECONN           (0x00000004)

/**
 * @def BLE_GATT_DB_SER_SECURITY_ENC
 * @brief Encryption.
 *        Encryption by the LTK exchanged in pairing is required to access.
 */
#define BLE_GATT_DB_SER_SECURITY_ENC              (0x00000010)

/**
 * @def BLE_GATT_DB_SER_NO_SECURITY_PROPERTY
 * @brief No Security(Security Mode1 Security Level 1).
 */
#define BLE_GATT_DB_SER_NO_SECURITY_PROPERTY      (0x00000000)

/**
 * @def BLE_GATT_DB_SER_ENC_KEY_SIZE_DONT_CARE
 * @brief 7-byte or larger encryption key.
 */
#define BLE_GATT_DB_SER_ENC_KEY_SIZE_DONT_CARE    (0x00000000)

/**
 * @def BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_7
 * @brief 7-byte encryption key.
 */
#define BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_7        (0x01000000)

/**
 * @def BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_8
 * @brief 8-byte encryption key.
 */
#define BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_8        (0x02000000)

/**
 * @def BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_9
 * @brief 9-byte encryption key.
 */
#define BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_9        (0x03000000)

/**
 * @def BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_10
 * @brief 10-byte encryption key.
 */
#define BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_10       (0x04000000)

/**
 * @def BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_11
 * @brief 11-byte encryption key.
 */
#define BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_11       (0x05000000)

/**
 * @def BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_12
 * @brief 12-byte encryption key.
 */
#define BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_12       (0x06000000)

/**
 * @def BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_13
 * @brief 13-byte encryption key.
 */
#define BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_13       (0x07000000)

/**
 * @def BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_14
 * @brief 14-byte encryption key.
 */
#define BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_14       (0x08000000)

/**
 * @def BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_15
 * @brief 15-byte encryption key.
 */
#define BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_15       (0x09000000)

/**
 * @def BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_16
 * @brief 16-byte encryption key.
 */
#define BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_16       (0x0A000000)

/******************************************************************************************************************//**
 * @enum e_r_ble_gatts_evt_t
 * @brief  GATT Server Event Identifier
 *********************************************************************************************************************/
typedef enum
{
    /**
     *  @brief  MTU Exchange Request has been received.
     *  @details
     *  This event notifies the application layer that a MTU Exchange Request PDU has been received from a GATT Client.
     *  Need to reply to the request by R_BLE_GATTS_RspExMtu().
     *
     * ## Event Code: 0x3002
     *
     *  ## Event Data:
     *  st_ble_gatts_ex_mtu_req_evt_t
     */
    BLE_GATTS_EVENT_EX_MTU_REQ = 0x3002,             //!< BLE_GATTS_EVENT_EX_MTU_REQ

    /**
     *  @brief   Read By Type Response has been sent.
     *  @details
     *  This event notifies the application layer that a Read By Type Response PDU has been sent
     *  from GATT Server to the GATT Client.
     *
     * ## Event Code: 0x3009
     *
     *  ## Event Data:
     *  st_ble_gatts_read_by_type_rsp_evt_t
     */
    BLE_GATTS_EVENT_READ_BY_TYPE_RSP_COMP = 0x3009,  //!< BLE_GATTS_EVENT_READ_BY_TYPE_RSP_COMP

    /**
     *  @brief   Read Response has been sent.
     *  @details
     *  This event notifies the application layer that a Read Response PDU has been sent
     *  from GATT Server to the GATT Client.
     *
     * ## Event Code: 0x300B
     *
     *  ## Event Data:
     *  st_ble_gatts_read_rsp_evt_t
     */
    BLE_GATTS_EVENT_READ_RSP_COMP = 0x300B,          //!< BLE_GATTS_EVENT_READ_RSP_COMP

    /**
     *  @brief   Read Blob Response has been sent.
     *  @details
     *  This event notifies the application layer that a Read Blob Response PDU has been sent
     *  from GATT Server to the GATT Client.
     *
     * ## Event Code: 0x300D
     *
     *  ## Event Data:
     *  st_ble_gatts_read_blob_rsp_evt_t
     */
    BLE_GATTS_EVENT_READ_BLOB_RSP_COMP = 0x300D,     //!< BLE_GATTS_EVENT_READ_BLOB_RSP_COMP

    /**
     *  @brief   Read Multiple Response has been sent.
     *  @details
     *  This event notifies the application layer that a Read Multiple Response PDU has been sent
     *  from GATT Server to the GATT Client.
     *
     * ## Event Code: 0x300F
     *
     *  ## Event Data:
     *  st_ble_gatts_read_multi_rsp_evt_t
     */
    BLE_GATTS_EVENT_READ_MULTI_RSP_COMP = 0x300F,    //!< BLE_GATTS_EVENT_READ_MULTI_RSP_COMP

    /**
     *  @brief   Write Response has been sent.
     *  @details
     *  This event notifies the application layer that a Write Response PDU has been sent
     *  from GATT Server to the GATT Client.
     *
     * ## Event Code: 0x3013
     *
     *  ## Event Data:
     *  st_ble_gatts_write_rsp_evt_t
     */
    BLE_GATTS_EVENT_WRITE_RSP_COMP = 0x3013,         //!< BLE_GATTS_EVENT_WRITE_RSP_COMP

    /**
     *  @brief   Prepare Write Response has been sent.
     *  @details
     *  This event notifies the application layer that a Prepare Write Response PDU has been sent
     *  from GATT Server to the GATT Client.
     *
     * ## Event Code: 0x3017
     *
     *  ## Event Data:
     *  st_ble_gatts_prepare_write_rsp_evt_t
     */
    BLE_GATTS_EVENT_PREPARE_WRITE_RSP_COMP = 0x3017, //!< BLE_GATTS_EVENT_PREPARE_WRITE_RSP_COMP

    /**
     *  @brief   Execute Write Response has been sent.
     *  @details
     *  This event notifies the application layer that a Execute Write Response PDU has been sent
     *  from GATT Server to the GATT Client.
     *
     * ## Event Code: 0x3019
     *
     *  ## Event Data:
     *  st_ble_gatts_exe_write_rsp_evt_t
     */
    BLE_GATTS_EVENT_EXE_WRITE_RSP_COMP = 0x3019,     //!< BLE_GATTS_EVENT_EXE_WRITE_RSP_COMP

    /**
     *  @brief   Confirmation has been received.
     *  @details
     *  This event notifies the application layer that a Confirmation PDU has been received from a GATT Client.
     *
     * ## Event Code: 0x301E
     *
     *  ## Event Data:
     *  st_ble_gatts_cfm_evt_t
     */
    BLE_GATTS_EVENT_HDL_VAL_CNF = 0x301E,            //!< BLE_GATTS_EVENT_HDL_VAL_CNF

    /**
     *  @brief   The GATT Database has been accessed from a GATT Client.
     *  @details
     *  This event notifies the application layer that the GATT Database has been accessed from a GATT Client.
     *
     * ## Event Code: 0x3040
     *
     *  ## Event Data:
     *  st_ble_gatts_db_access_evt_t
     */
    BLE_GATTS_EVENT_DB_ACCESS_IND = 0x3040,          //!< BLE_GATTS_EVENT_DB_ACCESS_IND

    /**
     *  @brief   A connection has been established.
     *  @details
     *  This event notifies the application layer that the link with the GATT Client has been established.
     *
     * ## Event Code: 0x3081
     *
     *  ## Event Data:
     *  st_ble_gatts_conn_evt_t
     */
    BLE_GATTS_EVENT_CONN_IND = 0x3081,               //!< BLE_GATTS_EVENT_CONN_IND

    /**
     *  @brief   A connection has been disconnected.
     *  @details
     *  This event notifies the application layer that the link with the GATT Client has been disconnected.
     *
     * ## Event Code: 0x3082
     *
     *  ## Event Data:
     *  st_ble_gatts_disconn_evt_t
     */
    BLE_GATTS_EVENT_DISCONN_IND = 0x3082,            //!< BLE_GATTS_EVENT_DISCONN_IND

    /**
     *  @brief   Invalid GATT Server Event.
     *
     * ## Event Code: 0x30FF
     *
     *  ## Event Data:
     *  none
     */
    BLE_GATTS_EVENT_INVALID = 0x30FF                 //!< BLE_GATTS_EVENT_INVALID
} e_r_ble_gatts_evt_t;

/*@}*/

/** @addtogroup GATT_CLIENT_API
 *  @ingroup BLE_API
 *  @{
 */

/**
 * @ingroup GATT_CLIENT_API
 * @def BLE_GATTC_EXECUTE_WRITE_CANCEL_FLAG
 * GATT Execute Write Cancel Flag.
 */
#define BLE_GATTC_EXECUTE_WRITE_CANCEL_FLAG        (0x00)

/**
 * @def BLE_GATTC_EXECUTE_WRITE_EXEC_FLAG
 * GATT Execute Write Execute Flag.
 */
#define BLE_GATTC_EXECUTE_WRITE_EXEC_FLAG          (0x01)

/**
 * @def BLE_GATTC_MAX_CB
 * @brief GATT Client Callback Number.
 */
#define BLE_GATTC_MAX_CB                           (15)

/**
 * @def BLE_GATTC_EXEC_AUTO
 * @brief Auto execution.
 */
#define BLE_GATTC_EXEC_AUTO                        (0x01)

/**
 * @def BLE_GATTC_EXEC_NOT_AUTO
 * @brief Not auto execution.
 */
#define BLE_GATTC_EXEC_NOT_AUTO                    (0x02)

/* To be moved to parameter files */

/**
 * @def BLE_GATTC_RELIABLE_WRITES_MAX_CHAR_PAIR
 * @brief Length of the Queue used with Prepare Write procedure to write a characteristic
 *        whose size is larger than MTU.
 */
#define BLE_GATTC_RELIABLE_WRITES_MAX_CHAR_PAIR    (10)

/******************************************************************************************************************//**
 * @enum e_r_ble_gattc_evt_t
 * @brief  GATT Client Event Identifier
 *********************************************************************************************************************/
typedef enum
{
    /**
     *  @brief  This event notifies the application layer that a problem has occurred in the GATT Server while
     *          processing a request from GATT Client.
     *  @details When GATT Client has received a Error Response PDU from a GATT Server, BLE_GATTC_EVENT_ERROR_RSP
     *           event is notified the application layer.
     *
     * ## Event Code: 0x4001
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gattc_err_rsp_evt_t
     */
    BLE_GATTC_EVENT_ERROR_RSP = 0x4001,                 //!< BLE_GATTC_EVENT_ERROR_RSP

    /**
     *  @brief  This event notifies the application layer that a MTU Exchange Response PDU has been received
     *          from a GATT Server.
     *
     * ## Event Code: 0x4003
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_RSP_TIMEOUT(0x0011)</td>
     *                  <td>30 seconds or more have passed without receiving a Exchange MTU Response
     *                      since GATT Client sent a Exchange MTU Request PDU to the GATT Server.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gattc_ex_mtu_rsp_evt_t
     */
    BLE_GATTC_EVENT_EX_MTU_RSP = 0x4003,                //!< BLE_GATTC_EVENT_EX_MTU_RSP

    /**
     *  @brief  When the read of Characteristic specified by UUID has been completed,
     *          this event is notified to the application layer.
     *
     * ## Event Code: 0x4009
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_RSP_TIMEOUT(0x0011)</td>
     *                  <td>30 seconds or more have passed without receiving a Exchange MTU Response
     *                      since GATT Client sent a Exchange MTU Request PDU to the GATT Server.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gattc_rd_char_evt_t
     */
    BLE_GATTC_EVENT_CHAR_READ_BY_UUID_RSP = 0x4009,     //!< BLE_GATTC_EVENT_CHAR_READ_BY_UUID_RSP

    /**
     *  @brief  When the read of Characteristic/Characteristic Descriptor has been completed,
     *          this event is notified to the application layer.
     *
     * ## Event Code: 0x400B
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_RSP_TIMEOUT(0x0011)</td>
     *                  <td>30 seconds or more have passed without receiving a read response
     *                      since GATT Client sent a request for read by R_BLE_GATTC_ReadCharUsingUuid()
     *                      to the GATT Server.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gattc_rd_char_evt_t
     */
    BLE_GATTC_EVENT_CHAR_READ_RSP = 0x400B,             //!< BLE_GATTC_EVENT_CHAR_READ_RSP

    /**
     *  @brief  After calling R_BLE_GATTC_ReadLongChar(), this event notifies the application layer
     *          that the partial contents of Long Characteristic/Long Characteristic Descriptor
     *          has been received from the GATT Server.
     *
     * ## Event Code: 0x400D
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_RSP_TIMEOUT(0x0011)</td>
     *                  <td>30 seconds or more have passed without receiving a read response
     *                      since GATT Client sent a request for read by R_BLE_GATTC_ReadLongChar() to the GATT Server.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gattc_rd_char_evt_t
     */
    BLE_GATTC_EVENT_CHAR_PART_READ_RSP = 0x400D,        //!< BLE_GATTC_EVENT_CHAR_PART_READ_RSP

    /**
     *  @brief  This event notifies the application layer that
     *          the read of multiple Characteristics has been completed.
     *
     * ## Event Code: 0x400F
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_RSP_TIMEOUT(0x0011)</td>
     *                  <td>30 seconds or more have passed without receiving a read response
     *                      since GATT Client sent a request for read by R_BLE_GATTC_ReadMultiChar()
     *                      to the GATT Server.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gattc_rd_multi_char_evt_t
     */
    BLE_GATTC_EVENT_MULTI_CHAR_READ_RSP = 0x400F,       //!< BLE_GATTC_EVENT_MULTI_CHAR_READ_RSP

    /**
     *  @brief  This event notifies the application layer that the write of
     *          Characteristic/Characteristic Descriptor has been completed.
     *
     * ## Event Code: 0x4013
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_RSP_TIMEOUT(0x0011)</td>
     *                  <td>30 seconds or more have passed without receiving a write response
     *                      since GATT Client sent a request for write by R_BLE_GATTC_WriteChar() to the GATT Server.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gattc_wr_char_evt_t
     */
    BLE_GATTC_EVENT_CHAR_WRITE_RSP = 0x4013,            //!< BLE_GATTC_EVENT_CHAR_WRITE_RSP

    /**
     *  @brief  This event notifies the application layer that the write without response of
     *          Characteristic/Characteristic Descriptor has been completed.
     *
     * ## Event Code: 0x4014
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_RSP_TIMEOUT(0x0011)</td>
     *                  <td>30 seconds or more have passed without receiving a write response
     *                      since GATT Client sent a request for write by R_BLE_GTL_GATTC_WriteCharWithoutRsp()
     *                      to the GATT Server.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gattc_wr_char_evt_t
     */
    BLE_GATTC_EVENT_CHAR_WRITE_WITHOUT_RSP = 0x4014,

    /**
     *  @brief  This event notifies the application layer of the one of the following.
     *          - A segmentation to be written to Long Characteristic/Long Characteristic Descriptor
     *            has been sent to the GATT Server.
     *          - The data written to one Characteristic by Reliable Writes has been sent to the GATT Server.
     *
     * ## Event Code: 0x4017
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_RSP_TIMEOUT(0x0011)</td>
     *                  <td>30 seconds or more have passed without receiving a response since GATT Client sent a
     *                      request for segmentation write by R_BLE_GATTC_WriteLongChar(),
     *                      or 1 Characteristic write by R_BLE_GATTC_ReliableWrites() to the GATT Server.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gattc_char_part_wr_evt_t
     */
    BLE_GATTC_EVENT_CHAR_PART_WRITE_RSP = 0x4017,       //!< BLE_GATTC_EVENT_CHAR_PART_WRITE_RSP

    /**
     *  @brief  This event notifies the application layer that a Notification has been received from a GATT Server.
     *
     * ## Event Code: 0x401B
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gattc_ntf_evt_t
     */
    BLE_GATTC_EVENT_HDL_VAL_NTF = 0x401B,               //!< BLE_GATTC_EVENT_HDL_VAL_NTF

    /**
     *  @brief  This event notifies the application layer that a Indication has been received from a GATT Server.
     *  @details When the GATT Client has received a Indication, host stack automatically sends a Confirmation
     *           to the GATT Server.
     *
     * ## Event Code: 0x401D
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_MEM_ALLOC_FAILED(0x000C)</td>
     *                  <td>Insufficient resource is needed to generate the confirmation packet. </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gattc_ind_evt_t
     */
    BLE_GATTC_EVENT_HDL_VAL_IND = 0x401D,               //!< BLE_GATTC_EVENT_HDL_VAL_IND

    /**
     *  @brief  This event notifies the application layer that a service changed indication
     *          has been received from a GATT Server.
     *  @details When the GATT Client has received a Indication from a Service Changed characteristic.
     *
     * ## Event Code: 0x401E
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_MEM_ALLOC_FAILED(0x000C)</td>
     *                  <td>Insufficient resource is needed to generate the confirmation packet. </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gattc_svc_chng_evt_t
     */

