fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
    BLE_GATTC_EVENT_HDL_VAL_SVC_CHNG = 0x401E,          //!< BLE_GATTC_EVENT_HDL_VAL_SVC_CHNG

    /**
     *  @brief  This event notifies the application layer that the link with the GATT Server has been established.
     *
     * ## Event Code: 0x4081
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gattc_conn_evt_t
     */
    BLE_GATTC_EVENT_CONN_IND = 0x4081,                  //!< BLE_GATTC_EVENT_CONN_IND

    /**
     *  @brief  This event notifies the application layer that the link with the GATT Server has been disconnected.
     *
     * ## Event Code: 0x4082
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gattc_disconn_evt_t
     */
    BLE_GATTC_EVENT_DISCONN_IND = 0x4082,               //!< BLE_GATTC_EVENT_DISCONN_IND

    /**
     *  @brief  This event notifies the application layer that 16-bit UUID Primary Service has been discovered.
     *
     * ## Event Code: 0x40E0
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gattc_serv_16_evt_t
     */
    BLE_GATTC_EVENT_PRIM_SERV_16_DISC_IND = 0x40E0,     //!< BLE_GATTC_EVENT_PRIM_SERV_16_DISC_IND

    /**
     *  @brief  This event notifies the application layer that 128-bit UUID Primary Service has been discovered.
     *
     * ## Event Code: 0x40E1
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gattc_serv_128_evt_t
     */
    BLE_GATTC_EVENT_PRIM_SERV_128_DISC_IND = 0x40E1,    //!< BLE_GATTC_EVENT_PRIM_SERV_128_DISC_IND

    /**
     *  @brief  When the Primary Service discovery by R_BLE_GATTC_DiscAllPrimServ() has been completed,
     *          this event is notified to the application layer.
     *
     * ## Event Code: 0x40E2
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_GATTC_EVENT_ALL_PRIM_SERV_DISC_COMP = 0x40E2,   //!< BLE_GATTC_EVENT_ALL_PRIM_SERV_DISC_COMP

    /**
     *  @brief  When the Primary Service discovery by R_BLE_GATTC_DiscPrimServ() has been completed,
     *          this event is notified to the application layer.
     *
     * ## Event Code: 0x40E3
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_GATTC_EVENT_PRIM_SERV_DISC_COMP = 0x40E3,       //!< BLE_GATTC_EVENT_PRIM_SERV_DISC_COMP

    /**
     *  @brief  This event notifies the application layer that 16-bit UUID Secondary Service has been discovered.
     *
     * ## Event Code: 0x40E4
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gattc_serv_16_evt_t
     */
    BLE_GATTC_EVENT_SECOND_SERV_16_DISC_IND = 0x40E4,   //!< BLE_GATTC_EVENT_SECOND_SERV_16_DISC_IND

    /**
     *  @brief  This event notifies the application layer that 128-bit UUID Secondary Service has been discovered.
     *
     * ## Event Code: 0x40E5
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gattc_serv_128_evt_t
     */
    BLE_GATTC_EVENT_SECOND_SERV_128_DISC_IND = 0x40E5,  //!< BLE_GATTC_EVENT_SECOND_SERV_128_DISC_IND

    /**
     *  @brief  When the Primary Service discovery by R_BLE_GATTC_DiscAllSecondServ() has been completed,
     *          this event is notified to the application layer.
     *
     * ## Event Code: 0x40E6
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_GATTC_EVENT_ALL_SECOND_SERV_DISC_COMP = 0x40E6, //!< BLE_GATTC_EVENT_ALL_SECOND_SERV_DISC_COMP

    /**
     *  @brief  This event notifies the application layer that Included Service that
     *          includes 16-bit UUID Service has been discovered.
     *
     * ## Event Code: 0x40E7
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gattc_inc_serv_16_evt_t
     */
    BLE_GATTC_EVENT_INC_SERV_16_DISC_IND = 0x40E7,      //!< BLE_GATTC_EVENT_INC_SERV_16_DISC_IND

    /**
     *  @brief  This event notifies the application layer that Included Service that
     *          includes 128-bit UUID Service has been discovered.
     *
     * ## Event Code: 0x40E8
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gattc_inc_serv_128_evt_t
     */
    BLE_GATTC_EVENT_INC_SERV_128_DISC_IND = 0x40E8,     //!< BLE_GATTC_EVENT_INC_SERV_128_DISC_IND

    /**
     *  @brief  When the Included Service discovery by R_BLE_GATTC_DiscIncServ() has been completed,
     *          this event is notified to the application layer.
     *
     * ## Event Code: 0x40E9
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_GATTC_EVENT_INC_SERV_DISC_COMP = 0x40E9,        //!< BLE_GATTC_EVENT_INC_SERV_DISC_COMP

    /**
     *  @brief  This event notifies the application layer that 16-bit UUID Characteristic has been discovered.
     *
     * ## Event Code: 0x40EA
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gattc_char_16_evt_t
     */
    BLE_GATTC_EVENT_CHAR_16_DISC_IND = 0x40EA,          //!< BLE_GATTC_EVENT_CHAR_16_DISC_IND

    /**
     *  @brief  This event notifies the application layer that 128-bit UUID Characteristic has been discovered.
     *
     * ## Event Code: 0x40EB
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gattc_char_128_evt_t
     */
    BLE_GATTC_EVENT_CHAR_128_DISC_IND = 0x40EB,         //!< BLE_GATTC_EVENT_CHAR_128_DISC_IND

    /**
     *  @brief  When the Characteristic discovery by R_BLE_GATTC_DiscAllChar() has been completed,
     *          this event is notified to the application layer.
     *
     * ## Event Code: 0x40EC
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_GATTC_EVENT_ALL_CHAR_DISC_COMP = 0x40EC,        //!< BLE_GATTC_EVENT_ALL_CHAR_DISC_COMP

    /**
     *  @brief  When the Characteristic discovery by R_BLE_GATTC_DiscCharByUuid() has been completed,
     *          this event is notified to the application layer.
     *
     * ## Event Code: 0x40ED
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_GATTC_EVENT_CHAR_DISC_COMP = 0x40ED,            //!< BLE_GATTC_EVENT_CHAR_DISC_COMP

    /**
     *  @brief  This event notifies the application layer that 16-bit UUID Characteristic Descriptor
     *          has been discovered.
     *
     * ## Event Code: 0x40EE
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gattc_char_desc_16_evt_t
     */
    BLE_GATTC_EVENT_CHAR_DESC_16_DISC_IND = 0x40EE,     //!< BLE_GATTC_EVENT_CHAR_DESC_16_DISC_IND

    /**
     *  @brief  This event notifies the application layer that 128-bit UUID Characteristic Descriptor
     *          has been discovered.
     *
     * ## Event Code: 0x40EF
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gattc_char_desc_128_evt_t
     */
    BLE_GATTC_EVENT_CHAR_DESC_128_DISC_IND = 0x40EF,    //!< BLE_GATTC_EVENT_CHAR_DESC_128_DISC_IND

    /**
     *  @brief  When the Characteristic Descriptor discovery by R_BLE_GATTC_DiscAllCharDesc() has been completed,
     *          this event is notified to the application layer.
     *
     * ## Event Code: 0x40F0
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_GATTC_EVENT_ALL_CHAR_DESC_DISC_COMP = 0x40F0,   //!< BLE_GATTC_EVENT_ALL_CHAR_DESC_DISC_COMP

    /**
     *  @brief  After calling R_BLE_GATTC_ReadLongChar(), this event notifies the application layer that all of
     *          the contents of the Characteristic/Long Characteristic Descriptor has been received
     *          from the GATT Server.
     *
     * ## Event Code: 0x40F1
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_GATTC_EVENT_LONG_CHAR_READ_COMP = 0x40F1,       //!< BLE_GATTC_EVENT_LONG_CHAR_READ_COMP

    /**
     *  @brief  This event notifies that the application layer that the write of
     *          Long Characteristic/Long Characteristic Descriptor has been completed.
     *
     * ## Event Code: 0x40F2
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_RSP_TIMEOUT(0x0011)</td>
     *                  <td>30 seconds or more have passed without receiving a response since GATT Client sent
     *                      a request for write by R_BLE_GATTC_WriteLongChar() to the GATT Server.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_GATTC_EVENT_LONG_CHAR_WRITE_COMP = 0x40F2,      //!< BLE_GATTC_EVENT_LONG_CHAR_WRITE_COMP

    /**
     *  @brief  This event notifies that the application layer that
     *          the GATT Server has received the data to be written to the Characteristics.
     *
     * ## Event Code: 0x40F3
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_GATTC_EVENT_RELIABLE_WRITES_TX_COMP = 0x40F3,   //!< BLE_GATTC_EVENT_RELIABLE_WRITES_TX_COMP

    /**
     *  @brief  This event notifies the application layer that the Reliable Writes has been completed.
     *
     * ## Event Code: 0x40F4
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_RSP_TIMEOUT(0x0011)</td>
     *                  <td>30 seconds or more have passed without receiving a response since GATT Client sent a
     *                      request for execute write by R_BLE_GATTC_ReliableWrites() to the GATT Server.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gattc_reliable_writes_comp_evt_t
     */
    BLE_GATTC_EVENT_RELIABLE_WRITES_COMP = 0x40F4,      //!< BLE_GATTC_EVENT_RELIABLE_WRITES_COMP

/**
 *  @brief  This event notifies the application layer that the Execute Write Command has been completed.
 *
 * ## Event Code: 0x40F5
 *
 *  ## result:
 *  <dl class="retval"><dt><dd>
 *          <table class="retval">
 *              <tr>
 *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
 *                  <td>Success </td>
 *              </tr>
 *          </table>
 *  </dd></dt></dl>
 *
 *  ## Event Data:
 *  st_ble_gattc_reliable_writes_comp_evt_t
 */
    BLE_GATTC_EVENT_EXECUTE_WRITE_COMP = 0x40F5,        //!< BLE_GATTC_EVENT_RELIABLE_WRITES_COMP

/**
 *  @brief  This event notifies the application layer that an Information Request Indication has been received.
 *
 * ## Event Code: 0x40F6
 *
 *  ## result:
 *  <dl class="retval"><dt><dd>
 *          <table class="retval">
 *              <tr>
 *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
 *                  <td>Success </td>
 *              </tr>
 *          </table>
 *  </dd></dt></dl>
 *
 *  ## Event Data:
 *  st_ble_gattc_reliable_writes_comp_evt_t
 */
    BLE_GATTC_EVENT_ATT_INFO_REQ_IND = 0x40F6,          //!< BLE_GATTC_EVENT_ATT_INFO_REQ_IND

    /**
     *  @brief  Invalid GATT Client Event.
     *
     * ## Event Code: 0x40FF
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_GATTC_EVENT_INVALID = 0x40FF                    //!< BLE_GATTC_EVENT_INVALID
} e_r_ble_gattc_evt_t;

/*@}*/

