fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
/* ================================================== L2CAP Macro ================================================== */

/** @addtogroup L2CAP_API
 *  @ingroup BLE_API
 *  @{
 */

/**
 * @ingroup l2cap_api
 * @def BLE_L2CAP_MAX_CBFC_PSM
 * @brief The maximum number of callbacks that host stack can register.
 */
#define BLE_L2CAP_MAX_CBFC_PSM                (2)

/**
 * @def BLE_L2CAP_CF_RSP_SUCCESS
 * @brief Notify the remote device that the connection can be established.
 */
#define BLE_L2CAP_CF_RSP_SUCCESS              (0x0000)

/**
 * @def BLE_L2CAP_CF_RSP_RFSD_INSF_AUTH
 * @brief Notify the remote device that the connection can not be established because of insufficient authentication.
 */
#define BLE_L2CAP_CF_RSP_RFSD_INSF_AUTH       (0x0005)

/**
 * @def BLE_L2CAP_CF_RSP_RFSD_INSF_AUTRZ
 * @brief Notify the remote device that the connection can not be established because of insufficient Authorization.
 */
#define BLE_L2CAP_CF_RSP_RFSD_INSF_AUTRZ      (0x0006)

/**
 * @def BLE_L2CAP_CF_RSP_RFSD_INSF_ENC_KEY
 * @brief Notify the remote device that the connection can not be established because of Encryption Key Size.
 */
#define BLE_L2CAP_CF_RSP_RFSD_INSF_ENC_KEY    (0x0007)

/**
 * @def BLE_L2CAP_CF_RSP_RFSD_INSF_ENC
 * @brief Notify the remote device that the connection can not be established because of Encryption.
 */
#define BLE_L2CAP_CF_RSP_RFSD_INSF_ENC        (0x0008)

/**
 * @def BLE_L2CAP_CF_RSP_RFSD_UNAC_PARAM
 * @brief Notify the remote device that the connection can not be established
 *        because the parameters is unacceptable to local device.
 */
#define BLE_L2CAP_CF_RSP_RFSD_UNAC_PARAM      (0x000B)

/*@}*/

/* ============================================= Vendor Specific Macro ============================================= */

/** @addtogroup VS_API
 *  @ingroup BLE_API
 *  @{
 */

/**
 * @ingroup vs_api
 * @def BLE_VS_TX_POWER_HIGH
 * @brief High power level.
 */
#define BLE_VS_TX_POWER_HIGH            (0x00)

/**
 * @def BLE_VS_TX_POWER_MID
 * @brief Middle power level.
 */
#define BLE_VS_TX_POWER_MID             (0x01)

/**
 * @def BLE_VS_TX_POWER_LOW
 * @brief Low power level.
 */
#define BLE_VS_TX_POWER_LOW             (0x02)

/**
 * @def BLE_VS_ADDR_AREA_REG
 * @brief Address in register is written or read.
 */
#define BLE_VS_ADDR_AREA_REG            (0x00)

/**
 * @def BLE_VS_ADDR_AREA_DATA_FLASH
 * @brief Address in DataFlash is written or read.
 */
#define BLE_VS_ADDR_AREA_DATA_FLASH     (0x01)

/**
 * @def BLE_VS_EH_TX_PL_PRBS9
 * @brief PRBS9 sequence '11111111100000111101..'.
 */
#define BLE_VS_EH_TX_PL_PRBS9           (0x00)

/**
 * @def BLE_VS_EH_TX_PL_11110000
 * @brief Repeated '11110000'
 */
#define BLE_VS_EH_TX_PL_11110000        (0x01)

/**
 * @def BLE_VS_EH_TX_PL_10101010
 * @brief Repeated '10101010'
 */
#define BLE_VS_EH_TX_PL_10101010        (0x02)

/**
 * @def BLE_VS_EH_TX_PL_PRBS15
 * @brief PRBS15 sequence
 */
#define BLE_VS_EH_TX_PL_PRBS15          (0x03)

/**
 * @def BLE_VS_EH_TX_PL_11111111
 * @brief Repeated '11111111'
 */
#define BLE_VS_EH_TX_PL_11111111        (0x04)

/**
 * @def BLE_VS_EH_TX_PL_00000000
 * @brief Repeated '00000000'
 */
#define BLE_VS_EH_TX_PL_00000000        (0x05)

/**
 * @def BLE_VS_EH_TX_PL_00001111
 * @brief Repeated '00001111'
 */
#define BLE_VS_EH_TX_PL_00001111        (0x06)

/**
 * @def BLE_VS_EH_TX_PL_01010101
 * @brief Repeated '01010101'
 */
#define BLE_VS_EH_TX_PL_01010101        (0x07)

/**
 * @def BLE_VS_EH_TEST_PHY_1M
 * @brief 1M PHY used in Transmitter/Receiver test.
 */
#define BLE_VS_EH_TEST_PHY_1M           (0x01)

/**
 * @def BLE_VS_EH_TEST_PHY_2M
 * @brief 2M PHY used in Transmitter/Receiver test.
 */
#define BLE_VS_EH_TEST_PHY_2M           (0x02)

/**
 * @def BLE_VS_EH_TEST_PHY_CODED
 * @brief Coded PHY used in Receiver test.
 */
#define BLE_VS_EH_TEST_PHY_CODED        (0x03)

/**
 * @def BLE_VS_EH_TEST_PHY_CODED_S_8
 * @brief Coded PHY(S=8) used in Transmitter test.
 */
#define BLE_VS_EH_TEST_PHY_CODED_S_8    (0x03)

/**
 * @def BLE_VS_EH_TEST_PHY_CODED_S_2
 * @brief Coded PHY(S=2) used in Transmitter test.
 */
#define BLE_VS_EH_TEST_PHY_CODED_S_2    (0x04)

/**
 * @def BLE_VS_RF_OFF
 * @brief RF power off.
 */
#define BLE_VS_RF_OFF                   (0x00)

/**
 * @def BLE_VS_RF_ON
 * @brief RF power on.
 */
#define BLE_VS_RF_ON                    (0x01)

/**
 * @def BLE_VS_RF_INIT_PARAM_NOT_CHG
 * @brief The parameters are not changed in RF power on.
 */
#define BLE_VS_RF_INIT_PARAM_NOT_CHG    (0x00)

/**
 * @def BLE_VS_RF_INIT_PARAM_CHG
 * @brief The parameters are changed in RF power on.
 */
#define BLE_VS_RF_INIT_PARAM_CHG        (0x01)

/**
 * @def BLE_VS_CS_PRIM_ADV_S_8
 * @brief Coding scheme for Primary Advertising PHY(S=8).
 */
#define BLE_VS_CS_PRIM_ADV_S_8          (0x00)

/**
 * @def BLE_VS_CS_PRIM_ADV_S_2
 * @brief Coding scheme for Primary Advertising PHY(S=2).
 */
#define BLE_VS_CS_PRIM_ADV_S_2          (0x01)

/**
 * @def BLE_VS_CS_SECOND_ADV_S_8
 * @brief Coding scheme for Secondary Advertising PHY(S=8).
 */
#define BLE_VS_CS_SECOND_ADV_S_8        (0x00)

/**
 * @def BLE_VS_CS_SECOND_ADV_S_2
 * @brief Coding scheme for Secondary Advertising PHY(S=2).
 */
#define BLE_VS_CS_SECOND_ADV_S_2        (0x02)

/**
 * @def BLE_VS_CS_CONN_S_8
 * @brief Coding scheme for request for link establishment(S=8).
 */
#define BLE_VS_CS_CONN_S_8              (0x00)

/**
 * @def BLE_VS_CS_CONN_S_2
 * @brief Coding scheme for request for link establishment(S=2).
 */
#define BLE_VS_CS_CONN_S_2              (0x04)

/**
 * @def BLE_VS_TX_FLOW_CTL_ON
 * @brief  It means that the number of buffer has reached the High Water Mark from flow off state.
 */
#define BLE_VS_TX_FLOW_CTL_ON           (0x00)

/**
 * @def BLE_VS_TX_FLOW_CTL_OFF
 * @brief  It means that the number of buffer has reached the Low Water Mark from flow on state.
 */
#define BLE_VS_TX_FLOW_CTL_OFF          (0x01)

/**
 * @def BLE_VS_SLEEP_OFF
 * @brief  Disable sleep mode in DA1453x
 */
#define BLE_VS_SLEEP_OFF                (0x00)

/**
 * @def BLE_VS_EXTENDED_SLEEP
 * @brief  Set DA1453x in Extended Sleep mode
 */
#define BLE_VS_EXTENDED_SLEEP           (0x01)

/**
 * @def BLE_VS_DEEP_SLEEP
 * @brief  Set DA1453x in Deep Sleep mode
 */
#define BLE_VS_DEEP_SLEEP               (0x02)

/**
 * @def BLE_VS_HIBERNATION
 * @brief  Set DA1453x in Hibernation  mode
 */
#define BLE_VS_HIBERNATION              (0x03)

/**
 * @def BLE_VS_RAM_POWER_ON
 * @brief  Set DA1453x RAM is retained in Deep/Hibernation modes
 */
#define BLE_VS_RAM_POWER_ON             (0x00)

/**
 * @def BLE_VS_RAM_POWER_OFF
 * @brief  Set DA1453x is not retained in Deep/Hibernation modes
 */
#define BLE_VS_RAM_POWER_OFF            (0x01)

/*@}*/

