fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
/* ========================================== Event Notification Definitions ====================================== */

#define BLE_EVENT_NOTIFY_CONNECTION_START_POS     (0)
#define BLE_EVENT_NOTIFY_ADVERTISING_POS          (1)
#define BLE_EVENT_NOTIFY_SCANNING_POS             (2)
#define BLE_EVENT_NOTIFY_INITIATING_START_POS     (3)
#define BLE_EVENT_NOTIFY_CONNECTION_CLOSE_POS     (4)
#define BLE_EVENT_NOTIFY_ADVERTISING_CLOSE_POS    (5)
#define BLE_EVENT_NOTIFY_SCANNING_CLOSE_POS       (6)
#define BLE_EVENT_NOTIFY_INITIATING_CLOSE_POS     (7)
#define BLE_EVENT_NOTIFY_DEEP_SLEEP_START_POS     (8)
#define BLE_EVENT_NOTIFY_DEEP_SLEEP_WAKEUP_POS    (9)

/******************************************************************************************************************//**
 * @typedef ble_mcu_clock_change_cb_t
 * @brief   ble_mcu_clock_change_cb_t is the callback function type to use CLKOUT_RF as the MCU main clock source.
 * @param none
 * @return none
 *********************************************************************************************************************/
typedef void (* ble_mcu_clock_change_cb_t)(void);

/******************************************************************************************************************//**
 * @typedef ble_rf_notify_cb_t
 * @brief   ble_rf_notify_cb_t is the RF event notify callback function type.
 * @param[in] uint32_t     The information of RF event notification.
 * @return none
 *********************************************************************************************************************/
typedef void (* ble_rf_notify_cb_t)(uint32_t);

/******************************************************************************************************************//**
 *  @struct st_ble_rf_notify_t
 *  @brief  This structure is RF event notify management.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief Set enable/disable of each RF event notification
     *  @details
     *      Bit0  Notify Connection event start(0:Disable/1:Enable)\n
     *      Bit1  Notify Advertising event start(0:Disable/1:Enable)\n
     *      Bit2  Notify Scanning event start(0:Disable/1:Enable)\n
     *      Bit3  Notify Initiating event start(0:Disable/1:Enable)\n
     *      Bit4  Notify Connection event close(0:Disable/1:Enable)\n
     *      Bit5  Notify Advertising event close(0:Disable/1:Enable)\n
     *      Bit6  Notify Scanning event close(0:Disable/1:Enable)\n
     *      Bit7  Notify Initiating event close(0:Disable/1:Enable)\n
     *      Bit8  Notify RF_DEEP_SLEEP event start(0:Disable/1:Enable)\n
     *      Bit9  Notify RF_DEEP_SLEEP event close(0:Disable/1:Enable)\n
     *      Other Bit: Reserved for future use.\n
     */
    uint32_t enable;

    /**
     *  @brief Set callback function pointer for RF event start
     */
    ble_rf_notify_cb_t start_cb;

    /**
     *  @brief Set callback function pointer for RF event close
     */
    ble_rf_notify_cb_t close_cb;

    /**
     *  @brief Set callback function pointer for RF_DEEP_SLEEP
     */
    ble_rf_notify_cb_t dsleep_cb;
} st_ble_rf_notify_t;

/*@}*/

/* ============================================== GAP Type Definitions ============================================= */

/** @addtogroup GAP_API
 *  @ingroup BLE_API
 *  @{
 */

/******************************************************************************************************************//**
 * @struct st_ble_evt_data_t
 * @brief  st_ble_evt_data_t is the type of the data notified in a GAP Event.
 *************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief The size of GAP Event parameters.
     */
    uint16_t param_len;

    /**
     *  @brief GAP Event parameters. This parameter differs in each GAP Event.
     */
    void * p_param;
} st_ble_evt_data_t;

/******************************************************************************************************************//**
 *  @struct st_ble_dev_addr_t
 *  @brief  st_ble_dev_addr_t is the type of bluetooth device address(BD_ADDR).
 *  @note   The BD address setting format is little endian. \n
 *          If the address is "AA:BB:CC:DD:EE:FF", 
 *          set the byte array in the order {0xFF, 0xEE, 0xDD, 0xCC, 0xBB, 0xAA}.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief BD_ADDR.
     */
    uint8_t addr[BLE_BD_ADDR_LEN];

    /**
     *  @brief Bluetooth address type.
     *  @details
     *               |              macro        |   description     |
     *               |:------------------------- |:----------------- |
     *               | BLE_GAP_ADDR_PUBLIC(0x00) | Public Address.   |
     *               | BLE_GAP_ADDR_RAND(0x01)   | Random Address.   |
     */
    uint8_t type;
} st_ble_dev_addr_t;

/******************************************************************************************************************//**
 * @typedef ble_gap_app_cb_t
 * @brief   ble_gap_app_cb_t is the GAP Event callback function type.
 * @param[in] event_type    The type of GAP Event.
 * @param[in] event_result  The result of API call which generates the GAP Event.
 * @param[in] p_event_data  Data notified in the GAP Event.
 * @return none
 *********************************************************************************************************************/
typedef void (* ble_gap_app_cb_t)(uint16_t event_type, ble_status_t event_result, st_ble_evt_data_t * p_event_data);

/******************************************************************************************************************//**
 * @typedef ble_gap_del_bond_cb_t
 * @brief   ble_gap_del_bond_cb_t is the type of the callback function for delete bonding information
 *          stored in non-volatile area. \n This type is used in R_BLE_GAP_DeleteBondInfo().
 * @param[in] p_addr The parameter returns the address of the remote device whose keys are deleted
 *            by R_BLE_GAP_DeleteBondInfo(). \n
 *            If R_BLE_GAP_DeleteBondInfo() deletes the keys of all remote devices, the parameter returns NULL.
 * @return none
 *********************************************************************************************************************/
typedef void (* ble_gap_del_bond_cb_t)(st_ble_dev_addr_t * p_addr);

/* =========================================== GAP API Params Definitions ========================================== */

/******************************************************************************************************************//**
 * @struct st_ble_gap_ext_adv_param_t
 * @brief  Advertising parameters.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief Advertising handle identifying the advertising set to be set the advertising parameters.
     *  @details
     *  Valid range is 0x00 - 0x03.\n
     *  In the first advertising parameters setting, the advertising set specified by adv_hdl is generated.\n
     *  The Advertising Set ID(Advertising SID) of the advertising set is same as adv_hdl.
     */
    uint8_t adv_hdl;

    /**
     *  @brief Advertising packet type.
     *  @details
     *  Legacy advertising PDU type, or bitwise or of Extended advertising PDU type and Extended advertising option.
     *  <table>
     *      <tr>
     *          <th>category</th>
     *          <th>macro</th>
     *          <th>description</th>
     *      </tr>
     *      <tr>
     *          <td rowspan="5">Legacy Advertising PDU type</td>
     *          <td>BLE_GAP_LEGACY_PROP_ADV_IND(0x0013)</td>
     *          <td>Connectable and scannable undirected Legacy Advertising Packet</td>
     *      </tr>
     *      <tr>
     *          <td>BLE_GAP_LEGACY_PROP_ADV_DIRECT_IND(0x0015)</td>
     *          <td>Connectable directed (low duty cycle) Legacy Advertising Packet</td>
     *      </tr>
     *      <tr>
     *          <td>BLE_GAP_LEGACY_PROP_ADV_HDC_DIRECT_IND(0x001D)</td>
     *          <td>Connectable directed (high duty cycle) Legacy Advertising Packet</td>
     *      </tr>
     *      <tr>
     *          <td>BLE_GAP_LEGACY_PROP_ADV_SCAN_IND(0x0012)</td>
     *          <td>Scannable undirected Legacy Advertising Packet</td>
     *      </tr>
     *      <tr>
     *          <td>BLE_GAP_LEGACY_PROP_ADV_NONCONN_IND(0x0010)</td>
     *          <td>Non-connectable and non-scannable undirected Legacy Advertising Packet</td>
     *      </tr>
     *      <tr>
     *          <td rowspan="9">Extended Advertising PDU type</td>
     *          <td>BLE_GAP_EXT_PROP_ADV_CONN_NOSCAN_UNDIRECT(0x0001)</td>
     *          <td>Connectable and non-scannable undirected Extended Advertising Packet</td>
     *      </tr>
     *      <tr>
     *          <td>BLE_GAP_EXT_PROP_ADV_CONN_NOSCAN_DIRECT(0x0005)</td>
     *          <td>Connectable and non-scannable directed (low duty cycle) Extended Advertising Packet</td>
     *      </tr>
     *      <tr>
     *          <td>BLE_GAP_EXT_PROP_ADV_CONN_NOSCAN_HDC_DIRECT(0x000D)</td>
     *          <td>Connectable and non-scannable directed (high duty cycle) Extended Advertising Packet</td>
     *      </tr>
     *      <tr>
     *          <td>BLE_GAP_EXT_PROP_ADV_NOCONN_SCAN_UNDIRECT(0x0002)</td>
     *          <td>Non-connectable and scannable undirected Extended Advertising Packet</td>
     *      </tr>
     *      <tr>
     *          <td>BLE_GAP_EXT_PROP_ADV_NOCONN_SCAN_DIRECT(0x0006)</td>
     *          <td>Non-connectable and scannable directed (low duty cycle) Extended Advertising Packet</td>
     *      </tr>
     *      <tr>
     *          <td>BLE_GAP_EXT_PROP_ADV_NOCONN_SCAN_HDC_DIRECT(0x000E)</td>
     *          <td>Non-connectable and scannable directed (high duty cycle) Extended Advertising Packet</td>
     *      </tr>
     *      <tr>
     *          <td>BLE_GAP_EXT_PROP_ADV_NOCONN_NOSCAN_UNDIRECT(0x0000)</td>
     *          <td>Non-connectable and non-scannable undirected Extended Advertising Packet</td>
     *      </tr>
     *      <tr>
     *          <td>BLE_GAP_EXT_PROP_ADV_NOCONN_NOSCAN_DIRECT(0x0004)</td>
     *          <td>Non-connectable and non-scannable directed (low duty cycle) Extended Advertising Packet</td>
     *      </tr>
     *      <tr>
     *          <td>BLE_GAP_EXT_PROP_ADV_NOCONN_NOSCAN_HDC_DIRECT(0x000C)</td>
     *          <td>Non-connectable and non-scannable directed (high duty cycle) Extended Advertising Packet</td>
     *      </tr>
     *      <tr>
     *          <td rowspan="2">Extended Advertising Option</td>
     *          <td>BLE_GAP_EXT_PROP_ADV_ANONYMOUS(0x0020)</td>
     *          <td>Omit the advertiser address from Extended Advertising Packet.</td>
     *      </tr>
     *      <tr>
     *          <td>BLE_GAP_EXT_PROP_ADV_INCLUDE_TX_POWER(0x0040)</td>
     *          <td>Indicate that the advertising data includes TX Power.</td>
     *      </tr>
     *  </table>
     */
    uint16_t adv_prop_type;

    /**
     *  @brief Minimum advertising interval.
     *  @details
     *  Time(ms) = adv_intv_min * 0.625.\n
     *  Valid range is 0x00000020 - 0x00FFFFFF.
     */
    uint32_t adv_intv_min;

    /**
     *  @brief Maximum Advertising interval.
     *  @details
     *  Time(ms) = adv_intv_max * 0.625.\n
     *  Valid range is 0x00000020 - 0x00FFFFFF.
     */
    uint32_t adv_intv_max;

    /**
     *  @brief The adv_ch_map is channels used in advertising with primary advertising channels.
     *  @details
     *  It is a bitwise OR of the following values.
     *               |              macro        |   description     |
     *               |:------------------------- |:----------------- |
     *               | BLE_GAP_ADV_CH_37(0x01)   | Use 37 CH.        |
     *               | BLE_GAP_ADV_CH_38(0x02)   | Use 38 CH.        |
     *               | BLE_GAP_ADV_CH_39(0x04)   | Use 39 CH.        |
     *               | BLE_GAP_ADV_CH_ALL(0x07)  | Use 37 - 39 CH.   |
     */
    uint8_t adv_ch_map;

    /**
     *  @brief Own BD Address Type.
     *  @details
     *  <table>
     *      <tr>
     *          <th>macro</th>
     *          <th>description</th>
     *      </tr>
     *      <tr>
     *          <td>BLE_GAP_ADDR_PUBLIC(0x00)</td>
     *          <td>Public Address</td>
     *      </tr>
     *      <tr>
     *          <td>BLE_GAP_ADDR_RAND(0x01)</td>
     *          <td>Random Address</td>
     *      </tr>
     *      <tr>
     *          <td>BLE_GAP_ADDR_RPA_ID_PUBLIC(0x02)</td>
     *          <td>
     *              Resolvable Private Address.<BR/>
     *              If the IRK of local device has not been registered in Resolving List,
     *              public address is used.
     *          </td>
     *      </tr>
     *      <tr>
     *          <td>BLE_GAP_ADDR_RPA_ID_RANDOM(0x03)</td>
     *          <td>
     *              Resolvable Private Address.<BR/>
     *              If the IRK of local device has not been registered in Resolving List,
     *              the random address specified by the o_addr field is used.
     *          </td>
     *      </tr>
     *  </table>
     */
    uint8_t o_addr_type;

    /**
     *  @brief Random address set to the advertising set, when the o_addr_type field is BLE_GAP_ADDR_RAND.
     *  @details When the o_addr_type field is other than BLE_GAP_ADDR_RAND, this field is ignored.
     *  @note   The BD address setting format is little endian. \n
     *          If the address is "AA:BB:CC:DD:EE:FF", set the byte array in the order
     *          {0xFF, 0xEE, 0xDD, 0xCC, 0xBB, 0xAA}.
     */
    uint8_t o_addr[BLE_BD_ADDR_LEN];

    /**
     *  @brief Peer address type.
     *  @details
     *  When the Advertising PDU type is other than directed or the o_addr_type is BLE_GAP_ADDR_PUBLIC or
     *  BLE_GAP_ADDR_RAND,this field is ignored.
     *               |              macro        |   description     |
     *               |:------------------------- |:----------------- |
     *               | BLE_GAP_ADDR_PUBLIC(0x00) | Public Address    |
     *               | BLE_GAP_ADDR_RAND(0x01)   | Random Address    |
     */
    uint8_t p_addr_type;

    /**
     *  @brief Peer address.
     *  @details When the Advertising PDU type is other than directed or
     *           the o_addr_type is BLE_GAP_ADDR_PUBLIC or BLE_GAP_ADDR_RAND,this field is ignored.
     *  @note   The BD address setting format is little endian. \n
     *          If the address is "AA:BB:CC:DD:EE:FF", set the byte array in the order
     *          {0xFF, 0xEE, 0xDD, 0xCC, 0xBB, 0xAA}.
     */
    uint8_t p_addr[BLE_BD_ADDR_LEN];

    /**
     *  @brief Advertising Filter Policy.
     *  @details
     *  <table>
     *      <tr>
     *          <th>macro</th>
     *          <th>description</th>
     *      </tr>
     *      <tr>
     *          <td>BLE_GAP_ADV_ALLOW_SCAN_ANY_CONN_ANY(0x00)</td>
     *          <td>Process scan and connection requests from all devices.</td>
     *      </tr>
     *      <tr>
     *          <td>BLE_GAP_ADV_ALLOW_SCAN_WLST_CONN_ANY(0x01)</td>
     *          <td>
     *              Process connection requests from all devices and scan requests
     *              from only devices that are in the White List.
     *          </td>
     *      </tr>
     *      <tr>
     *          <td>BLE_GAP_ADV_ALLOW_SCAN_ANY_CONN_WLST(0x02)</td>
     *          <td>
     *              Process scan requests from all devices and connection requests from
     *              only devices that are in the White List.
     *          </td>
     *      </tr>
     *      <tr>
     *          <td>BLE_GAP_ADV_ALLOW_SCAN_WLST_CONN_WLST(0x03)</td>
     *          <td>Process scan and connection requests from only devices in the White List.</td>
     *      </tr>
     *  </table>
     */
    uint8_t filter_policy;

    /**
     *  @brief Primary ADV PHY.
     *  @details
     *  In this parameter, only 1M PHY and Coded PHY can be specified, and 2M PHY cannot be specified.
     *  <table>
     *      <tr>
     *          <th>macro</th>
     *          <th>description</th>
     *      </tr>
     *      <tr>
     *          <td>BLE_GAP_ADV_PHY_1M(0x01)</td>
     *          <td>
     *              Use 1M PHY as Primary Advertising PHY.<BR/>
     *              When the adv_prop_type field is Legacy Advertising PDU type, <BR/>
     *              this field shall be set to BLE_GAP_ADV_PHY_1M.
     *          </td>
     *      </tr>
     *      <tr>
     *          <td>BLE_GAP_ADV_PHY_CD(0x03)</td>
     *          <td>Use Coded PHY(S=8) as Primary Advertising PHY.
     *               Coding scheme is configured by @ref R_BLE_VS_SetCodingScheme().</td>
     *      </tr>
     *  </table>
     */
    uint8_t adv_phy;

    /**
     *  @brief Secondary ADV Max Skip.
     *  @details
     *  Valid range is 0x00 - 0xFF.\n
     *  When this field is 0x00, AUX_ADV_IND is sent before the next advertising event.\n
     *  When the adv_prop_type field is Legacy Advertising PDU, this field is ignored.
     */
    uint8_t sec_adv_max_skip;

    /**
     *  @brief Secondary ADV Phy.
     *  @details
     *  When the adv_prop_type is Legacy Advertising PDU, this field is ignored.
     *               |              macro        |   description                                    |
     *               |:------------------------- |:------------------------------------------------ |
     *               | BLE_GAP_ADV_PHY_1M(0x01)  | Use 1M PHY as Secondary Advertising PHY.         |
     *               | BLE_GAP_ADV_PHY_2M(0x02)  | Use 2M PHY as Secondary Advertising PHY.         |
     *               | BLE_GAP_ADV_PHY_CD(0x03)  | Use Coded PHY(S=8) as Secondary Advertising PHY. |
     *
     *  Coding scheme is configured by @ref R_BLE_VS_SetCodingScheme().
     */
    uint8_t sec_adv_phy;

    /**
     *  @brief Scan Request Notifications Flag.
     *  @details
     *  When the adv_prop_type field is non-scannable Advertising PDU, this field is ignored.
     *      <table>
     *          <tr>
     *              <th>macro</th>
     *              <th>description</th>
     *          </tr>
     *          <tr>
     *              <td>BLE_GAP_SCAN_REQ_NTF_DISABLE(0x00)</td>
     *              <td>Disable Scan Request Notification.</td>
     *          </tr>
     *          <tr>
     *              <td>BLE_GAP_SCAN_REQ_NTF_ENABLE(0x01)</td>
     *              <td>
     *                  Enable Scan Request Notification.<BR/>
     *                  When a Scan Request Packet from Scanner has been received,
     *                  the BLE_GAP_EVENT_SCAN_REQ_RECV event is notified.
     *              </td>
     *          </tr>
     *      </table>
     */
    uint8_t scan_req_ntf_flag;
} st_ble_gap_ext_adv_param_t;

/******************************************************************************************************************//**
 * @brief  Advertising parameters.
 * @sa st_ble_gap_ext_adv_param_t
 *********************************************************************************************************************/
typedef st_ble_gap_ext_adv_param_t st_ble_gap_adv_param_t;

/******************************************************************************************************************//**
 * @struct st_ble_gap_adv_data_t
 * @brief  Advertising data/scan response data/periodic advertising data.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief Advertising handle identifying the advertising set to be
     *         set advertising data/scan response/periodic advertising data.
     *  @details
     *  Valid range is 0x00 - 0x03.
     */
    uint8_t adv_hdl;

    /**
     *  @brief Data type.
     *  @details
     *               |              macro                 |   description              |
     *               |:---------------------------------- |:-------------------------- |
     *               | BLE_GAP_ADV_DATA_MODE (0x00)       | Advertising data.          |
     *               | BLE_GAP_SCAN_RSP_DATA_MODE(0x01)   | Scan response data.        |
     *               | BLE_GAP_PERD_ADV_DATA_MODE(0x02)   | Periodic advertising data. |
     */
    uint8_t data_type;

    /**
     *  @brief The length of advertising data/scan response data/periodic advertising data (in bytes).
     *  @details
     *   In case of Legacy Advertising PDU, the length is 0 - 31 bytes.\n
     *   In case of Extended Advertising PDU, the length is 0 - 1650 bytes.\n
     *   Note that the length of the advertising data/scan response data in
     *   the BLE_MAX_NO_OF_ADV_SETS_SUPPORTED number of the advertising sets may not exceed
     *   the buffer size(4250 bytes) in Controller. \n
     *   \n
     *   In case of periodic advertising data, the length is 0 - 1650 bytes.\n
     *   Note that the length of the periodic advertising data in the BLE_MAX_NO_OF_ADV_SETS_SUPPORTED number of
     *   the advertising sets may not exceed the buffer size(4306 bytes) in Controller.\n
     *   \n
     *   When this field is 0, the operations specified by the zero_length_flag is executed.
     */
    uint16_t data_length;

    /**
     *  @brief Advertising data/scan response data/periodic advertising data.
     *  @details
     *  When the data_length field is 0, this field is ignored.
     */
    uint8_t * p_data;

    /**
     *  @brief Operation when the data_length field is 0.
     *  @details
     *   If the data_length is other than 0, this field is ignored.
     *      <table>
     *          <tr>
     *              <th>macro</th>
     *              <th>description</th>
     *          </tr>
     *          <tr>
     *              <td>BLE_GAP_DATA_0_CLEAR(0x01)</td>
     *              <td>
     *                  Clear the advertising data/scan response data/periodic advertising data
     *                  in the advertising set.
     *              </td>
     *          </tr>
     *          <tr>
     *              <td>BLE_GAP_DATA_0_DID_UPD(0x02)</td>
     *              <td>Update Advertising DID without changing advertising data.
     *                  If the data_type field is BLE_GAP_ADV_DATA_MODE, this value is allowed.
     *              </td>
     *          </tr>
     *      </table>
     */
    uint8_t zero_length_flag;
} st_ble_gap_adv_data_t;

/******************************************************************************************************************//**
 * @struct st_ble_gap_perd_adv_param_t
 * @brief  Periodic advertising parameter.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief Advertising handle identifying the advertising set to be set periodic advertising parameter.
     *  @details
     *  Valid range is 0x00 - 0x03.
     */
    uint8_t adv_hdl;

    /**
     *  @brief Periodic ADV Properties.
     *  @details
     *  The prop_type field is set to the following values.\n
     *  If the type of the periodic advertising data cannot be applied from the following, set 0x0000.
     *    |              macro                 |   description                                                |
     *    |:---------------------------------- |:------------------------------------------------------------ |
     *    | BLE_GAP_PERD_PROP_TX_POWER(0x0040) |  Indicate that periodic advertising data includes Tx Power.  |
     */
    uint16_t prop_type;

