fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
    /**
     *  @brief Minimum Periodic Advertising Interval.
     *  @details
     *  Time(ms) = perd_intv_min * 1.25.\n
     *  Valid range is 0x0006 - 0xFFFF.
     */
    uint16_t perd_intv_min;

    /**
     *  @brief Maximum Periodic Advertising Interval.
     *  @details
     *  Time(ms) = perd_intv_max * 1.25.\n
     *  Valid range is 0x0006 - 0xFFFF.
     */
    uint16_t perd_intv_max;
} st_ble_gap_perd_adv_param_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gap_scan_phy_param_t
 *  @brief  Scan parameters per scan PHY.
 *  @details In case of start scanning with both 1M PHY and Coded PHY,
 *           adjust scan windows and scan intervals according to the following.\n
 *           ``` p_phy_param_1M->scan_window / p_phy_param_1M->scan_intv +
 *                p_phy_param_coded->scan_window / p_phy_param_coded->scan_intv <= 1  ```
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief Scan type.
     *  @details
     *    |              macro             |   description               |
     *    |:-------------------------------|:--------------------------- |
     *    | BLE_GAP_SCAN_PASSIVE(0x00)     | Passive Scan.               |
     *    | BLE_GAP_SCAN_ACTIVE(0x01)      | Active Scan.                |
     */
    uint8_t scan_type;

    /**
     *  @brief Scan interval.
     *  @details
     *  interval(ms) = scan_intv * 0.625.\n
     *  Valid range is 0x0000 and 0x0004 - 0xFFFF.
     */
    uint16_t scan_intv;

    /**
     *  @brief Scan window.
     *  @details
     *  window(ms) = scan_window * 0.625.\n
     *  Valid range is 0x0000 and 0x0004 - 0xFFFF.
     */
    uint16_t scan_window;
} st_ble_gap_scan_phy_param_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gap_ext_scan_param_t
 *  @brief  Scan parameters.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief Own BD Address Type.
     *  @details
     *  In case of passive scan, this field is ignored.
     *  <table>
     *      <tr>
     *          <th>macro</th>
     *          <th>description</th>
     *      </tr>
     *      <tr>
     *          <td>BLE_GAP_ADDR_PUBLIC(0x00)</td>
     *          <td>Public Address</td>
     *      </tr>
     *      <tr>
     *          <td>BLE_GAP_ADDR_RAND(0x01)</td>
     *          <td>Random Address</td>
     *      </tr>
     *      <tr>
     *          <td>BLE_GAP_ADDR_RPA_ID_PUBLIC(0x02)</td>
     *          <td>
     *              Resolvable Private Address.<BR/>
     *              If the IRK of local device has not been registered in Resolving List,
     *              public address is used.
     *          </td>
     *      </tr>
     *      <tr>
     *          <td>BLE_GAP_ADDR_RPA_ID_RANDOM(0x03)</td>
     *          <td>
     *              Resolvable Private Address.<BR/>
     *              If the IRK of local device has not been registered in Resolving List,
     *              the random address set by R_BLE_GAP_SetRandAddr() is used.
     *          </td>
     *      </tr>
     *  </table>
     */
    uint8_t o_addr_type;

    /**
     *  @brief Scan Filter Policy.
     *  @details
     *  <table>
     *      <tr>
     *          <th>macro</th>
     *          <th>description</th>
     *      </tr>
     *      <tr>
     *          <td>BLE_GAP_SCAN_ALLOW_ADV_ALL(0x00)</td>
     *          <td>
     *              Accept all advertising and scan response PDUs except directed advertising
     *              PDUs not addressed to local device.
     *          </td>
     *      </tr>
     *      <tr>
     *          <td>BLE_GAP_SCAN_ALLOW_ADV_WLST(0x01)</td>
     *          <td>
     *              Accept only advertising and scan response PDUs from remote devices
     *              whose address is registered in the White List.<BR/>
     *              Directed advertising PDUs which are not addressed to local device is ignored.
     *          </td>
     *      </tr>
     *      <tr>
     *          <td>BLE_GAP_SCAN_ALLOW_ADV_EXCEPT_DIRECTED(0x02)</td>
     *          <td>
     *              Accept all advertising and scan response PDUs except directed advertising
     *              PDUs whose the target address is identity address but doesn't address local device.
     *              However directed advertising PDUs whose the target address is the local resolvable private address
     *              are accepted.
     *          </td>
     *      </tr>
     *      <tr>
     *          <td>BLE_GAP_SCAN_ALLOW_ADV_EXCEPT_DIRECTED_WLST(0x03)</td>
     *          <td>Accept all advertising and scan response PDUs.<BR/>
     *              The following are excluded.<BR/>
     *              <ul>
     *                  <li>
     *                      Advertising and scan response PDUs where the advertiser's
     *                      identity address is not in the White List.
     *                  </li>
     *                  <li>
     *                      Directed advertising PDUs whose the target address is identity address
     *                      but doesn't address local device.
     *                      However directed advertising PDUs whose the target address is the local
     *                      resolvable private address are accepted.
     *                  </li>
     *              </ul>
     *          </td>
     *      </tr>
     *  </table>
     */
    uint8_t filter_policy;

    /**
     *  @brief Scan parameters 1M PHY.
     *  @details When this field is NULL, Controller doesn't set the scan parameters for 1M PHY.
     */
    st_ble_gap_scan_phy_param_t * p_phy_param_1M;

    /**
     *  @brief Scan parameters Coded PHY.
     *  @details When this field is NULL, Controller doesn't set the scan parameters for Coded PHY.
     */
    st_ble_gap_scan_phy_param_t * p_phy_param_coded;
} st_ble_gap_ext_scan_param_t;

/******************************************************************************************************************//**
 * @brief  Scan parameters.
 * @sa st_ble_gap_ext_scan_param_t
 *********************************************************************************************************************/
typedef st_ble_gap_ext_scan_param_t st_ble_gap_scan_param_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gap_scan_on_t
 *  @brief  Parameters configured when scanning starts.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief Procedure type.
     *  @details
     *  <table>
     *      <tr>
     *          <th>macro</th>
     *          <th>description</th>
     *      </tr>
     *      <tr>
     *          <td>BLE_GAP_SC_PROC_OBS(0x00)</td>
     *          <td>
     *              Observation Procedure.<BR/>
     *              Notify all advertising PDUs.
     *          </td>
     *      </tr>
     *      <tr>
     *          <td>BLE_GAP_SC_PROC_LIM(0x01)</td>
     *          <td>
     *              Limited Discovery Procedure.<BR/>
     *              Notify advertising PDUs from only devices in the limited discoverable mode.
     *          </td>
     *      </tr>
     *      <tr>
     *          <td>BLE_GAP_SC_PROC_GEN(0x02)</td>
     *          <td>
     *              General Discovery Procedure.<BR/>
     *              Notify advertising PDUs from devices in the limited discoverable mode and
     *              the general discoverable mode.
     *          </td>
     *      </tr>
     *  </table>
     */
    uint8_t proc_type;

    /**
     *  @brief Filter duplicates.
     *  @details
     *  <table>
     *      <tr>
     *          <th>macro</th>
     *          <th>description</th>
     *      </tr>
     *      <tr>
     *          <td>BLE_GAP_SCAN_FILT_DUPLIC_DISABLE(0x00)</td>
     *          <td>Duplicate filter disabled.</td>
     *      </tr>
     *      <tr>
     *          <td>BLE_GAP_SCAN_FILT_DUPLIC_ENABLE(0x01)</td>
     *          <td>Duplicate filter enabled.</td>
     *      </tr>
     *      <tr>
     *          <td>BLE_GAP_SCAN_FILT_DUPLIC_ENABLE_FOR_PERIOD(0x02)</td>
     *          <td>Duplicate filtering enabled, reset for each scan period</td>
     *      </tr>
     *  </table>
     */
    uint8_t filter_dups;

    /**
     *  @brief Scan duration.
     *  @details Time(ms) = duration * 10.\n
     *           Valid range is 0x0000 - 0xFFFF.\n
     *           If this field is set to 0x0000, scanning is continued until R_BLE_GAP_StopScan() is called.\n
     *           When the period field is zero and the time specified the duration field expires,
     *           BLE_GAP_EVENT_SCAN_TO event notifies the application layer that scanning stops.
     */
    uint16_t duration;

    /**
     *  @brief Scan period.
     *  @details Time(s) = N * 1.28.\n
     *           Valid range is 0x0000 - 0xFFFF.\n
     *           If the duration field is set to 0x0000, this field is ignored.
     */
    uint16_t period;
} st_ble_gap_scan_on_t;

/******************************************************************************************************************//**
 * @struct st_ble_gap_conn_param_t
 * @brief  Connection parameters included in connection interval, slave latency, supervision timeout, ce length.
 * @details This structure is used in R_BLE_GAP_CreateConn() and R_BLE_GAP_UpdConn().
 *
 * Set the fields in this structure to match the following condition.
 *
 * Supervision_timeout(ms) >= (1 + conn_latency) * conn_intv_max_Time(ms)
 *
 *  conn_intv_max_Time(ms) = conn_intv_max * 1.25
 *  Supervision_timeout(ms) = sup_to * 10
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief Minimum connection interval.
     *  @details
     *           Time(ms) = conn_intv_min * 1.25.\n
     *           Valid range is 0x0006 - 0x0C80.
     */
    uint16_t conn_intv_min;

    /**
     *  @brief Maximum connection interval.
     *  @details
     *           Time(ms) = conn_intv_max * 1.25.\n
     *           Valid range is 0x0006 - 0x0C80.
     */
    uint16_t conn_intv_max;

    /**
     *  @brief Slave latency.
     *  @details
     *           Valid range is 0x0000 - 0x01F3.
     */
    uint16_t conn_latency;

    /**
     *  @brief Supervision timeout.
     *  @details
     *           Time(ms) = sup_to * 10.\n
     *           Valid range is 0x000A - 0x0C80.
     */
    uint16_t sup_to;

    /**
     *  @brief Minimum CE Length.
     *  @details
     *           Valid range is 0x0000 - 0xFFFF.
     */
    uint16_t min_ce_length;

    /**
     *  @brief Maximum CE Length.
     *  @details
     *           Valid range is 0x0000 - 0xFFFF.
     */
    uint16_t max_ce_length;
} st_ble_gap_conn_param_t;

/******************************************************************************************************************//**
 * @struct st_ble_gap_conn_phy_param_t
 * @brief  Connection parameters per PHY.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief  Scan interval.
     *  @details
     *  Time(ms) = scan_intv * 0.625.\n
     *  Valid range is 0x0004 - 0xFFFF.
     */
    uint16_t scan_intv;

    /**
     *  @brief  Scan window.
     *  @details
     *  Time(ms) = scan_window  * 0.625.\n
     *  Valid range is 0x0004 - 0xFFFF.
     */
    uint16_t scan_window;

    /**
     *  @brief  Connection interval, slave latency, supervision timeout, and CE length.
     */
    st_ble_gap_conn_param_t * p_conn_param;
} st_ble_gap_conn_phy_param_t;

/******************************************************************************************************************//**
 * @struct st_ble_gap_create_conn_param_t
 * @brief  Connection parameters used in R_BLE_GAP_CreateConn().
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief This field specifies whether the White List is used or not, when connecting with a remote device.
     *  @details
     *      <table>
     *          <tr>
     *              <th>macro</th>
     *              <th>description</th>
     *          </tr>
     *          <tr>
     *              <td>BLE_GAP_INIT_FILT_USE_ADDR(0x00)</td>
     *              <td>White List is not used.<BR/>
     *                  The remote device to be connected is specified by the <i>remote_bd_addr</i> field and <BR/>
     *                  the <i>remote_bd_addr_type</i> field is used.
     *              </td>
     *          </tr>
     *          <tr>
     *              <td>BLE_GAP_INIT_FILT_USE_WLST(0x01)</td>
     *              <td>White List is used.<BR/>
     *                  The remote device registered in White List is connected with local device.<BR/>
     *                  The <i>remote_bd_addr</i> field and the <i>remote_bd_addr_type</i> field are ignored.
     *              </td>
     *          </tr>
     *      </table>
     */
    uint8_t init_filter_policy;

    /**
     *  @brief Address of the device to be connected.
     *  @note   The BD address setting format is little endian. \n
     *          If the address is "AA:BB:CC:DD:EE:FF", set the byte array in the order
     *          {0xFF, 0xEE, 0xDD, 0xCC, 0xBB, 0xAA}.
     */
    uint8_t remote_bd_addr[BLE_BD_ADDR_LEN];

    /**
     *  @brief  Address type of the device to be connected.
     *  @details
     *      <table>
     *          <tr>
     *              <th>macro</th>
     *              <th>description</th>
     *          </tr>
     *          <tr>
     *              <td>BLE_GAP_ADDR_PUBLIC(0x00)</td>
     *              <td>Public Address or Public Identity Address</td>
     *          </tr>
     *          <tr>
     *              <td>BLE_GAP_ADDR_RAND(0x01)</td>
     *              <td>Random Address or Random (Static) Identity Address</td>
     *          </tr>
     *      </table>
     */
    uint8_t remote_bd_addr_type;

    /**
     *  @brief  Address type which local device uses in creating a link with the remote device.
     *  @details
     *      <table>
     *          <tr>
     *              <th>macro</th>
     *              <th>description</th>
     *          </tr>
     *          <tr>
     *              <td>BLE_GAP_ADDR_PUBLIC(0x00)</td>
     *              <td>Public Address</td>
     *          </tr>
     *          <tr>
     *              <td>BLE_GAP_ADDR_RAND(0x01)</td>
     *              <td>Random Address</td>
     *          </tr>
     *          <tr>
     *              <td>BLE_GAP_ADDR_RPA_ID_PUBLIC(0x02)</td>
     *              <td>
     *                  Resolvable Private Address.\n
     *                  If the IRK of local device has not been registered in Resolving List,
     *                  public address is used.
     *              </td>
     *          </tr>
     *          <tr>
     *              <td>BLE_GAP_ADDR_RPA_ID_RANDOM(0x03)</td>
     *              <td>
     *                  Resolvable Private Address.\n
     *                  If the IRK of local device has not been registered in Resolving List,
     *                  the random address set by R_BLE_GAP_SetRandAddr().
     *              </td>
     *          </tr>
     *      </table>
     */
    uint8_t own_addr_type;

    /**
     *  @brief Connection parameters for 1M PHY.
     *  @details If this field is set to NULL, 1M PHY is not used in connecting.
     */
    st_ble_gap_conn_phy_param_t * p_conn_param_1M;

    /**
     *  @brief Connection parameters for 2M PHY.
     *  @details If this field is set to NULL, 2M PHY is not used in connecting.
     */
    st_ble_gap_conn_phy_param_t * p_conn_param_2M;

    /**
     *  @brief Connection parameters for Coded PHY.
     *  @details If this field is set to NULL, Coded PHY is not used in connecting.
     */
    st_ble_gap_conn_phy_param_t * p_conn_param_coded;
} st_ble_gap_create_conn_param_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gap_rslv_list_key_set_t
 *  @brief  IRK of a remote device and IRK type of local device used in R_BLE_GAP_ConfRslvList().
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief IRK of a remote device to be registered in the Resolving List.
     */
    uint8_t remote_irk[BLE_GAP_IRK_SIZE];

    /**
     *  @brief IRK type of the local device to be registered in the Resolving List.
     *  @details
     *               |              macro                    |   description                                      |
     *               |:------------------------------------- |:-------------------------------------------------- |
     *               | BLE_GAP_RL_LOC_KEY_ALL_ZERO(0x00)     | All-zero IRK.                                      |
     *               | BLE_GAP_RL_LOC_KEY_REGISTERED(0x01)    | The IRK registered by R_BLE_GAP_SetLocIdInfo().   |
     */
    uint8_t local_irk_type;
} st_ble_gap_rslv_list_key_set_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gap_set_phy_param_t
 *  @brief  PHY configuration parameters used in R_BLE_GAP_SetPhy().
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief Transmitter PHY preference.
     *  @details The tx_phys field is set to a bitwise OR of the following values. All other values are ignored.
     *               |              macro                    |   description                      |
     *               |:------------------------------------- |:---------------------------------- |
     *               | BLE_GAP_SET_PHYS_HOST_PREF_1M(0x01)   | Use 1M PHY for Transmitter PHY.    |
     *               | BLE_GAP_SET_PHYS_HOST_PREF_2M(0x02)   | Use 2M PHY for Transmitter PHY.    |
     *               | BLE_GAP_SET_PHYS_HOST_PREF_CD(0x04)   | Use Coded PHY for Transmitter PHY. |
     */
    uint8_t tx_phys;

    /**
     *  @brief Receiver PHY preference.
     *  @details The rx_phys field is set to a bitwise OR of the following values. All other values are ignored.
     *               |              macro                    |   description                      |
     *               |:------------------------------------- |:---------------------------------- |
     *               | BLE_GAP_SET_PHYS_HOST_PREF_1M(0x01)   | Use 1M PHY for Receiver PHY.       |
     *               | BLE_GAP_SET_PHYS_HOST_PREF_2M(0x02)   | Use 2M PHY for Receiver PHY.       |
     *               | BLE_GAP_SET_PHYS_HOST_PREF_CD(0x04)   | Use Coded PHY for Receiver PHY.    |
     */
    uint8_t rx_phys;

    /**
     *  @brief Coding scheme used in Coded PHY.
     *  @details Select one of the following.
     *               |              macro                       |   description           |
     *               |:---------------------------------------- |:----------------------- |
     *               | BLE_GAP_SET_PHYS_OP_HOST_NO_PREF(0x00)   | No preferred coding.    |
     *               | BLE_GAP_SET_PHYS_OP_HOST_PREF_S_2(0x01)  | Use S=2 coding.         |
     *               | BLE_GAP_SET_PHYS_OP_HOST_PREF_S_8(0x02)  | Use S=8 coding.         |
     */
    uint16_t phy_options;
} st_ble_gap_set_phy_param_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gap_set_def_phy_param_t
 *  @brief  PHY preferences which allows a remote device to set used in R_BLE_GAP_SetDefPhy().
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief Transmitter PHY preferences which a remote device may change.
     *  @details The tx_phys field is set to a bitwise OR of the following values.
     *           All other values are ignored.
     *          |              macro                    |   description                                               |
     *          |:------------------------------------- |:----------------------------------------------------------- |
     *          | BLE_GAP_SET_PHYS_HOST_PREF_1M(0x01)   | Allow a remote device to set 1M PHY for transmitter PHY.    |
     *          | BLE_GAP_SET_PHYS_HOST_PREF_2M(0x02)   | Allow a remote device to set 2M PHY for transmitter PHY.    |
     *          | BLE_GAP_SET_PHYS_HOST_PREF_CD(0x04)   | Allow a remote device to set Coded PHY for transmitter PHY. |
     */
    uint8_t tx_phys;

    /**
     *  @brief Receiver PHY preferences which a remote device may change.
     *  @details The rx_phys field is set to a bitwise OR of the following values.
     *           All other values are ignored.
     *          |              macro                    |   description                                            |
     *          |:------------------------------------- |:-------------------------------------------------------- |
     *          | BLE_GAP_SET_PHYS_HOST_PREF_1M(0x01)   | Allow a remote device to set 1M PHY for receiver PHY.    |
     *          | BLE_GAP_SET_PHYS_HOST_PREF_2M(0x02)   | Allow a remote device to set 2M PHY for receiver PHY.    |
     *          | BLE_GAP_SET_PHYS_HOST_PREF_CD(0x04)   | Allow a remote device to set Coded PHY for receiver PHY. |
     */
    uint8_t rx_phys;
} st_ble_gap_set_def_phy_param_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gap_auth_info_t
 *  @brief  Pairing parameters required from a remote device or
 *          information about keys distributed from a remote device.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief Security level.
     *  @details
     *    |  value  |   description                                         |
     *    |:--------|:----------------------------------------------------- |
     *    | 0x01    | The remote device requests Unauthenticated pairing.   |
     *    | 0x02    | The remote device requests Authenticated pairing.     |
     */
    uint8_t security;

    /**
     *  @brief  Pairing mode.
     *  @details
     *    |  value  |   description                                         |
     *    |:--------|:----------------------------------------------------- |
     *    | 0x01    | The remote device requests Legacy pairing.            |
     *    | 0x02    | The remote device requests Secure Connections.        |
     */
    uint8_t pair_mode;

    /**
     *  @brief  Bonding policy.
     *  @details
     *    |  value  |   description                                                   |
     *    |:--------|:--------------------------------------------------------------- |
     *    | 0x00    | The remote device does not store the Bonding information.       |
     *    | 0x01    | The remote device stores the Bonding information.               |
     */
    uint8_t bonding;

