fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
    /**
     *  @brief  Encryption key size.
     */
    uint8_t ekey_size;
} st_ble_gap_auth_info_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gap_key_dist_t
 *  @brief  Keys distributed from a remote device.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief   LTK.
     */
    uint8_t enc_info[BLE_GAP_LTK_SIZE];

    /**
     *  @brief   Ediv and rand.
     *           The first two bytes is ediv, the remaining bytes are rand.
     */
    uint8_t mid_info[BLE_GAP_EDIV_SIZE + BLE_GAP_RAND_64_BIT_SIZE];

    /**
     *  @brief   IRK
     */
    uint8_t id_info[BLE_GAP_IRK_SIZE];

    /**
     *  @brief   Identity address. The first byte is address type. The remaining bytes are device address.
     */
    uint8_t id_addr_info[BLE_GAP_ID_ADDR_SIZE];

    /**
     *  @brief   CSRK
     */
    uint8_t sign_info[BLE_GAP_CSRK_SIZE];
} st_ble_gap_key_dist_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gap_key_ex_param_t
 *  @brief  This structure includes the distributed keys and negotiated LTK size.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief   Key information.
     */
    st_ble_gap_key_dist_t * p_keys_info;

    /**
     * @brief   Type of the distributed keys.
     * @details
     *  This field is a bitwise OR of the following values.
     *  <table>
     *      <tr>
     *          <th>Bit Number</th>
     *          <th>description</th>
     *      </tr>
     *      <tr>
     *          <td>0</td>
     *          <td>
     *              LTK and Master Identification.<BR/>
     *              LTK is distributed in Secure Connections, even if the bit is 1.
     *          </td>
     *      </tr>
     *      <tr>
     *          <td>1</td>
     *          <td>IRK and Identity Address Information.</td>
     *      </tr>
     *      <tr>
     *          <td>2</td>
     *          <td>CSRK</td>
     *      </tr>
     *  </table>
     */
    uint8_t keys;

    /**
     *  @brief   The negotiated LTK size.
     */
    uint8_t ekey_size;
} st_ble_gap_key_ex_param_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gap_pairing_param_t
 *  @brief  Pairing parameters used in R_BLE_GAP_SetPairingParams().
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief  IO capabilities of local device.
     *  @details
     *   Select one of the following.
     *      <table>
     *          <tr>
     *              <th>macro</th>
     *              <th>description</th>
     *          </tr>
     *          <tr>
     *              <td>BLE_GAP_IOCAP_DISPLAY_ONLY(0x00)</td>
     *              <td>
     *                  Output function : Local device has the ability to display a 6 digit decimal number.<BR/>
     *                  Input function  : None<BR/>
     *              </td>
     *          </tr>
     *          <tr>
     *              <td>BLE_GAP_IOCAP_DISPLAY_YESNO(0x01)</td>
     *              <td>
     *                  Output function : Output function : Local device has the ability to
     *                                    display a 6 digit decimal number.<BR/>
     *                  Input function  : Local device has the ability to indicate 'yes' or 'no'<BR/>
     *              </td>
     *          </tr>
     *          <tr>
     *              <td>BLE_GAP_IOCAP_KEYBOARD_ONLY(0x02)</td>
     *              <td>
     *                  Output function : None<BR/>
     *                  Input function  : Local device has the ability to input the number '0' - '9'.<BR/>
     *              </td>
     *          </tr>
     *          <tr>
     *              <td>BLE_GAP_IOCAP_NOINPUT_NOOUTPUT(0x03)</td>
     *              <td>
     *                  Output function : None<BR/>
     *                  Input function  : None<BR/>
     *              </td>
     *          </tr>
     *          <tr>
     *              <td>BLE_GAP_IOCAP_KEYBOARD_DISPLAY(0x04)</td>
     *              <td>
     *                  Output function : Output function : Local device has the ability to
     *                                                      display a 6 digit decimal number.<BR/>
     *                  Input function  : Local device has the ability to input the number '0' - '9'.<BR/>
     *              </td>
     *          </tr>
     *      </table>
     */
    uint8_t iocap;

    /**
     *  @brief  MITM protection policy.
     *  @details
     *   Select one of the following.
     *    |              macro                 |  description                   |
     *    |:---------------------------------- |:------------------------------ |
     *    | BLE_GAP_SEC_MITM_BEST_EFFORT(0x00) | MITM Protection not required.  |
     *    | BLE_GAP_SEC_MITM_STRICT (0x01)     | MITM Protection required.      |
     */
    uint8_t mitm;

    /**
     *  @brief  Bonding policy.
     *  @details
     *    |              macro                 |   description                                     |
     *    |:---------------------------------- |:------------------------------------------------- |
     *    | BLE_GAP_BONDING_NONE(0x00)         | Local device doesn't stores Bonding information.  |
     *    | BLE_GAP_BONDING (0x01)             | Local device stores Bonding information.          |
     */
    uint8_t bonding;

    /**
     *  @brief Maximum LTK size(in bytes).
     *  @details
     *  Valid range is 7 - 16.\n
     *  This field shall be set to a value not less than the min_key_size field.
     */
    uint8_t max_key_size;

    /**
     *  @brief Minimum LTK size(in bytes).
     *  @details
     *  Valid range is 7 - 16.\n
     *  This field shall be set to a value not more than the max_key_size field.
     */
    uint8_t min_key_size;

    /**
     *  @brief Type of keys to be distributed from local device.
     *  @details
     *  The loc_key_dist field is set to a bitwise OR of the following values.
     *    |              macro             |   description               |
     *    |:-------------------------------|:--------------------------- |
     *    | BLE_GAP_KEY_DIST_ENCKEY(0x01)  | LTK                         |
     *    | BLE_GAP_KEY_DIST_IDKEY(0x02)   | IRK and Identity Address.   |
     *    | BLE_GAP_KEY_DIST_SIGNKEY(0x04) | CSRK                        |
     */
    uint8_t loc_key_dist;

    /**
     *  @brief Type of keys which local device requests a remote device to distribute.
     *  @details
     *  The rem_key_dist field is set to a bitwise OR of the following values.
     *      <table>
     *          <tr>
     *              <th>macro</th>
     *              <th>description</th>
     *          </tr>
     *          <tr>
     *              <td>BLE_GAP_KEY_DIST_ENCKEY(0x01)</td>
     *              <td>
     *                  LTK. In case of Secure Connections, LTK is notified even if this bit is not set.
     *              </td>
     *          </tr>
     *          <tr>
     *              <td>BLE_GAP_KEY_DIST_IDKEY(0x02)</td>
     *              <td>
     *                  IRK and Identity Address.
     *              </td>
     *          </tr>
     *          <tr>
     *              <td>BLE_GAP_KEY_DIST_SIGNKEY(0x04)</td>
     *              <td>
     *                  CSRK
     *              </td>
     *          </tr>
     *      </table>
     */
    uint8_t rem_key_dist;

    /**
     *  @brief Support for Key Press Notification in Passkey Entry.
     *  @details
     *    |              macro                       |   description                            |
     *    |:-----------------------------------------|:---------------------------------------- |
     *    | BLE_GAP_SC_KEY_PRESS_NTF_NOT_SPRT(0x00)  | Not support for Key Press Notification.  |
     *    | BLE_GAP_SC_KEY_PRESS_NTF_SPRT(0x01)      | Support for Key Press Notification.      |
     */
    uint8_t key_notf;

    /**
     *  @brief Determine whether to accept only Secure Connections or not.
     *  @details
     *    |              macro            |   description                                 |
     *    |:------------------------------|:--------------------------------------------- |
     *    | BLE_GAP_SC_BEST_EFFORT(0x00)  | Accept Legacy pairing and Secure Connections.  |
     *    | BLE_GAP_SC_STRICT(0x01)       |  Accept only Secure Connections.               |
     */
    uint8_t sec_conn_only;
} st_ble_gap_pairing_param_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gap_oob_data_t
 *  @brief  Oob data received from the remote device. This is used in R_BLE_GAP_SetRemOobData().
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief OOB data used in Legacy Pairing.
     */
    uint8_t legacy_oob[BLE_GAP_LEGACY_OOB_SIZE];

    /**
     *  @brief OOB confirmation value used in Secure Connections.
     */
    uint8_t sc_cnf_val[BLE_GAP_OOB_CONFIRM_VAL_SIZE];

    /**
     *  @brief OOB rand used in Secure Connections.
     */
    uint8_t sc_rand[BLE_GAP_OOB_RANDOM_VAL_SIZE];
} st_ble_gap_oob_data_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gap_past_param_t
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     * @brief Working mode
     *
     * The action to be taken when periodic advertising
     * synchronization information is received.
     */
    uint8_t mode;

    /**
     * @brief Maximum event skip
     *
     * The number of periodic advertising packets that can be skipped
     * after a successful receive.
     */
    uint16_t skip;

    /**
     * @brief Synchronization timeout (N * 10 ms)
     *
     * Synchronization timeout for the periodic advertising sync.
     * Range 0x000A to 0x4000 (100 ms to 163840 ms)
     */
    uint16_t timeout;

    /** Periodic Advertising Sync Transfer options */
    uint8_t cte_type;
} st_ble_gap_past_param_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gap_cte_antenna_info_t
 *  @brief  This is the parameters used in R_BLE_GAP_GetAntennaInfo().
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /* Bitfield holding optional switching and sampling rates
     * bit should be one or compose of:
     *  BLE_GAP_CTE_TYPE_AOA (bit 0)
     *  BLE_GAP_CTE_TYPE_AOD_1US (bit 1)
     *  BLE_GAP_CTE_TYPE_AOD_2US (bit 2)
     * */
    uint8_t switch_sr;

    /* Available antennae number */
    uint8_t num_ant;

    /* Maximum supported antenna switching pattern length */
    uint8_t max_pattern_len;

    /* Maximum length of CTE in 8[us] units */
    uint8_t max_cte_len;
} st_ble_gap_cte_antenna_info_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gap_recv_test_param_t
 *  @brief  This is the parameters used in R_BLE_GAP_ReceiverTest()
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief RF channel.
     */
    uint8_t rx_ch;

    /**
     *  @brief The transmitter PHY of packets.
     */
    uint8_t phy;

    /**
     *  @brief Whether or not the Controller should assume the receiver has a stable modulation index.
     */
    uint8_t mod_idx;

    /**
     *  @brief Expected length of the Constant Tone Extensions in received test reference packets.
     */
    uint8_t expect_cte_len;

    /**
     *  @brief Expected type of the Constant Tone Extensions in received test reference packets.
     */
    uint8_t expect_cte_type;

    /**
     *  @brief Switching and sampling slots durations.
     */
    uint8_t slot_duration;

    /**
     *  @brief The number of Antenna IDs in the pattern.
     */
    uint8_t switch_pattern_len;

    /**
     *  @brief Antenna ID in the pattern.
     */
    uint8_t ant_ids[BLE_GAP_CTE_MAX_ANTENNA];
} st_ble_gap_recv_test_param_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gap_trans_test_param_t
 *  @brief  This is the parameters used in R_BLE_GAP_TransmitterTest().
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief RF channel.
     */
    uint8_t tx_ch;

    /**
     *  @brief Length of the Payload of the test reference packets.
     */
    uint8_t test_data_len;

    /**
     *  @brief Contents of the Payload of the test reference packets.
     */
    uint8_t packet_payload;

    /**
     *  @brief The transmitter PHY of packets.
     */
    uint8_t phy;

    /**
     *  @brief Length of the Constant Tone Extension in the test reference packets.
     */
    uint8_t cte_len;

    /**
     *  @brief Type of the Constant Tone Extension in the test reference packets.
     */
    uint8_t cte_type;

    /**
     *  @brief The number of Antenna IDs in the pattern.
     */
    uint8_t switch_pattern_len;

    /**
     *  @brief Antenna ID in the pattern.
     */
    uint8_t ant_ids[BLE_GAP_CTE_MAX_ANTENNA];

    /**
     *  @brief Transmit power level to be used by the transmitter.
     */
    int8_t tx_power_level;
} st_ble_gap_trans_test_param_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gap_set_path_loss_rpt_param_t
 *  @brief  This is the parameters used in R_BLE_GAP_SetPathLossReportingParam().
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief Connection handle.
     */
    uint16_t conn_hdl;

    /**
     *  @brief High threshold for the path loss.
     */
    uint8_t high_thr;

    /**
     *  @brief Hysteresis value for the high threshold.
     */
    uint8_t high_hys;

    /**
     *  @brief Low threshold for the path loss.
     */
    uint8_t low_thr;

    /**
     *  @brief Hysteresis value for the low threshold.
     */
    uint8_t low_hys;

    /**
     *  @brief Minimum time in number of connection events to be observed once the path loss crosses 
     *  the threshold before an event is generated.
     */
    uint16_t min_time_spent;
} st_ble_gap_set_path_loss_rpt_param_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gap_cte_connless_t
 *  @brief  connectionless CTE param
 *********************************************************************************************************************/
typedef struct  BLE_PACKED_OPTION
{
    /**
     *  @brief For connectionless CTE handle is the Sync handle identifying the
     *          Periodic Sync that has been established.
     */
    uint16_t adv_hdl;

    /** Length of CTE in 8us units. Range: 0x02 to 0x14 */
    uint8_t cte_len;

    /**
     * @brief CTE type.
     *
     * Allowed values are:
     *     BLE_GAP_CTE_TYPE_AOA
     *     BLE_GAP_CTE_TYPE_AOD_1US
     *     BLE_GAP_CTE_TYPE_AOD_2US
     */
    uint8_t cte_type;

