fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
    /** Number of CTE to transmit in each periodic adv interval. Range: 0x01 to 0x10 */
    uint8_t cte_count;

    /** Number of Antenna IDs in the switch pattern. */
    uint8_t pattern_len;

    /** List of antenna IDs in the pattern. */
    uint8_t ant_ids[BLE_GAP_CTE_MAX_ANTENNA];
} st_ble_gap_cte_connless_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gap_cte_conn_t
 *  @brief  connection CTE param
 *********************************************************************************************************************/
typedef struct  BLE_PACKED_OPTION
{
    /**
     *  @brief The ACL connection handle.
     */
    uint16_t conn_hdl;

    /**
     * @brief bitfield of CTE types that are allowed
     *
     * bit should be one or compose of:
     *     BLE_GAP_CTE_TYPE_AOA (bit 0)
     *     BLE_GAP_CTE_TYPE_AOD_1US (bit 1)
     *     BLE_GAP_CTE_TYPE_AOD_2US (bit 2)
     */
    uint8_t allow_cte_types;

    /** Number of Antenna IDs in the switch pattern. */
    uint8_t pattern_len;

    /** List of antenna IDs in the pattern. */
    uint8_t ant_ids[BLE_GAP_CTE_MAX_ANTENNA];
} st_ble_gap_cte_conn_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gap_cte_connless_recv_t
 *  @brief  connectionless CTE receive param
 *********************************************************************************************************************/
typedef struct  BLE_PACKED_OPTION
{
    /**
     *  @brief Periodic Sync that has been established for CTE.
     */
    uint16_t sync_hdl;

    /**
     * @brief CTE type
     * @details CTE type should be get from st_ble_gap_perd_adv_rept_t of BLE_GAP_EVENT_ADV_REPT_IND event
     *        in connectionless CTE, or get from ACL connection in connection CTE.
     *        The slot_durations, pattern_len, and ant_ids parameters are only used when receiving
     *        an AoA Constant Tone Extension and do not affect the reception of an AoD Constant Tone
     *        Extension.
     */
    uint8_t cte_type;

    /**
     * @brief Max number of CTEs to receive.
     * Min is 1, max is 10, 0 means receive continuously.
     */
    uint8_t max_cte_count;

    /**
     * Antenna switching slots. 1 for 1us or 2 for 2us
     */
    uint8_t slot_durations;

    /**
     * @brief Length of antenna switch pattern.
     */
    uint8_t pattern_len;

    /**
     * @brief Antenna switch pattern.
     */
    uint8_t ant_ids[BLE_GAP_CTE_MAX_ANTENNA];
} st_ble_gap_cte_connless_recv_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gap_cte_conn_rx_param_t
 *  @brief  connection CTE receive param
 *********************************************************************************************************************/
typedef struct  BLE_PACKED_OPTION
{
    /**
     *  @brief For connection CTE handle is the ACL connection handle.
     */
    uint16_t conn_hdl;

    /**
     * Antenna switching slots. 1 for 1us or 2 for 2us
     */
    uint8_t slot_durations;

    /**
     * @brief Length of antenna switch pattern.
     */
    uint8_t pattern_len;

    /**
     * @brief Antenna switch pattern.
     */
    uint8_t ant_ids[BLE_GAP_CTE_MAX_ANTENNA];
} st_ble_gap_cte_conn_rx_param_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gap_cte_conn_req_t
 *  @brief connection CTE request
 *********************************************************************************************************************/
typedef struct  BLE_PACKED_OPTION
{
    /**
     *  @brief For connection CTE handle is the ACL connection handle.
     */
    uint16_t conn_hdl;

    /**
     * @brief Requested interval for initiating the CTE Request procedure.
     *
     * Value 0x0 means, run the procedure once. Other values are intervals in number of
     * connection events, to run the command periodically.
     */
    uint16_t interval;

    /** Requested length of the CTE in 8 us units. */
    uint8_t cte_length;

    /**
     * @brief Requested type of the CTE.
     *
     * Allowed values are BLE_GAP_CTE_TYPE_AOA, BLE_GAP_CTE_TYPE_AOD_1US and
     * BLE_GAP_CTE_TYPE_AOD_2US
     */
    uint8_t cte_type;
} st_ble_gap_cte_conn_req_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gap_subrate_param_t
 *  @brief  subrating param
 *********************************************************************************************************************/
typedef struct  BLE_PACKED_OPTION
{
    uint16_t subrate_min;
    uint16_t subrate_max;
    uint16_t max_latency;
    uint16_t continuation_num;
    uint16_t supervision_timeout;
} st_ble_gap_subrate_param_t;

/* ============================================== GAP Event Parameters ============================================= */

/* Event Code : BLE_GAP_EVENT_STACK_ON  : none */

/* Event Code : BLE_GAP_EVENT_STACK_OFF : none */

/* Event Code : BLE_GAP_EVENT_LOC_VER_INFO : st_ble_gap_loc_dev_info_evt_t */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_ver_num_t
 *  @brief  Version number of host stack.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief  Major version number.
     */
    uint8_t major;

    /**
     *  @brief  Minor version number.
     */
    uint8_t minor;

    /**
     *  @brief  Subminor version number.
     */
    uint8_t subminor;
} st_ble_gap_ver_num_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gap_loc_ver_info_t
 *  @brief  Version number of Controller.
 *  @details Refer Bluetooth SIG Assigned Number(https://www.bluetooth.com/specifications/assigned-numbers).
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief  Bluetooth HCI version.
     */
    uint8_t hci_ver;

    /**
     *  @brief   Bluetooth HCI revision.
     */
    uint16_t hci_rev;

    /**
     *  @brief   Link Layer revision.
     */
    uint8_t lmp_ver;

    /**
     *  @brief   Manufacturer ID.
     */
    uint16_t mnf_name;

    /**
     *  @brief   Link Layer subversion.
     */
    uint16_t lmp_sub_ver;
} st_ble_gap_loc_ver_info_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gap_loc_dev_info_evt_t
 *  @brief  Version information of local device.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief   Bluetooth Device Address.
     */
    st_ble_dev_addr_t l_dev_addr;

    /**
     *  @brief   Version number of host stack in local device.
     */
    st_ble_gap_ver_num_t l_ver_num;

    /**
     *  @brief   Version number of Controller in local device.
     */
    st_ble_gap_loc_ver_info_t l_bt_info;
} st_ble_gap_loc_dev_info_evt_t;

/* Event Code : BLE_GAP_EVENT_HW_ERR : st_ble_gap_hw_err_evt_t */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_hw_err_evt_t
 *  @brief  Hardware error that is notified from Controller.
 ********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief   The hw_code field indicates the cause of the hardware error.
     */
    uint8_t hw_code;
} st_ble_gap_hw_err_evt_t;

