fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
/* Event Code : BLE_GAP_EVENT_CMD_ERR: st_ble_gap_cmd_err_evt_t */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_cmd_err_evt_t
 *  @brief  HCI Command error.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief   The opcode of HCI Command which caused the error.
     */
    uint16_t op_code;

    /**
     *  @brief   Module ID which caused the error.
     */
    uint32_t module_id;
} st_ble_gap_cmd_err_evt_t;

/* Event Code : BLE_GAP_EVENT_ADV_REPT_IND: st_ble_gap_adv_rept_evt_t */
/* ADV report related Event defines */
/* Legacy ADV Report related structure */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_adv_rept_t
 *  @brief  Advertising Report.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief The number of Advertising Reports received.
     */
    uint8_t num;

    /**
     *  @brief Type of Advertising Packet.
     *  @details
     *  <table>
     *      <tr>
     *          <th>valuer</th>
     *          <th>description</th>
     *      </tr>
     *      <tr>
     *          <td>0x00</td>
     *          <td>Connectable and scannable undirected advertising(ADV_IND).</td>
     *      </tr>
     *      <tr>
     *          <td>0x01</td>
     *          <td>Connectable directed advertising(ADV_DIRECT_IND).</td>
     *      </tr>
     *      <tr>
     *          <td>0x02</td>
     *          <td>Scannable undirected advertising(ADV_SCAN_IND).</td>
     *      </tr>
     *      <tr>
     *          <td>0x03</td>
     *          <td>Non-connectable undirected advertising(ADV_NONCONN_IND).</td>
     *      </tr>
     *      <tr>
     *          <td>0x04</td>
     *          <td>Scan response(SCAN_RSP).</td>
     *      </tr>
     *  </table>
     */
    uint8_t adv_type;

    /**
     *  @brief Address type of the advertiser.
     *  @details
     *               |   value   |   description                                                   |
     *               |:--------- |:--------------------------------------------------------------- |
     *               | 0x00      | Public Address.                                                 |
     *               | 0x01      | Random Address.                                                 |
     *               | 0x02      | Public Identity Address which could be resolved in Controller.  |
     *               | 0x03      | Random Identity Address which could be resolved in Controller.  |
     */
    uint8_t addr_type;

    /**
     *  @brief Address of the advertiser.
     *  @note   The BD address setting format is little endian.
     */
    uint8_t * p_addr;

    /**
     *  @brief   Length of Advertising data(in bytes).
     *  @details Valid range is 0 - 31.
     */
    uint8_t len;

    /**
     *  @brief  RSSI(in dBm).
     *  @details Valid range is -127 <= tx_pwr <= 20 and 127.\n
     *           If the tx_pwr is 127, it means that RSSI could not be retrieved.
     */
    int8_t rssi;

    /**
     *  @brief   Advertising data/Scan Response Data.
     */
    uint8_t * p_data;
} st_ble_gap_adv_rept_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gap_ext_adv_rept_t
 *  @brief  Extended Advertising Report.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief The number of Advertising Reports received.
     */
    uint8_t num;

    /**
     *  @brief Type of Advertising Packet.
     *  @details
     *  <table>
     *      <tr>
     *          <th>Bit Number</th>
     *          <th>description</th>
     *      </tr>
     *      <tr>
     *          <td>0</td>
     *          <td>Connectable advertising.</td>
     *      </tr>
     *      <tr>
     *          <td>1</td>
     *          <td>Scannable advertising.</td>
     *      </tr>
     *      <tr>
     *          <td>2</td>
     *          <td>Directed advertising.</td>
     *      </tr>
     *      <tr>
     *          <td>3</td>
     *          <td>Scan response.</td>
     *      </tr>
     *      <tr>
     *          <td>4</td>
     *          <td>Legacy advertising PDU.</td>
     *      </tr>
     *      <tr>
     *          <td>5-6</td>
     *          <td>The status of Advertising Data/Scan Response Data.<BR/>
     *          Data Status:<BR/>
     *          00b = Complete <BR/>
     *          01b = Incomplete, more data come <BR/>
     *          10b = Incomplete, data truncated, no more to come <BR/>
     *          </td>
     *      </tr>
     *      <tr>
     *          <td>All other bits</td>
     *          <td>Reserved for future use</td>
     *      </tr>
     *  </table>
     */
    uint16_t adv_type;

    /**
     *  @brief Address type of the advertiser.
     *  @details
     *               |   value   |   description                                                   |
     *               |:--------- |:--------------------------------------------------------------- |
     *               | 0x00      | Public Address.                                                 |
     *               | 0x01      | Random Address.                                                 |
     *               | 0x02      | Public Identity Address which could be resolved in Controller.  |
     *               | 0x03      | Random Identity Address which could be resolved in Controller.  |
     *               | 0xFF      | Anonymous advertisement.                                        |
     */
    uint8_t addr_type;

    /**
     *  @brief Address of the advertiser.
     *  @note  The BD address setting format is little endian.
     */
    uint8_t * p_addr;

    /**
     *  @brief The primary PHY configuration of the advertiser.
     *  @details
     *   The primary PHY configuration of the advertiser.
     *               |   value   |   description            |
     *               |:--------- |:------------------------ |
     *               | 0x01      | 1M PHY                   |
     *               | 0x03      | Coded PHY                |
     */
    uint8_t adv_phy;

    /**
     *  @brief The secondary PHY configuration of the advertiser.
     *  @details
     *               |   value   |   description                                                    |
     *               |:--------- |:---------------------------------------------------------------- |
     *               | 0x00      | Nothing has been received with Secondary Advertising Channel.    |
     *               | 0x01      | The Secondary Advertising PHY configuration was 1M PHY.          |
     *               | 0x02      | The Secondary Advertising PHY configuration was 2M PHY.          |
     *               | 0x03      | The Secondary Advertising PHY configuration was Coded PHY.       |
     */
    uint8_t sec_adv_phy;

    /**
     *  @brief Advertising SID included in the received Advertising Report.
     *  @details Valid range is 0 <= adv_sid <= 0x0F and 0xFF.\n
     *           If the adv_sid is 0xFF, there is no field which includes SID.
     */
    uint8_t adv_sid;

    /**
     *  @brief  TX power(in dBm).
     *  @details Valid range is -127 <= tx_pwr <= 20 and 127.\n
     *           If the tx_pwr is 127, it means that Tx power could not be retrieved.
     */
    int8_t tx_pwr;

    /**
     *  @brief  RSSI(in dBm).
     *  @details Valid range is -127 <= tx_pwr <= 20 and 127.\n
     *           If the tx_pwr is 127, it means that RSSI could not be retrieved.
     */
    int8_t rssi;

    /**
     *  @brief  Periodic Advertising interval.
     *  @details If the perd_adv_intv is 0x0000, it means that this advertising is not periodic advertising.\n
     *           If the perd_adv_intv is 0x0006 - 0xFFFF,
     *           it means that this field is the Periodic Advertising interval.\n
     *           Periodic Advertising interval = per_adv_intr * 1.25ms.
     */
    uint16_t perd_adv_intv;

    /**
     *  @brief The address type of Direct Advertising PDU.
     *  @details
     *               |   value   |   description                                                         |
     *               |:--------- |:--------------------------------------------------------------------- |
     *               | 0x00      | Public Address.                                                       |
     *               | 0x01      | Random Address.                                                       |
     *               | 0x02      | Public Identity Address which could be resolved in Controller.        |
     *               | 0x03      | Random Identity Address which could be resolved in Controller.        |
     *               | 0xFE      | Resolvable Privacy Address which could not be resolved in Controller. |
     */
    uint8_t dir_addr_type;

    /**
     *  @brief   Address of Direct Advertising PDU.
     *  @note   The BD address setting format is little endian.
     */
    uint8_t * p_dir_addr;

    /**
     *  @brief   Length of Advertising data(in bytes).
     *  @details Valid range is 0 - 229.
     */
    uint8_t len;

    /**
     *  @brief   Advertising data/Scan Response Data.
     */
    uint8_t * p_data;
} st_ble_gap_ext_adv_rept_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gap_perd_adv_rept_t
 *  @brief  Periodic Advertising Report.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief   Sync handle.
     *  @details Valid range is 0x0000 - 0x0EFF.
     */
    uint16_t sync_hdl;

    /**
     *  @brief  TX power(in dBm).
     *  @details Valid range is -127 <= tx_pwr <= 20 and 127.\n
     *           If tx_pwr is 127, it means that Tx power could not be retrieved.
     */
    int8_t tx_pwr;

    /**
     *  @brief  RSSI(in dBm).
     *  @details Valid range is -127 <= rssi <= 20 and 127.\n
     *           If rssi is 127, it means that RSSI could not be retrieved.
     */
    int8_t rssi;

    /**
     *  @brief  Type of Constant Tone Extension in the periodic advertising packets.
     *  @details
     *               |   value   |   description                                           |
     *               |:--------- |:------------------------------------------------------- |
     *               | 0x00      | AoA Constant Tone Extension.                            |
     *               | 0x01      | AoD Constant Tone Extension with 1 μs slots.            |
     *               | 0x02      | AoD Constant Tone Extension with 2 μs slots.            |
     *               | 0xFF      | No Constant Tone Extension.                             |
     */
    uint8_t cte_type;

    /**
     *  @brief  Reserved for future use.
     *  @details
     *               |   value   |   description                                           |
     *               |:--------- |:------------------------------------------------------- |
     *               | 0x00      | Data Complete.                                          |
     *               | 0x01      | Data incomplete, more data to come.                     |
     *               | 0x02      | Data incomplete, data truncated, no more to come.       |
     */
    uint8_t data_status;

    /**
     *  @brief  Length of Periodic Advertising data(in bytes).
     *  @details Valid range is 0 - 247.
     */
    uint8_t len;

    /**
     *  @brief  Periodic Advertising data.
     */
    uint8_t * p_data;
} st_ble_gap_perd_adv_rept_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gap_adv_rept_evt_t
 *  @brief  Advertising report.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief Data type.
     *  @details
     *               |        value         |   description                   |
     *               |:-------------------- |:---------------------------------- |
     *               | 0x00                 | Advertising Report.                |
     *               | 0x01                 | Extended Advertising Report.    |
     *               | 0x02                 | Periodic Advertising Report.    |
     *
     *   If the BLE Protocol Stack library type is "extended",
     *   the adv_rpt_type field in a Legacy Advertising Report event is 0x01.
     */
    uint8_t adv_rpt_type;

    /**
     *  @brief Advertising Report.
     */
    union
    {
        /**
         *  @brief Advertising Report.
         */
        st_ble_gap_adv_rept_t * p_adv_rpt;

        /**
         *  @brief Extended Advertising Report.
         */
        st_ble_gap_ext_adv_rept_t * p_ext_adv_rpt;

        /**
         *  @brief Periodic Advertising Report.
         */
        st_ble_gap_perd_adv_rept_t * p_per_adv_rpt;
    } param;
} st_ble_gap_adv_rept_evt_t;

