fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
/* Event Code : BLE_GAP_EVENT_ADV_PARAM_SET_COMP       : st_ble_gap_adv_set_evt_t */
/* Event Code : BLE_GAP_EVENT_ADV_ON                   : st_ble_gap_adv_set_evt_t  */
/* Event Code : BLE_GAP_EVENT_PERD_ADV_ON              : st_ble_gap_adv_set_evt_t */
/* Event Code : BLE_GAP_EVENT_PERD_ADV_OFF             : st_ble_gap_adv_set_evt_t */
/* Event Code : BLE_GAP_EVENT_PERD_ADV_PARAM_SET_COMP  : st_ble_gap_adv_set_evt_t */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_adv_set_evt_t
 *  @brief  Advertising handle.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief Advertising handle specifying the advertising set configured advertising parameters.
     */
    uint8_t adv_hdl;
} st_ble_gap_adv_set_evt_t;

/* Event Code : BLE_GAP_EVENT_ADV_OFF              : st_ble_gap_adv_off_evt_t  */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_adv_off_evt_t
 *  @brief  Information about the advertising set which stops advertising.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief Advertising handle identifying the advertising set which has stopped advertising.
     *  @details Valid range is 0x00 - 0x03.
     */
    uint8_t adv_hdl;

    /**
     *  @brief  The reason for stopping advertising.
     *  @details
     *      <table>
     *          <tr>
     *              <th>value</th>
     *              <th>description</th>
     *          </tr>
     *          <tr>
     *              <td>0x01</td>
     *              <td>
     *                  Advertising has been stopped by R_BLE_GAP_StopAdv().
     *              </td>
     *          </tr>
     *          <tr>
     *              <td>0x02</td>
     *              <td>
     *                  Because the duration specified by R_BLE_GAP_StartAdv() was expired,
     *                  advertising has terminated.
     *              </td>
     *          </tr>
     *          <tr>
     *              <td>0x03</td>
     *              <td>
     *                  Because the max_extd_adv_evts parameter specified by R_BLE_GAP_StartAdv() was reached,
     *                  advertising has terminated.
     *              </td>
     *          </tr>
     *          <tr>
     *              <td>0x04</td>
     *              <td>
     *                   Because the connection was established with the remote device, advertising has terminated.
     *              </td>
     *          </tr>
     *      </table>
     */
    uint8_t reason;

    /**
     *  @brief Connection handle.
     *  @details  If the reason field is 0x04, this field indicates connection handle identifying
     *            the remote device connected with local device.
     *            If other reasons, ignore this field.
     */
    uint16_t conn_hdl;

    /**
     *  @brief  The number of the advertising event that has been received until advertising has terminated.
     *  @details  If max_extd_adv_evts by R_BLE_GAP_StartAdv() is not 0, this parameter is valid.
     */
    uint8_t num_comp_ext_adv_evts;
} st_ble_gap_adv_off_evt_t;

/* Event Code : BLE_GAP_EVENT_ADV_DATA_UPD_COMP : st_ble_gap_adv_data_evt_t  */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_adv_data_evt_t
 *  @brief  This structure notifies that advertising data has been set to Controller by R_BLE_GAP_SetAdvSresData().
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief Advertising handle identifying the advertising set to
     *         which advertising data/scan response data/periodic advertising data is set.
     */
    uint8_t adv_hdl;

    /**
     *  @brief Type of the data set to the advertising set.
     *  @details
     *    | value                                |   description               |
     *    |:------------------------------------ |:--------------------------- |
     *    | BLE_GAP_ADV_DATA_MODE(0x00)          |  Advertising data           |
     *    | BLE_GAP_SCAN_RSP_DATA_MODE(0x01)     |  Scan response data         |
     *    | BLE_GAP_PERD_ADV_DATA_MODE(0x02)     |  Periodic advertising data  |
     */
    uint8_t data_type;
} st_ble_gap_adv_data_evt_t;

/* Event Code : BLE_GAP_EVENT_ADV_SET_REMOVE_COMP : st_ble_gap_rem_adv_set_evt_t  */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_rem_adv_set_evt_t
 *  @brief  This structure notifies that an advertising set has been removed.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief  This field indicates that the advertising set has been removed or cleared.
     *  @details
     *    | value    |   description                           |
     *    |:-------- |:--------------------------------------- |
     *    | 0x01     |  The advertising set has been removed.  |
     *    | 0x02     |  The advertising set has been cleared.  |
     */
    uint8_t remove_op;

    /**
     *  @brief Advertising handle identifying the advertising set which has been removed.
     *  @details  If the advertising set has been cleared, this field is ignored.
     */
    uint8_t adv_hdl;
} st_ble_gap_rem_adv_set_evt_t;

/* Event Code : BLE_GAP_EVENT_SCAN_ON  : none  */
/* Event Code : BLE_GAP_EVENT_SCAN_OFF : none  */

/* Event Code : BLE_GAP_EVENT_CONN_IND : st_ble_gap_conn_evt_t  */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_conn_evt_t
 *  @brief  This structure notifies that a link has been established.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief Connection handle identifying the created link.
     */
    uint16_t conn_hdl;

    /**
     *  @brief  The role of the link.
     *  @details
     *    | value    |   description  |
     *    |:-------- |:-------------- |
     *    | 0x00     |  Master        |
     *    | 0x01     |  Slave         |
     */
    uint8_t role;

    /**
     *  @brief  Address type of the remote device.
     *  @details
     *  <table>
     *      <tr>
     *          <th>value</th>
     *          <th>description</th>
     *      </tr>
     *      <tr>
     *          <td>0x00</td>
     *          <td>Public Address</td>
     *      </tr>
     *      <tr>
     *          <td>0x01</td>
     *          <td>Random Address</td>
     *      </tr>
     *      <tr>
     *          <td>0x02</td>
     *          <td>Public Identity Address.<BR/>
     *              It indicates that the Controller could resolve the resolvable private address of the remote device.
     *          </td>
     *      </tr>
     *      <tr>
     *          <td>0x03</td>
     *          <td>Random Identity Address.<BR/>
     *              It indicates that the Controller could resolve the resolvable private address of the remote device.
     *          <td>
     *      </tr>
     *  </table>
     */
    uint8_t remote_addr_type;

    /**
     *  @brief Address of the remote device.
     *  @note   The BD address setting format is little endian.
     */
    uint8_t remote_addr[BLE_BD_ADDR_LEN];

    /**
     *  @brief Resolvable private address that local device used in connection procedure.
     *  @details
     *  The local device address used in creating the link when the address type was set to
     *  BLE_GAP_ADDR_RPA_ID_PUBLIC or BLE_GAP_ADDR_RPA_ID_RANDOM by R_BLE_GAP_SetAdvParam() or
     *  R_BLE_GAP_CreateConn().
     *  If the address type was set to other than BLE_GAP_ADDR_RPA_ID_PUBLIC and
     *  BLE_GAP_ADDR_RPA_ID_RANDOM, this field is set to all-zero.
     *  @note   The BD address setting format is little endian.
     */
    uint8_t local_rpa[BLE_BD_ADDR_LEN];

    /**
     *  @brief Resolvable private address that the remote device used in connection procedure.
     *  @details
     *  This field indicates the remote resolvable private address when remote_addr_type is 0x02 or 0x03.
     *  If remote_addr_type is other than 0x02 and 0x03, this field is set to all-zero.
     *  @note   The BD address setting format is little endian.
     */
    uint8_t remote_rpa[BLE_BD_ADDR_LEN];

    /**
     *  @brief  Connection interval.
     *  @details
     *  Valid range is 0x0006 - 0x0C80.\n
     *  Time(ms) = conn_intv * 1.25.
     */
    uint16_t conn_intv;

    /**
     *  @brief  Slave latency.
     *  @details
     *  Valid range is 0x0000 - 0x01F3.
     */
    uint16_t conn_latency;

    /**
     *  @brief  Supervision timeout.
     *  @details
     *  Valid range is 0x000A - 0x0C80.Time(ms) = sup_to * 10.
     */
    uint16_t sup_to;

    /**
     *  @brief  Master_Clock_Accuracy.
     *  @details
     *    |  value   |   description               |
     *    |:---------|:--------------------------- |
     *    | 0x00     | 500ppm                      |
     *    | 0x01     | 250ppm                      |
     *    | 0x02     | 150ppm                      |
     *    | 0x03     | 100ppm                      |
     *    | 0x04     | 75ppm                       |
     *    | 0x05     | 50ppm                       |
     *    | 0x06     | 30ppm                       |
     *    | 0x07     | 20ppm                       |
     */
    uint8_t clk_acc;
} st_ble_gap_conn_evt_t;

/* Event Code : BLE_GAP_EVENT_DISCONN_IND : st_ble_gap_disconn_evt_t  */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_disconn_evt_t
 *  @brief  This structure notifies that a link has been disconnected.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief   Connection handle identifying the link disconnected.
     */
    uint16_t conn_hdl;

    /**
     *  @brief   The reason for disconnection.
     *  @details
     *  Refer Core Specification Vol.2 Part D ,"2 Error Code Descriptions".
     */
    uint8_t reason;
} st_ble_gap_disconn_evt_t;

/* Event Code : BLE_GAP_EVENT_CONN_CANCEL_COMP : none  */

