fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
/* Event Code : BLE_GAP_EVENT_WHITE_LIST_CONF_COMP : st_ble_gap_white_list_conf_evt_t  */

/* Event Code : BLE_GAP_EVENT_RAND_ADDR_SET_COMP : none  */

/* Event Code : BLE_GAP_EVENT_CH_MAP_RD_COMP : st_ble_gap_rd_ch_map_evt_t  */
/* Read Channel MAP */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_rd_ch_map_evt_t
 *  @brief  This structure notifies that Channel Map has been retrieved by R_BLE_GAP_ReadChMap().
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    Connection handle identifying the link whose Channel Map was retrieved.
     */
    uint16_t conn_hdl;

    /**
     *  @brief   Channel Map.
     */
    uint8_t ch_map[BLE_GAP_CH_MAP_SIZE];
} st_ble_gap_rd_ch_map_evt_t;

/* Event Code : BLE_GAP_EVENT_CH_MAP_SET_COMP : none  */

/* Event Code : BLE_GAP_EVENT_RSSI_RD_COMP  : st_ble_gap_rd_rssi_evt_t  */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_rd_rssi_evt_t
 *  @brief  This structure notifies that RSSI has been retrieved by R_BLE_GAP_ReadRssi().
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    Connection handle identifying the link whose RSSI was retrieved.
     */
    uint16_t conn_hdl;

    /**
     *  @brief    RSSI(in dBm).
     *  @details
     *  Valid range is -127 < rssi < 20 and 127.\n
     *  If this field is 127, it indicates that RSSI could not be retrieved.
     */
    int8_t rssi;
} st_ble_gap_rd_rssi_evt_t;

/* Event Code : BLE_GAP_EVENT_GET_REM_DEV_INFO  : st_ble_gap_dev_info_evt_t  */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_dev_info_evt_t
 *  @brief This structure notifies that information about
 *  remote device has been retrieved by R_BLE_GAP_GetRemDevInfo().
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief     Connection handle identifying the remote device whose information has been retrieved.
     */
    uint16_t conn_hdl;

    /**
     *  @brief  Information about the remote device. This field is a bitwise OR of the following values.
     *  @details
     *    |  Bit Number        |   description                   |
     *    |:-------------------|:------------------------------- |
     *    | bit0               | Address                         |
     *    | bit1               | Version, company_id, subversion |
     *    | bit2               | Feature                         |
     *    | All other bits     | Reserved for future use         |
     */
    uint8_t get_status;

    /**
     *  @brief      Address of the remote device.
     */
    st_ble_dev_addr_t addr;

    /**
     *  @brief    The version of Link Layer of the remote device.
     *  @details
     *  Refer to Bluetooth SIG Assigned Number
     *  (https://www.bluetooth.com/specifications/assigned-numbers) regarding defined number.
     */
    uint8_t version;

    /**
     *  @brief    The manufacturer ID of the remote device.
     *  @details
     *  Refer to Bluetooth SIG Assigned Number
     *  (https://www.bluetooth.com/specifications/assigned-numbers) regarding defined number.
     */
    uint16_t company_id;

    /**
     *  @brief       The subversion of Link Layer.
     */
    uint16_t subversion;

    /**
     *  @brief    LE feature supported in the remote device.
     *  @details
     *  Refer to Core Spec Vol 6, Part B 4.6 FEATURE SUPPORT.
     */
    uint8_t features[BLE_GAP_REM_FEATURE_SIZE];
} st_ble_gap_dev_info_evt_t;

/* Event Code : BLE_GAP_EVENT_CONN_PARAM_UPD_COMP  : st_ble_gap_conn_upd_evt_t  */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_conn_upd_evt_t
 *  @brief  This structure notifies that connection parameters has been updated.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief     Connection handle identifying the connection whose parameters has been updated.
     */
    uint16_t conn_hdl;

    /**
     *  @brief    Updated Connection Interval.
     *  @details
     *  Valid range is 0x0006 - 0x0C80.\n
     *  Time(ms) = conn_intv * 1.25.
     */
    uint16_t conn_intv;

    /**
     *  @brief    Updated slave latency.
     *  @details
     *  Valid range is 0x0000 - 0x01F3.
     */
    uint16_t conn_latency;

    /**
     *  @brief    Updated supervision timeout.
     *  @details
     *  Valid range is 0x000A - 0x0C80.\n
     *  Time(ms) = sup_to * 10.
     */
    uint16_t sup_to;
} st_ble_gap_conn_upd_evt_t;

/* Event Code : BLE_GAP_EVENT_CONN_PARAM_UPD_REQ   : st_ble_gap_conn_upd_req_evt_t  */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_conn_upd_req_evt_t
 *  @brief  This structure notifies that a request for connection parameters update has been received.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief      Connection handle identifying the link that was requested to update connection parameters.
     */
    uint16_t conn_hdl;

    /**
     *  @brief     Minimum connection interval.
     *  @details
     *  Valid range is 0x0006 - 0x0C80.\n
     *  Time(ms) = conn_intv_min * 1.25.
     */
    uint16_t conn_intv_min;

    /**
     *  @brief     Maximum connection interval.
     *  @details
     *  Valid range is 0x0006 - 0x0C80.\n
     *  Time(ms) = conn_intv_max * 1.25.
     */
    uint16_t conn_intv_max;

    /**
     *  @brief     Slave latency.
     *  @details
     *  Valid range is 0x0000 - 0x01F3.
     */
    uint16_t conn_latency;

    /**
     *  @brief     Supervision timeout.
     *  @details
     *  Valid range is 0x000A - 0x0C80.\n
     *  Time(ms) = sup_to * 10
     */
    uint16_t sup_to;
} st_ble_gap_conn_upd_req_evt_t;

/* Event Code : RBLE_GAP_EVENT_CONN_PARAM_UPD_RSP        : st_ble_gap_conn_hdl_evt_t  */
/* Event Code : BLE_GAP_EVENT_AUTH_PL_TO_EXPIRED         : st_ble_gap_conn_hdl_evt_t  */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_conn_hdl_evt_t
 *  @brief  This structure notifies that a GAP Event that includes only connection handle has occurred.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief     Connection handle.
     */
    uint16_t conn_hdl;
} st_ble_gap_conn_hdl_evt_t;

