fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
/* Event Code : BLE_GAP_EVENT_DATA_LEN_CHG : st_ble_gap_data_len_chg_evt_t  */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_data_len_chg_evt_t
 *  @brief  This structure notifies that the packet data length has been updated.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief     Connection handle identifying the link that updated Data Length.
     */
    uint16_t conn_hdl;

    /**
     *  @brief     Updated transmission packet size(in bytes).
     *  @details
     *  Valid range is 0x001B - 0x00FB.
     */
    uint16_t tx_octets;

    /**
     *  @brief     Updated transmission time(us).
     *  @details
     *  Valid range is 0x0148 - 0x4290.
     */
    uint16_t tx_time;

    /**
     *  @brief     Updated receive packet size(in bytes).
     *  @details
     *  Valid range is 0x001B - 0x00FB.
     */
    uint16_t rx_octets;

    /**
     *  @brief     Updated receive time(us).
     *  @details
     *  Valid range is 0x0148 - 0x4290.
     */
    uint16_t rx_time;
} st_ble_gap_data_len_chg_evt_t;

/* Event Code : BLE_GAP_EVENT_RSLV_LIST_CONF_COMP : st_ble_gap_rslv_list_conf_evt_t  */

/* Event Code : BLE_GAP_EVENT_RPA_EN_COMP : none  */
/* Event Code : BLE_GAP_EVENT_SET_RPA_TO_COMP       : none  */
/* Event Code : BLE_GAP_EVENT_RD_RPA_COMP           : st_ble_gap_rd_rpa_evt_t  */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_rd_rpa_evt_t
 *  @brief  This structure notifies that the local resolvable private address
 *          has been retrieved by R_BLE_GAP_ReadRpa().
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief     The resolvable private address of local device.
     */
    st_ble_dev_addr_t addr;
} st_ble_gap_rd_rpa_evt_t;

/* Event Code : BLE_GAP_EVENT_PHY_UPD      : st_ble_gap_phy_upd_evt_t  */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_phy_upd_evt_t
 *  @brief  This structure notifies that PHY for a connection has been updated.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief     Connection handle identifying the link that has been updated.
     */
    uint16_t conn_hdl;

    /**
     *  @brief     Transmitter PHY.
     *  @details
     *    |  value     |   description                                                |
     *    |:-----------|:------------------------------------------------------------ |
     *    | 0x01       | The transmitter PHY has been updated to 1M PHY.              |
     *    | 0x02       | The transmitter PHY has been updated to 2M PHY.              |
     *    | 0x03       | The transmitter PHY has been updated to Coded PHY.           |
     */
    uint8_t tx_phy;

    /**
     *  @brief     Receiver PHY.
     *  @details
     *    |  value     |   description                                                |
     *    |:-----------|:------------------------------------------------------------ |
     *    | 0x01       | The receiver PHY has been updated to 1M PHY.              |
     *    | 0x02       | The receiver PHY has been updated to 2M PHY.              |
     *    | 0x03       | The receiver PHY has been updated to Coded PHY.           |
     */
    uint8_t rx_phy;
} st_ble_gap_phy_upd_evt_t;

/* Event Code : BLE_GAP_EVENT_PHY_RD_COMP  : st_ble_gap_phy_rd_evt_t  */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_phy_rd_evt_t
 *  @brief  This structure notifies that the PHY settings has been retrieved by R_BLE_GAP_ReadPhy().
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief     Connection handle identifying the link that has been retrieved the PHY settings.
     */
    uint16_t conn_hdl;

    /**
     *  @brief     Transmitter PHY.
     *  @details
     *    |  value     |   description                                                |
     *    |:-----------|:------------------------------------------------------------ |
     *    | 0x01       | The transmitter PHY has been updated to 1M PHY.              |
     *    | 0x02       | The transmitter PHY has been updated to 2M PHY.              |
     *    | 0x03       | The transmitter PHY has been updated to Coded PHY.           |
     */
    uint8_t tx_phy;

    /**
     *  @brief     Receiver PHY.
     *  @details
     *    |  value     |   description                                                |
     *    |:-----------|:------------------------------------------------------------ |
     *    | 0x01       | The receiver PHY has been updated to 1M PHY.              |
     *    | 0x02       | The receiver PHY has been updated to 2M PHY.              |
     *    | 0x03       | The receiver PHY has been updated to Coded PHY.           |
     */
    uint8_t rx_phy;
} st_ble_gap_phy_rd_evt_t;

/* Event Code : BLE_GAP_EVENT_PHY_SET_COMP   : st_ble_gap_conn_hdl_evt_t  */
/* Event Code : BLE_GAP_EVENT_SCAN_REQ_RECV  : st_ble_gap_scan_req_recv_evt_t  */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_scan_req_recv_evt_t
 *  @brief  This structure notifies that a Scan Request packet has been received from a Scanner.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief     Advertising handle identifying the advertising set that has received the Scan Request.
     */
    uint8_t adv_hdl;

    /**
     *  @brief      Address type of the Scanner.
     *  @details
     *    |  value     |   description                                                  |
     *    |:-----------|:-------------------------------------------------------------- |
     *    | 0x00       | Public Address.                                                |
     *    | 0x01       | Random Address.                                                |
     *    | 0x02       | Public Identity Address which could be resolved in Controller. |
     *    | 0x03       | Random Identity Address which could be resolved in Controller. |
     */
    uint8_t scanner_addr_type;

    /**
     *  @brief     Address of the Scanner.
     *  @note      The BD address setting format is little endian.
     */
    uint8_t scanner_addr[BLE_BD_ADDR_LEN];
} st_ble_gap_scan_req_recv_evt_t;

/* Event Code : BLE_GAP_EVENT_SYNC_EST  : st_ble_gap_sync_est_evt_t  */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_sync_est_evt_t
 *  @brief  This structure notifies that a Periodic sync has been established.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief     Sync handle identifying the Periodic Sync that has been established.
     */
    uint16_t sync_hdl;

    /**
     *  @brief     Advertising SID identifying the advertising set that has established the Periodic Sync.
     */
    uint8_t adv_sid;

    /**
     *  @brief      Address type of the advertiser.
     *  @details
     *    |  value     |   description                                                  |
     *    |:-----------|:-------------------------------------------------------------- |
     *    | 0x00       | Public Address.                                                |
     *    | 0x01       | Random Address.                                                |
     *    | 0x02       | Public Identity Address which could be resolved in Controller. |
     *    | 0x03       | Random Identity Address which could be resolved in Controller. |
     */
    uint8_t adv_addr_type;

    /**
     *  @brief     Address of the advertiser.
     *  @note   The BD address setting format is little endian.
     */
    uint8_t * p_adv_addr;

    /**
     *  @brief      Advertising PHY.
     *  @details
     *    |  value     |   description                |
     *    |:-----------|:---------------------------- |
     *    | 0x01       | Advertiser PHY is 1M PHY.    |
     *    | 0x02       | Advertiser PHY is 2M PHY.    |
     *    | 0x03       | Advertiser PHY is Coded PHY. |
     */
    uint8_t adv_phy;

    /**
     *  @brief     Periodic Advertising Interval.
     *  @details
     *  Valid range is 0x0006 - 0xFFFF.\n
     *  Time(ms) = perd_adv_intv * 1.25.
     */
    uint16_t perd_adv_intv;

    /**
     *  @brief  Advertiser Clock Accuracy.
     *  @details
     *    |  value   |   description               |
     *    |:---------|:--------------------------- |
     *    | 0x00     | 500ppm                      |
     *    | 0x01     | 250ppm                      |
     *    | 0x02     | 150ppm                      |
     *    | 0x03     | 100ppm                      |
     *    | 0x04     | 75ppm                       |
     *    | 0x05     | 50ppm                       |
     *    | 0x06     | 30ppm                       |
     *    | 0x07     | 20ppm                       |
     */
    uint8_t adv_clk_acc;
} st_ble_gap_sync_est_evt_t;

/* Event Code : BLE_GAP_EVENT_SYNC_TERM    : st_ble_gap_sync_hdl_evt_t  */
/* Event Code : BLE_GAP_EVENT_SYNC_LOST    : st_ble_gap_sync_hdl_evt_t  */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_sync_hdl_evt_t
 *  @brief  This structure notifies that a GAP Event that includes only sync handle has occurred.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief     Sync handle.
     */
    uint16_t sync_hdl;
} st_ble_gap_sync_hdl_evt_t;

/* Event Code : BLE_GAP_EVENT_SYNC_CREATE_CANCEL_COMP   : none  */
/* Event Code : BLE_GAP_EVENT_PERD_LIST_CONF_COMP       : st_ble_gap_perd_list_conf_evt_t  */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_white_list_conf_evt_t
 *  @brief  This structure notifies that White List has been configured.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief     The operation for White List.
     *  @details
     *    |  value   |   description                            |
     *    |:---------|:---------------------------------------- |
     *    | 0x01     | A device was added to White List.        |
     *    | 0x02     | A device was deleted from White List.    |
     *    | 0x03     | White List was cleared.                  |
     */
    uint8_t op_code;

    /**
     *  @brief     The number or devices which have been added to or deleted from White List.
     */
    uint8_t num;
} st_ble_gap_white_list_conf_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gap_rslv_list_conf_evt_t
 *  @brief  This structure notifies that Resolving List has been configured.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief     The operation for Resolving List.
     *  @details
     *    |  value   |   description                                |
     *    |:---------|:-------------------------------------------- |
     *    | 0x01     | A device was added to Resolving List.        |
     *    | 0x02     | A device was deleted from Resolving List.    |
     *    | 0x03     | Resolving List was cleared.                  |
     */
    uint8_t op_code;

    /**
     *  @brief     The number or devices which have been added to or deleted from Resolving List.
     */
    uint8_t num;
} st_ble_gap_rslv_list_conf_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gap_perd_list_conf_evt_t
 *  @brief  This structure notifies that Periodic Advertiser List has been configured.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief     The operation for Periodic Advertiser List.
     *  @details
     *    |  value   |   description                                          |
     *    |:---------|:------------------------------------------------------ |
     *    | 0x01     | A device was added to Periodic Advertiser List.        |
     *    | 0x02     | A device was deleted from Periodic Advertiser List.    |
     *    | 0x03     | Periodic Advertiser List was cleared.                  |
     */
    uint8_t op_code;

    /**
     *  @brief     The number or devices which have been added to or deleted from Periodic Advertiser List.
     */
    uint8_t num;
} st_ble_gap_perd_list_conf_evt_t;

