fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
/* Event Code : BLE_GAP_EVENT_PRIV_MODE_SET_COMP   : st_ble_gap_set_priv_mode_evt_t  */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_set_priv_mode_evt_t
 *  @brief  This structure notifies that Privacy Mode has been configured.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief     The number or devices which have been set privacy mode.
     */
    uint8_t num;
} st_ble_gap_set_priv_mode_evt_t;

/* Event Code : BLE_GAP_EVENT_PAIRING_REQ   : st_ble_gap_pairing_req_evt_t  */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_pairing_req_evt_t
 *  @brief  This structure notifies that a pairing request from a remote device has been received.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief     Connection handle identifying the remote device that sent the pairing request.
     */
    uint16_t conn_hdl;

    /**
     *  @brief     The address of the remote device.
     */
    st_ble_dev_addr_t bd_addr;

    /**
     *  @brief     The Pairing parameters of the remote device.
     */
    st_ble_gap_auth_info_t auth_info;
} st_ble_gap_pairing_req_evt_t;

/* Event Code : BLE_GAP_EVENT_PASSKEY_ENTRY_REQ   : st_ble_gap_conn_hdl_evt_t  */

/* Event Code : BLE_GAP_EVENT_PASSKEY_DISPLAY_REQ   : st_ble_gap_passkey_display_evt_t  */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_passkey_display_evt_t
 *  @brief  This structure notifies that a request for Passkey display in pairing has been received.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief     Connection handle identifying the remote device that requested Passkey display.
     */
    uint16_t conn_hdl;

    /**
     *  @brief     Passkey.
     *  @details   This field is a 6 digit decimal number(000000-999999).
     */
    uint32_t passkey;
} st_ble_gap_passkey_display_evt_t;

/* Event Code : BLE_GAP_EVENT_NUM_COMP_REQ   : st_ble_gap_num_comp_evt_t  */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_num_comp_evt_t
 *  @brief  This structure notifies that a request for Numeric Comparison in pairing has been received.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief     Connection handle identifying the remote device that requested Numeric Comparison.
     */
    uint16_t conn_hdl;

    /**
     *  @brief     The number to be confirmed in Numeric Comparison.
     *  @details   This field is a 6 digit decimal number(000000-999999).
     */
    uint32_t numeric;
} st_ble_gap_num_comp_evt_t;

/* Event Code : BLE_GAP_EVENT_KEY_PRESS_NTF     : st_ble_gap_key_press_ntf_evt_t  */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_key_press_ntf_evt_t
 *  @brief  This structure notifies that the remote device has input a key in Passkey Entry
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief     Connection handle identifying the remote device that input a key.
     */
    uint16_t conn_hdl;

    /**
     *  @brief     Type of the key that the remote device input.
     *  @details
     *    |  value   |   description                 |
     *    |:---------|:----------------------------- |
     *    | 0x00     | Passkey entry started.        |
     *    | 0x01     | Passkey digit entered.        |
     *    | 0x02     | Passkey digit erased.         |
     *    | 0x03     | Passkey cleared.              |
     *    | 0x04     | Passkey entry completed.      |
     */
    uint8_t key_type;
} st_ble_gap_key_press_ntf_evt_t;

/* Event Code : BLE_GAP_EVENT_PAIRING_COMP   : st_ble_gap_pairing_info_evt_t  */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_pairing_info_evt_t
 *  @brief  This structure notifies that the pairing has completed.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief     Connection handle identifying the remote device that the pairing has been done with.
     */
    uint16_t conn_hdl;

    /**
     *  @brief     Address of the remote device.
     */
    st_ble_dev_addr_t bd_addr;

    /**
     *  @brief     Key information exchanged in pairing.
     *  @details   If local device supports bonding, store the information in non-volatile memory
     *             in order to set it to host stack after power re-supply.
     */
    st_ble_gap_auth_info_t auth_info;
} st_ble_gap_pairing_info_evt_t;

/* Event Code : BLE_GAP_EVENT_ENC_CHG   : st_ble_gap_enc_chg_evt_t  */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_enc_chg_evt_t
 *  @brief  This structure notifies that the encryption status of a link has been changed.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief     Connection handle identifying the link that has been changed.
     */
    uint16_t conn_hdl;

    /**
     *  @brief     Encryption Status.
     *  @details
     *    |  value   |   description                                            |
     *    |:---------|:-------------------------------------------------------- |
     *    | 0x00     | Encryption OFF.                                          |
     *    | 0x01     | Encryption ON.                                           |
     *    | 0x03     | Encryption updated by Encryption Key Refresh Completed.  |
     */
    uint8_t enc_status;
} st_ble_gap_enc_chg_evt_t;

/* Event Code : BLE_GAP_EVENT_PEER_KEY_INFO   : st_ble_gap_peer_key_info_evt_t  */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_peer_key_info_evt_t
 *  @brief  This structure notifies that the remote device has distributed the keys.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief     Connection handle identifying the remote device that has distributed the keys.
     */
    uint16_t conn_hdl;

    /**
     *  @brief     Address of the remote device.
     */
    st_ble_dev_addr_t bd_addr;

    /**
     *  @brief     Distributed keys.
     *  @details
     *  If local device supports bonding, store the keys in non-volatile memory and
     *  at power re-supply set to the host stack by R_BLE_GAP_SetBondInfo().
     */
    st_ble_gap_key_ex_param_t key_ex_param;
} st_ble_gap_peer_key_info_evt_t;

/* Event Code : BLE_GAP_EVENT_EX_KEY_REQ   : st_ble_gap_conn_hdl_evt_t  */

/* Event Code : BLE_GAP_EVENT_LTK_REQ      : st_ble_gap_ltk_req_evt_t  */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_ltk_req_evt_t
 *  @brief  This structure notifies that a LTK request from a remote device has been received.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief     Connection handle identifying the remote device which requests for the LTK.
     */
    uint16_t conn_hdl;

    /**
     *  @brief     Ediv.
     */
    uint16_t ediv;

    /**
     *  @brief     Rand.
     */
    uint8_t * p_peer_rand;
} st_ble_gap_ltk_req_evt_t;

