fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
/* Event Code : BLE_GAP_EVENT_LTK_RSP_COMP      : st_ble_gap_ltk_req_evt_t  */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_ltk_rsp_evt_t
 *  @brief  This structure notifies that local device has replied to the LTK request from the remote device.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief     Connection handle identifying the remote device to be sent the response to the LTK request.
     */
    uint16_t conn_hdl;

    /**
     *  @brief     The response to the LTK request.
     *  @details
     *    |  value   |   description                                                           |
     *    |:---------|:----------------------------------------------------------------------- |
     *    | 0x00     | Local device replied with the stored LTK.                               |
     *    | 0x01     | Local device rejected the LTK request, because the LTK was not found.   |
     */
    uint8_t response;
} st_ble_gap_ltk_rsp_evt_t;

/* Event Code : BLE_GAP_EVENT_SC_OOB_CREATE_COMP      : st_ble_gap_sc_oob_data_evt_t  */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_sc_oob_data_evt_t
 *  @brief  This structure notifies that OOB data for Secure Connections has been generated 
 *  by R_BLE_GAP_CreateScOobData().
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief Confirmation value(16 bytes) of OOB Data.
     */
    uint8_t * p_sc_oob_conf;

    /**
     *  @brief Rand(16bytes) of OOB Data.
     */
    uint8_t * p_sc_oob_rand;
} st_ble_gap_sc_oob_data_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gap_bond_info_t
 *  @brief  Bonding information used in R_BLE_GAP_SetBondInfo().
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief Address of the device which exchanged the keys.
     */
    st_ble_dev_addr_t * p_addr;

    /**
     *  @brief Information about the keys.
     */
    st_ble_gap_auth_info_t * p_auth_info;

    /**
     *  @brief Keys distributed from the remote device in paring.
     */
    st_ble_gap_key_ex_param_t * p_keys;
} st_ble_gap_bond_info_t;

/******************************************************************************************************************//**
 *  @struct st_cte_iq_sample_t
 *  @brief  CTE IQ sample data
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    uint8_t chan_idx;
    int16_t rssi;
    uint8_t rssi_ant_id;
    uint8_t cte_type;
    uint8_t slot_durations;
    uint8_t packet_status;
    uint8_t sample_count;
    struct
    {
        int8_t i;
        int8_t q;
    } * p_iq;
} st_cte_iq_sample_t;

/* Event Code : BLE_GAP_EVENT_CTE_CONNLESS_REPT */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_cte_connless_rept_t
 *  @brief  connectionless CTE data report
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    uint16_t           sync_hdl;
    uint16_t           evt_counter;
    st_cte_iq_sample_t sample;
} st_ble_gap_cte_connless_rept_t;

/* Event Code : BLE_GAP_EVENT_CTE_CONN_REPT */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_cte_conn_rept_t
 *  @brief  connection CTE data report
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    uint16_t           conn_hdl;
    uint8_t            rx_phy;
    uint16_t           evt_counter;
    st_cte_iq_sample_t sample;
} st_ble_gap_cte_conn_rept_t;

/* Event Code : BLE_GAP_EVENT_SUBRATE_CHANGE */

/******************************************************************************************************************//**
 *  @struct  st_ble_subrate_upd_t
 *  @brief  subrating update event
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    uint16_t conn_hdl;
    uint16_t subrate_factor;
    uint16_t peripheral_latency;
    uint16_t continuation_number;
    uint16_t supervision_timeout;
} st_ble_subrate_upd_t;

/* Event Code : BLE_GAP_EVENT_PAST_RECV : st_ble_gap_past_est_evt_t */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_past_est_evt_t
 *  @brief  This structure notifies that
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /** Periodic Advertising Sync Transfer options */
    uint16_t conn_hdl;
    uint16_t service_data;
    st_ble_gap_sync_est_evt_t sync;
} st_ble_gap_past_est_evt_t;

/* Event Code : BLE_GAP_EVENT_TX_POWER_REPT: st_ble_gap_tx_power_reporting_evt_t */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_tx_power_reporting_evt_t
 *  @brief  This structure notifies that
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    uint16_t conn_hdl;
    uint8_t  reason;
    uint8_t  phy;
    uint8_t  tx_power_level;
    uint8_t  tx_power_level_flag;
    uint8_t  delta;
} st_ble_gap_tx_power_reporting_evt_t;

/* Event Code : BLE_GAP_EVENT_PATH_LOSS_THR: st_ble_gap_pass_loss_thr_evt_t */

/******************************************************************************************************************//**
 *  @struct  st_ble_gap_pass_loss_thr_evt_t
 *  @brief  This structure notifies that a path loss report has been received.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    uint16_t conn_hdl;
    uint8_t  current_path_loss;
    uint8_t  zone_entered;
} st_ble_gap_pass_loss_thr_evt_t;

/* Event Code : BLE_GAP_EVENT_REQ_PEER_SCA_COMP: st_ble_gap_req_peer_sca_evt_t */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_req_peer_sca_evt_t
 *  @brief  This structure notifies that a SCA request to a remote device has been completed.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    uint16_t conn_hdl;
    uint8_t  sca;
} st_ble_gap_req_peer_sca_evt_t;

/* Event Code : BLE_GAP_EVENT_DTM_TEST_END_COMP: st_ble_gap_dtm_test_end_evt_t */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_dtm_test_end_evt_t
 *  @brief  report of dtm transmit/receive test end
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     * @brief the number of received packets
     */
    uint16_t recv_cnt;
} st_ble_gap_dtm_test_end_evt_t;

/* Event Code : BLE_GAP_EVENT_ENHANCED_READ_TX_POWER_LEVEL_COMP: st_ble_gap_enhanced_read_tx_power_level_evt_t */

/******************************************************************************************************************//**
 *  @struct st_ble_gap_enhanced_read_tx_power_level_evt_t
 *  @brief  Power level report of remove device.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     * @brief Indicate an ACL connection
     */
    uint16_t handle;

    /**
     * @brief PHY
     */
    uint8_t phy;

    /**
     * @brief Current transmit power level
     */
    int8_t crt_tx_power_level;

    /**
     * @brief Maximum transmit power level
     */
    int8_t max_tx_power_level;
} st_ble_gap_enhanced_read_tx_power_level_evt_t;

/*@}*/

/* ============================================== ISO Type Definitions ============================================= */
/** @addtogroup ISO_API
 *  @ingroup BLE_API
 *  @{
 */

/******************************************************************************************************************//**
 *  @struct st_ble_iso_big_param_t
 *  @brief big param
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /** @brief Number channels
     *
     *  Maximum number of channels in a single group is
     *  BLE_ISO_MAX_GROUP_ISO_COUNT
     */
    uint8_t num_bis;

    /** @brief Channel interval in us.
     *
     *  Value range BT_ISO_SDU_INTERVAL_MIN - BT_ISO_SDU_INTERVAL_MAX.
     */
    uint32_t sdu_intv;

