fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
    /** @brief Maximum size of an SDU
     *
     *  Value range 0x0001 to 0x0FFF
     */
    uint16_t max_sdu;

    /** @brief Channel Latency in ms.
     *
     *  Value range 0x0005 to 0x0FA0
     */
    uint16_t max_latency;

    /** @brief The number of times that every BIS Data PDU should be retransmitted.
     *
     *  Value range 0x00 to 0x1E
     */
    uint8_t rtn;

    /**
     *  @brief      Advertising PHY.
     *  @details
     *    |  value     |   description                |
     *    |:-----------|:---------------------------- |
     *    | 0x01       | Advertiser PHY is 1M PHY.    |
     *    | 0x02       | Advertiser PHY is 2M PHY.    |
     *    | 0x03       | Advertiser PHY is Coded PHY. |
     */
    uint8_t phy;

    /** @brief Channel packing mode.
     *
     *  the preferred method of arranging subevents of multiple BISes.
     *  BLE_ISO_PACKING_SEQUENTIAL for Sequential or
     *  BLE_ISO_PACKING_INTERLEAVED for Interleaved
     */
    uint8_t packing;

    /** @brief Channel framing mode.
     *
     * the format of the BIS Data PDUs.
     * BLE_ISO_FRAMING_UNFRAMED for unframed or
     * BLE_ISO_FRAMING_FRAMED for framed.
     */
    uint8_t framing;

    /** Whether or not to encrypt the streams. */
    uint8_t encryption;

    /** @brief Broadcast code
     *
     *  The code used to derive the session key that is used to encrypt and
     *  decrypt BIS payloads.
     */
    uint8_t bcode[BLE_ISO_BROADCAST_CODE_SIZE];
} st_ble_iso_big_param_t;

/******************************************************************************************************************//**
 *  @struct st_ble_iso_big_sync_param_t
 *  @brief big sync param
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /** @brief Number channels in @p bis_bitfield
     *
     *  Maximum number of channels in a single group is
     *  BLE_ISO_MAX_GROUP_ISO_COUNT
     */
    uint8_t num_bis;

    /** Bitfield of the BISes to sync to
     *
     *  The BIS indexes start from 0x01, so the lowest allowed bit is
     *  bit0 that represents index 0x01. To synchronize to e.g. BIS
     *  indexes bit1 and bit2, the bitfield value should be bit0 | bit1.
     */
    uint32_t bis_bitfield;

    /** maximum number of subevents that a Controller should use to
     *  receive data payloads in each interval for a BIS.
     *  @ref BLE_ISO_SYNC_MSE_AUTO to let controller choose.
     */
    uint8_t max_subevents;

    /* Value range is 0x000A to 0x4000.
     */
    uint16_t sync_timeout;

    /** Whether or not to encrypt the streams. */
    uint8_t encryption;

    /** @brief Broadcast code
     *
     *  The code used to derive the session key that is used to encrypt and
     *  decrypt BIS payloads.
     */
    uint8_t bcode[BLE_ISO_BROADCAST_CODE_SIZE];
} st_ble_iso_big_sync_param_t;

/******************************************************************************************************************//**
 *  @struct st_ble_cis_qos
 *  @brief  CIS channel QoS
 *********************************************************************************************************************/
typedef struct  BLE_PACKED_OPTION
{
    /**
     *  @brief max sdu size of input and output
     */
    uint16_t max_sdu_c2p;
    uint16_t max_sdu_p2c;

    /**
     *  @brief number of times that a CIS Data PDU should be retransmitted.
     */
    uint8_t rtn_c2p;
    uint8_t rtn_p2c;

    /**
     *  @brief Transmitter PHY preference.
     *  @details The phy_c2p and phy_p2c field is set to a bitwise OR of the following values.
     *          All other values are ignored.
     *               |              macro                    |   description                      |
     *               |:------------------------------------- |:---------------------------------- |
     *               | BLE_GAP_SET_PHYS_HOST_PREF_1M(0x01)   | Use 1M PHY for Transmitter PHY.    |
     *               | BLE_GAP_SET_PHYS_HOST_PREF_2M(0x02)   | Use 2M PHY for Transmitter PHY.    |
     *               | BLE_GAP_SET_PHYS_HOST_PREF_CD(0x04)   | Use Coded PHY for Transmitter PHY. |
     */
    uint8_t phy_c2p;
    uint8_t phy_p2c;
} st_ble_cis_qos;

/******************************************************************************************************************//**
 *  @struct st_ble_iso_cig_param_t
 *  @brief  CIG group param
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /** @brief Number channels of CIG.
     *  @details Maximum number of channels in a single group is
     *  BLE_ISO_MAX_GROUP_ISO_COUNT
     */
    uint8_t num_cis;

    /** @brief Center to Peripheral Channel interval in us.
     */
    uint32_t sdu_intv_c2p;

    /** @brief Peripheral to Center Channel interval in us.
     */
    uint32_t sdu_intv_p2c;

    /** @brief Center to Peripheral Channel Latency in ms.
     *  @details Value range 0x0005 - 0x0FA0
     */
    uint16_t max_latency_c2p;

    /** @brief Peripheral to CenterCenter to Peripheral Channel Latency in ms.
     *  @details Value range 0x0005 - 0x0FA0
     */
    uint16_t max_latency_p2c;

    /** @brief Channel packing mode.
     *  @details The preferred method of arranging subevents of multiple CISes.
     *          @ref BLE_ISO_PACKING_SEQUENTIAL for Sequential or
     *          @ref BLE_ISO_PACKING_INTERLEAVED for Interleaved
     */
    uint8_t packing;

    /** @brief Channel framing mode.
     * @details The format of the CIS Data PDUs.
     *          @ref BLE_ISO_FRAMING_UNFRAMED for unframed or
     *          @ref BLE_ISO_FRAMING_FRAMED for framed.
     */
    uint8_t framing;

    /** @brief qos param. */
    st_ble_cis_qos cis_qos[BLE_ISO_MAX_GROUP_ISO_COUNT];
} st_ble_iso_cig_param_t;

/******************************************************************************************************************//**
 *  @struct st_ble_iso_cis_conn_t
 *  @brief  CIS stream param
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /** @brief CIG id of this group */
    uint8_t cig_id;

    /** @brief Number channels of CIG.
     *  @details Maximum number of channels in a single group is
     *           BLE_ISO_MAX_GROUP_ISO_COUNT
     */
    uint8_t num_cis;

    /** @brief handles for every CIS.
     *  @details CIS handles are got from event BLE_ISO_EVENT_CIG_PARAM_SET_COMP.
     */
    uint16_t cis_hdl[BLE_ISO_MAX_GROUP_ISO_COUNT];

