fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
    /** @brief handles of ACL for every CIS.
     */
    uint16_t acl_hdl[BLE_ISO_MAX_GROUP_ISO_COUNT];
} st_ble_iso_cis_conn_t;

/******************************************************************************************************************//**
 *  @struct st_ble_iso_chan_path
 *  @brief  ISO channel path param
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     * @brief path direction.
     * @details Select value from BLE_ISO_DATAPATH_DIR_INPUT or BLE_ISO_DATAPATH_DIR_OUTPUT
     */
    uint8_t path_dir;

    /**
     * @brief path ID
     * @details Only @ref BLE_ISO_DATA_PATH_HCI is accepted.
     */
    uint8_t path_id;

    /**
     * @brief Coding Format
     * @details Refer Bluetooth SIG Assigned Number(https://www.bluetooth.com/specifications/assigned-numbers).
     */
    uint8_t coding_format;

    /**
     * @brief Company ID
     */
    uint16_t company_id;

    /**
     * @brief  Vendor-defined Codec ID
     * @details Shall be ignored if coding_format is not 0xFF
     */
    uint16_t vcodec_id;

    /**
     * @brief Controller Delay
     */
    uint32_t delay;

    /**
     * @brief Codec Configuration length. Reserved for future use.
     */
    uint8_t codec_conf_len;

    /**
     * @brief Pointer to an array containing the Codec Configuration. Reserved for future use.
     */
    uint8_t * p_codec_conf;
} st_ble_iso_chan_path;

/**
 * @brief SDU data structure in SDU input/output flow.
 * @details Event Code : BLE_ISO_EVENT_ISO_RX_DATA_IND.
 *  Also the param of R_BLE_ISO_SendData and R_BLE_ISO_SendDataNoCopy.
 */

/******************************************************************************************************************//**
 *  @struct st_ble_iso_sdu_t
 *  @brief  ISO SDU structure
 *********************************************************************************************************************/
typedef struct  BLE_PACKED_OPTION
{
    /**
     *  @brief     Identifier of the logical channel.
     *             Should use BIS or CIS handle for this field.
     */
    uint16_t conn_hdl;

    /**
     *  @brief     if 0 then timestamp value is invalid.
     */
    uint16_t ts_valid;

    /**
     *  @brief     timestamp of SDU. Valid when ts_valid is not 0.
     */
    uint32_t timestamp;

    /**
     *  @brief     sequence number
     */
    uint16_t seq_num;

    /**
     *  @brief     Length of SDU.
     */
    uint16_t sdu_len;

    /**
     *  @brief     SDU data.
     */
    uint8_t * p_sdu_data;
} st_ble_iso_sdu_t;

/******************************************************************************************************************//**
 *  @struct st_ble_iso_bis_qos_t
 *  @brief  BIS channel QoS data.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     * @brief Maximum number of subevents in each isochronous event
     */
    uint8_t nse;

    /**
     * @brief The number of new payloads in each BIS event
     */
    uint8_t bn;

    /**
     * @brief Offset used for pre-transmissions
     */
    uint8_t pto;

    /**
     * @brief The number of times a payload is transmitted in a BIS event
     **/
    uint8_t irc;

    /**
     * @brief Maximum size, in octets, of the payload
     */
    uint16_t max_pdu;

    /**
     * @brief The interval, in microseconds, of periodic SDUs
     */
    uint16_t iso_interval;
} st_ble_iso_bis_qos_t;

/******************************************************************************************************************//**
 *  @struct st_ble_iso_create_big_test_param_t
 *  @brief  This is the parameters used in R_BLE_ISO_CreateBigTest().
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief Total number of BISes in the BIG.
     */
    uint8_t num_bis;

    /**
     *  @brief The interval, in microseconds, of periodic SDUs.
     */
    uint8_t sdu_interval[3];

    /**
     *  @brief The time between consecutive BIG anchor points.
     */
    uint16_t iso_interval;

    /**
     *  @brief The total number of subevents in each interval of each BIS in the BIG.
     */
    uint8_t nse;

    /**
     *  @brief Maximum size, in octets, of an SDU.
     */
    uint16_t max_sdu;

    /**
     *  @brief Maximum size, in octets, of payload.
     */
    uint16_t max_pdu;

    /**
     *  @brief The transmitter PHY of packets.
     */
    uint8_t phy;

    /**
     *  @brief The preferred method of arranging subevents of multiple BISes.
     */
    uint8_t packing;

    /**
     *  @brief The format for sending BIS Data PDUs.
     */
    uint8_t framing;

    /**
     *  @brief Number of new payloads for each BIS in a BIS event.
     */
    uint8_t bn;

    /**
     *  @brief Number of times the scheduled data packet is transmitted.
     */
    uint8_t irc;

    /**
     *  @brief Offset in number of ISO_Intervals for pre transmissions of data packets.
     */
    uint8_t pto;

    /**
     *  @brief Encryption mode of the BISes in the BIG.
     */
    uint8_t encryption;

    /**
     *  @brief Used to generate the session key to encrypt payloads of all BISes in the BIG.
     */
    uint8_t bcode[BLE_ISO_BROADCAST_CODE_SIZE];
} st_ble_iso_create_big_test_param_t;

/******************************************************************************************************************//**
 *  @struct st_ble_cis_qos_test_t
 *  @brief  CIS channel QoS. This is the member variables of st_ble_iso_set_cig_param_test_param_t.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief Used to identify the CIS.
     */
    uint8_t cis_id;

    /**
     *  @brief Maximum number of subevents for each CIS in a CIG event.
     */
    uint8_t nse;

    /**
     *  @brief Maximum size, in octets, of the payload from the Central Host.
     */
    uint16_t c_sdu;

    /**
     *  @brief Maximum size, in octets, of the payload from the Peripheral Host.
     */
    uint16_t p_sdu;

    /**
     *  @brief Maximum size, in octets, of the payload from the Central Link Layer to the Peripheral Link Layer.
     */
    uint16_t c_pdu;

    /**
     *  @brief Maximum size, in octets, of the payload from the Peripheral Link Layer to the Central Link Layer.
     */
    uint16_t p_pdu;

    /**
     *  @brief The transmitter PHY of packets from the Central.
     */
    uint8_t c_phy;

    /**
     *  @brief The transmitter PHY of packets from the Peripheral.
     */
    uint8_t p_phy;

    /**
     *  @brief Burst number for Central to Peripheral.
     */
    uint8_t c_bn;

    /**
     *  @brief Burst number for Peripheral to Central.
     */
    uint8_t p_bn;
} st_ble_cis_qos_test_t;

/******************************************************************************************************************//**
 *  @struct st_ble_iso_set_cig_param_test_param_t
 *  @brief  Parameters used in R_BLE_ISO_SetCigParamTest().
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief Time interval of periodic SDUs from the Central Host.
     */
    uint8_t c_interval[3];

    /**
     *  @brief Time interval of periodic SDUs from the Peripheral Host.
     */
    uint8_t p_interval[3];

    /**
     *  @brief Maximum time for a payload from the Central to Peripheral to be transmitted and re-transmitted, 
     *  after which it is flushed.
     */
    uint8_t c_ft;

    /**
     *  @brief Maximum time for a payload from the Peripheral to Central to be transmitted and re-transmitted, 
     *  after which it is flushed.
     */
    uint8_t p_ft;

    /**
     *  @brief Time between two consecutive CIS anchor points.
     */
    uint16_t iso_interval;

    /**
     *  @brief Worst-case sleep clock accuracy of all the Peripherals that will participate in the CIG.
     */
    uint8_t sca;

    /**
     *  @brief Preferred method of arranging subevents of multiple CISes.
     */
    uint8_t packing;

    /**
     *  @brief Format of the CIS Data PDUs of all the CISes.
     */
    uint8_t framing;

    /**
     *  @brief Total number of CIS configurations in the CIG being added or modified.
     */
    uint8_t num_cis;

    /**
     *  @brief CIS QoS configurations.
     */
    st_ble_cis_qos_test_t cis[BLE_ISO_MAX_GROUP_ISO_COUNT];
} st_ble_iso_set_cig_param_test_param_t;

