fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
/* ============================================== ISO Event Parameters ============================================= */

/** Event Code : BLE_ISO_EVENT_CREATE_BIG_COMP
 *              BLE_ISO_EVENT_CREATE_BIG_SYNC_COMP: st_ble_iso_big_comp_evt_t
 */

/******************************************************************************************************************//**
 *  @struct st_ble_iso_big_comp_evt_t
 *  @brief  BIG info of a created BIG.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     * @brief status of BIG creation
     */
    uint8_t status;

    /**
     * @brief BIG handle
     */
    uint8_t big_hdl;

    /**
     * @brief BIG sync delay
     */
    uint32_t sync_delay;

    /**
     * @brief Actual latency returned by controller
     */
    uint32_t latency;

    /**
     * @brief PHY
     */
    uint8_t phy;

    /**
     * @brief qos parameters
     */
    st_ble_iso_bis_qos_t bis_qos;

    /**
     * @brief number of streams in the group
     */
    uint8_t num_bis;

    /**
     * @brief handles of all streams
     */
    uint16_t bis_hdl[BLE_ISO_MAX_GROUP_ISO_COUNT];
} st_ble_iso_big_comp_evt_t;

/* Event Code : BLE_ISO_EVENT_BIGINFO_REPT */

/******************************************************************************************************************//**
 *  @struct st_ble_iso_biginfo_rept_evt_t
 *  @brief  BIG info report in a periodic adv.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     * @brief Advertiser SID
     */
    uint8_t sid;

    /**
     * @brief Number of BISes in the BIG
     */
    uint8_t num_bis;

    /**
     * @brief Maximum number of subevents in each isochronous event
     */
    uint8_t sub_evt_count;

    /**
     * @brief Interval between two BIG anchor point (N * 1.25 ms)
     */
    uint16_t iso_interval;

    /**
     * @brief The number of new payloads in each BIS event
     */
    uint8_t burst_number;

    /**
     * @brief Offset used for pre-transmissions
     */
    uint8_t pto;

    /**
     * @brief The number of times a payload is transmitted in a BIS event
     */
    uint8_t rep_count;

    /**
     * @brief Maximum size, in octets, of the payload
     * */
    uint16_t max_pdu;

    /**
     * @brief The interval, in microseconds, of periodic SDUs.
     */
    uint32_t sdu_interval;

    /**
     * @brief Maximum size of an SDU, in octets.
     */
    uint16_t max_sdu;

    /**
     * @brief Channel PHY
     */
    uint8_t phy;

    /**
     * @brief Channel framing mode
     */
    uint8_t framing;

    /**
     * @brief Whether or not the BIG is encrypted
     */
    uint8_t encryption;
} st_ble_iso_biginfo_rept_evt_t;

/* Event Code : BLE_ISO_EVENT_CIG_PARAM_SET_COMP */

/******************************************************************************************************************//**
 *  @struct st_ble_iso_cig_set_evt_t
 *  @brief  CIS
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     * @brief number of CIG streams
     */
    uint8_t cig_id;

    /**
     * @brief number of CIS streams
     */
    uint8_t num_cis;

    /**
     * @brief cis_id over peers. Application should store cis_id for profile's usage
     */
    uint8_t cis_id[BLE_ISO_MAX_GROUP_ISO_COUNT];

    /**
     * @brief CIS conn handle
     */
    uint16_t cis_hdl[BLE_ISO_MAX_GROUP_ISO_COUNT];
} st_ble_iso_cig_set_evt_t;

/* Event Code : BLE_ISO_EVENT_CIS_REQ */

/******************************************************************************************************************//**
 *  @struct st_ble_iso_cis_req_evt_t
 *  @brief  CIS reqest from remote device.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     * @brief cig_id over peers. Application should check the request by cig_id and cis_id
     */
    uint8_t cig_id;

    /**
     * @brief cis_id over peers. Application should check the request by cig_id and cis_id
     */
    uint8_t cis_id;

    /**
     * @brief The ACL handle over which this cis is created.
     */
    uint16_t acl_hdl;
} st_ble_iso_cis_req_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_iso_cis_qos_t
 *  @brief  CIS channel QoS data.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     * @brief Maximum number of subevents in each isochronous event
     */
    uint8_t nse;

    /**
     * @brief The number of new payloads in each CIS event
     */
    uint8_t bn_c2p;
    uint8_t bn_p2c;

    /**
     * @brief The flush timeout, in multiples of the ISO_Interval for the CIS
     */
    uint8_t flush_to_c2p;
    uint8_t flush_to_p2c;

    /**
     * @brief Maximum size, in octets, of the payload
     */
    uint16_t max_pdu_c2p;
    uint16_t max_pdu_p2c;

    /**
     * @brief The time between two consecutive CIS anchor points
     */
    uint16_t iso_interval;
} st_ble_iso_cis_qos_t;

/* Event Code : BLE_ISO_EVENT_CIS_EST */

/******************************************************************************************************************//**
 *  @struct  st_ble_iso_cis_est_evt_t
 *  @brief  Information of CIS that was estabilished.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     * @brief CIS handler
     */
    uint16_t cis_hdl;

    /**
     * @brief CIG sync delay
     */
    uint32_t cig_sync_delay;

    /**
     * @brief CIS sync delay
     */
    uint32_t cis_sync_delay;

    /**
     * @brief latency of each direction
     */
    uint32_t latency_c2p;
    uint32_t latency_p2c;

    /**
     * @brief PHY of each direction
     */
    uint8_t phy_c2p;
    uint8_t phy_p2c;

    /**
     * @brief qos parameters
     */
    st_ble_iso_cis_qos_t cis_qos;
} st_ble_iso_cis_est_evt_t;

/* Event Code : BLE_ISO_EVENT_ISO_TX_COMP */

/******************************************************************************************************************//**
 *  @struct st_ble_iso_tx_comp_evt_t
 *  @brief  Information of ISO SDU that was sent.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /** connection handle of the ISO packet that was sent */
    uint16_t conn_hdl;

    /** sequence number of  ISO packet that was sent */
    uint32_t seq_num;
} st_ble_iso_tx_comp_evt_t;

/* Event Code : BLE_ISO_EVENT_READ_TEST_CNT_COMP: st_ble_iso_test_cnt_info_t */

/******************************************************************************************************************//**
 *  @struct  st_ble_iso_test_cnt_info_t
 *  @brief   ISO test count
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief Indicate an BIS or CIS.
     */
    uint16_t conn_hdl;

    /**
     *  @brief Number in the Received_SDU_Count.
     */
    uint32_t received_cnt;

    /**
     *  @brief Number in the Missed_SDU_Count.
     */
    uint32_t missed_cnt;

    /**
     *  @brief Number in the Failed_SDU_Count.
     */
    uint32_t failed_cnt;
} st_ble_iso_test_cnt_info_t;

/* Event Code : BLE_ISO_EVENT_TEST_ENDED: st_ble_iso_test_end_rept_t */

/******************************************************************************************************************//**
 *  @struct st_ble_iso_test_end_rept_t
 *  @brief  ISO test report
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief Indicate an BIS or CIS.
     */
    uint16_t conn_hdl;

    /**
     *  @brief Number in the Received_SDU_Count.
     */
    uint32_t received_cnt;

    /**
     *  @brief Number in the Missed_SDU_Count.
     */
    uint32_t missed_cnt;

    /**
     *  @brief Number in the Failed_SDU_Count.
     */
    uint32_t failed_cnt;
} st_ble_iso_test_end_rept_t;

/* Event Code : BLE_ISO_EVENT_READ_LINK_QUALITY_COMP: st_ble_iso_link_quality_info_t */

/******************************************************************************************************************//**
 *  @struct st_ble_iso_link_quality_info_t
 *  @brief  ISO link qulity information
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief Indicate an BIS or CIS.
     */
    uint16_t conn_hdl;

    /**
     *  @brief Value of the Tx_UnACKed_Packets counter.
     */
    uint32_t tx_unacked_packets;

    /**
     *  @brief Value of the Tx_Flushed_Packets counter.
     */
    uint32_t tx_flushed_packets;

    /**
     *  @brief Value of the Tx_Last_Subevent_Packets counter.
     */
    uint32_t tx_last_subevent_packets;

    /**
     *  @brief Value of the Retransmitted_Packets counter.
     */
    uint32_t retransmitted_packets;

    /**
     *  @brief Value of the CRC_Error_Packets counter.
     */
    uint32_t crc_error_packets;

    /**
     *  @brief Value of the Rx_Unreceived_Packets counter.
     */
    uint32_t rx_unreceived_packets;

    /**
     *  @brief Value of the Duplicate_Packets counter.
     */
    uint32_t duplicate_packets;
} st_ble_iso_link_quality_info_t;

/******************************************************************************************************************//**
 *  @struct st_ble_iso_tx_sync_info_t
 *  @brief  iso TX sync information
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /** Indicate an BIS or CIS. */
    uint16_t conn_hdl;

