fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
    /** CIG reference point or BIG anchor point of a transmitted SDU, in microseconds. */
    uint32_t ts;

    /** Time offset, in microseconds */
    uint32_t offset;

    /** Packet sequence number */
    uint16_t seq_num;
} st_ble_iso_tx_sync_info_t;

/* Event Code : BLE_ISO_EVENT_SYNC_TERM */
/* Event Code : BLE_ISO_EVENT_SYNC_LOST */

/******************************************************************************************************************//**
 *  @struct st_ble_iso_group_hdl_evt_t
 *  @brief  ISO gourp handle
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief     BIG handle or CIG id
     */
    uint8_t group_hdl;
} st_ble_iso_group_hdl_evt_t;

/*@}*/

/* ================================================= GAP Event Code ================================================ */

/** @addtogroup GAP_API
 *  @ingroup BLE_API
 *  @{
 */

/******************************************************************************************************************//**
 * @enum e_ble_gap_evt_t
 * @brief  GAP Event Identifier
 *********************************************************************************************************************/
typedef enum
{
    /**
     *  @brief  Invalid GAP Event.
     *
     * ## Event Code: 0x1001
     *
     *  ## Event Data:
     *  none
     */
    BLE_GAP_EVENT_INVALID = 0x1001,

    /* Range for Generic events - 0x01 to 0x0F */

    /**
     *  @brief  Host Stack has been initialized.
     *  @details
     *  When initializing host stack by R_BLE_GAP_Init() has been completed,
     *  BLE_GAP_EVENT_STACK_ON event is notified.
     *
     * ## Event Code: 0x1002
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_GAP_EVENT_STACK_ON,

    /**
     *  @brief  Host Stack has been terminated.
     *  @details
     *  When terminating host stack by R_BLE_GAP_Terminate() has been completed,
     *  BLE_GAP_EVENT_STACK_OFF event is notified.
     *
     * ## Event Code: 0x1003
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_STATE(0x0008)</td>
     *                  <td>When function was called, host stack has not yet been initialized.</td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_GAP_EVENT_STACK_OFF,

    /**
     *  @brief  Version information of local device.
     *  @details
     *  When version information of local device has been retrieved by R_BLE_GAP_GetVerInfo(),
     *  BLE_GAP_EVENT_LOC_VER_INFO event is notified.
     *
     * ## Event Code: 0x1004
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_loc_dev_info_evt_t
     */
    BLE_GAP_EVENT_LOC_VER_INFO,

    /**
     *  @brief  Hardware Error.
     *  @details
     *  When hardware error has been received from Controller, BLE_GAP_EVENT_HW_ERR event is notified.
     *
     * ## Event Code: 0x1005
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_hw_err_evt_t
     */
    BLE_GAP_EVENT_HW_ERR,

    /**
     *  @brief  Command Status Error.
     *  @details
     *  When the error of HCI Command has occurred after a R_BLE GAP API call, BLE_GAP_EVENT_CMD_ERR event is notified.
     *
     * ## Event Code: 0x1101
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_cmd_err_evt_t
     */
    BLE_GAP_EVENT_CMD_ERR = 0x1101,

    /**
     *  @brief  Advertising Report.
     *  @details
     *  When advertising PDUs has been received after scanning was started by R_BLE_GAP_StartScan().
     *
     * ## Event Code: 0x1102
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_adv_rept_evt_t
     */
    BLE_GAP_EVENT_ADV_REPT_IND,

    /**
     *  @brief  Advertising parameters have been set.
     *  @details
     *  Advertising parameters have been configured by R_BLE_GAP_SetAdvParam().
     *
     * ## Event Code: 0x1103
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_ARG(0x0003)</td>
     *                  <td>
     *                      The advertising type that doesn't support advertising data/scan response data was
     *                      specified to the advertising set which has already set
     *                      advertising data/scan response data.
     *                  </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_OPERATION(0x0009)</td>
     *                  <td>
     *                      The reason for this error is as follows.<BR/>
     *                      - Advertising parameters were configured to the advertising set in advertising.<BR/>
     *                      - The sec_adv_phy field in adv_paran was not specified
     *                        when Periodic Advertising was started.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_adv_set_evt_t
     */
    BLE_GAP_EVENT_ADV_PARAM_SET_COMP,

    /**
     *  @brief  Advertising data has been set.
     *  @details
     *  This event notifies that Advertising Data/Scan Response Data/Periodic Advertising Data has been
     *  set to the advertising set by R_BLE_GAP_SetAdvSresData().
     *
     * ## Event Code: 0x1104
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_OPERATION(0x0009)</td>
     *                  <td>
     *                      The reason for this error is as follows.<BR/>
     *                      - The advertising set that doesn't support advertising data/scan response data
     *                        was set to the data. <BR/>
     *                      - The advertising set that supports legacy advertising was set to
     *                        advertising data/scan response data larger than 31 bytes. <BR/>
     *                      - The advertising set that has advertising data/scan response data greater
     *                        than or equal to 252 bytes was set the data in advertising. <BR/>
     *                      - The advertising set that has periodic advertising data greater than or equal to
     *                        253 bytes was set the data in advertising.
     *                  </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_MEM_ALLOC_FAILED(0x000C)</td>
     *                  <td>
     *                      Length exceeded the length that the advertising set could be set.
     *                  </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_HDL(0x000E)</td>
     *                  <td>
     *                      The advertising set specified by R_BLE_GAP_SetAdvSresData() has not been created.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_adv_data_evt_t
     */
    BLE_GAP_EVENT_ADV_DATA_UPD_COMP,

    /**
     *  @brief   Advertising has started.
     *  @details
     *  When advertising has been started by R_BLE_GAP_StartAdv(), this event is notified to the application layer.
     *
     * ## Event Code: 0x1105
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_ARG(0x0003)</td>
     *                  <td>
     *                      The reason for this error is as follows.<BR/>
     *                      - The advertising data length set to the advertising set
     *                        for connectable extended advertising was invalid.<BR/>
     *                      - If o_addr_type field in adv_param used in R_BLE_GAP_SetAdvParam() is 0x03,
     *                        the address which is set in o_addr field of adv_param
     *                        has not been registered in Resolving List.
     *                  </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_OPERATION(0x0009)</td>
     *                  <td>Setting of advertising data/scan response data has not been completed.</td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_HDL(0x000E)</td>
     *                  <td>
     *                      The advertising set specified by R_BLE_GAP_StartAdv() has not been created.
     *                  </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_LIMIT_EXCEEDED(0x0010)</td>
     *                  <td>
     *                      When the maximum connections are established, a new connectable advertising tried starting.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_adv_set_evt_t
     */
    BLE_GAP_EVENT_ADV_ON,

    /**
     *  @brief   Advertising has stopped.
     *  @details
     *  This event notifies the application layer that advertising has stopped.
     *
     * ## Event Code: 0x1106
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_HDL(0x000E)</td>
     *                  <td>
     *                      The advertising set specified by R_BLE_GAP_StopAdv() has not been created.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_adv_off_evt_t
     */
    BLE_GAP_EVENT_ADV_OFF,

    /**
     *  @brief   Periodic advertising parameters have been set.
     *  @details
     *  This event notifies the application layer that Periodic Advertising Parameters
     *  has been configured by R_BLE_GAP_SetPerdAdvParam().
     *
     * ## Event Code: 0x1107
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_ARG(0x0003)</td>
     *                  <td>
     *                      The advertising set was the setting for anonymous advertising.
     *                  </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_OPERATION(0x0009)</td>
     *                  <td>
     *                      The advertising set was configured to the parameters in periodic advertising.
     *                  </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_HDL(0x000E)</td>
     *                  <td>
     *                      The advertising set specified by R_BLE_GAP_SetPerdAdvParam() has not been created.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_adv_set_evt_t
     */
    BLE_GAP_EVENT_PERD_ADV_PARAM_SET_COMP,

    /**
     *  @brief    Periodic advertising has started.
     *  @details
     *  When Periodic Advertising has been started by R_BLE_GAP_StartPerdAdv(),
     *  this event is notified to the application layer.
     *
     * ## Event Code: 0x1108
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_OPERATION(0x0009)</td>
     *                  <td>
     *                      The periodic advertising data set in the advertising set has not been completed.
     *                  </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_HDL(0x000E)</td>
     *                  <td>
     *                      The advertising set specified by R_BLE_GAP_StartPerdAdv() has not been created.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_adv_set_evt_t
     */
    BLE_GAP_EVENT_PERD_ADV_ON,

    /**
     *  @brief    Periodic advertising has stopped.
     *  @details
     *  When Periodic Advertising has terminated by R_BLE_GAP_StopPerdAdv(),
     *  this event is notified to the application layer.
     *
     * ## Event Code: 0x1109
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_HDL(0x000E)</td>
     *                  <td>
     *                      The advertising set specified by R_BLE_GAP_StopPerdAdv() has not been created.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_adv_set_evt_t
     */
    BLE_GAP_EVENT_PERD_ADV_OFF,

    /**
     *  @brief    Advertising set has been deleted.
     *  @details
     *  When the advertising set has been removed by R_BLE_GAP_RemoveAdvSet(),
     *  this event is notified to the application layer.
     *
     * ## Event Code: 0x110A
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_OPERATION(0x0009)</td>
     *                  <td>
     *                       When the advertising set was in advertising, R_BLE_GAP_RemoveAdvSet() was called.
     *                  </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_HDL(0x000E)</td>
     *                  <td>
     *                      The advertising set specified by R_BLE_GAP_RemoveAdvSet() has not been created.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_rem_adv_set_evt_t
     */
    BLE_GAP_EVENT_ADV_SET_REMOVE_COMP,

    /**
     *  @brief    Scanning has started.
     *  @details
     *  When scanning has started by R_BLE_GAP_StartScan(),
     *  this event is notified to the application layer.
     *
     * ## Event Code: 0x110B
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_ARG(0x0003)</td>
     *                  <td>
     *                      The reason for this error is as follows:<BR/>
     *                      - Scan interval or scan window was invalid.
     *                      - When filter_dup field in scan_enable was 
     *                        BLE_GAP_SCAN_FILT_DUPLIC_ENABLE_FOR_PERIOD(0x02),
     *                        period field in scan_enable was 0.
     *                      - duration field in scan_enable was larger than period in scan_enable.
     *                  </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_OPERATION(0x0009)</td>
     *                  <td>
     *                       In scanning, R_BLE_GAP_StartScan() was called.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_GAP_EVENT_SCAN_ON,

    /**
     *  @brief    Scanning has stopped.
     *  @details
     *  When scanning has been stopped by R_BLE_GAP_StopScan(), this event is notified to the application layer.
     *
     * ## Event Code: 0x110C
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_GAP_EVENT_SCAN_OFF,

    /**
     *  @brief    Scanning has stopped, because duration specified by API expired.
     *  @details
     *  When the scan duration specified by R_BLE_GAP_StartScan() has expired,
     *  this event notifies scanning has stopped.
     *
     * ## Event Code: 0x110D
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_GAP_EVENT_SCAN_TO,

    /**
     *  @brief    Connection Request has been sent to Controller.
     *  @details
     *  This event notifies a request for a connection has been sent to Controller.
     *
     * ## Event Code: 0x110E
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_ARG(0x0003)</td>
     *                  <td>
     *                      The reason for this error is as follows:<BR/>
     *                      - Scan interval or scan windows specified by R_BLE_GAP_CreateConn() is invalid.
     *                      - Although the own_addr_type field in p_param was set to 0x03,
     *                        random address had not been registered in Resolving List.
     *                  </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_OPERATION(0x0009)</td>
     *                  <td>
     *                       R_BLE_GAP_CreateConn() was called while creating a link
     *                       by previous R_BLE_GAP_CreateConn() call .
     *                  </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_LIMIT_EXCEEDED(0x0010)</td>
     *                  <td>
     *                       When the maximum connections are established, R_BLE_GAP_CreateConn() was called.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_GAP_EVENT_CREATE_CONN_COMP,

    /**
     *  @brief    Link has been established.
     *  @details
     *  This event notifies a link has been established.
     *
     * ## Event Code: 0x110F
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_HDL(0x000E)</td>
     *                  <td>
     *                       The request for a connection has been cancelled by R_BLE_GAP_CancelCreateConn().
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_conn_evt_t
     */
    BLE_GAP_EVENT_CONN_IND,

    /**
     *  @brief    Link has been disconnected.
     *  @details
     *  This event notifies a link has been disconnected.
     *
     * ## Event Code: 0x1110
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_disconn_evt_t
     */
    BLE_GAP_EVENT_DISCONN_IND,

