fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
    /**
     *  @brief    Connection Cancel Request has been sent to Controller.
     *  @details
     *  This event notifies the request for a connection has been cancelled by R_BLE_GAP_CancelCreateConn().
     *
     * ## Event Code: 0x1111
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_OPERATION(0x0009)</td>
     *                  <td>
     *                       When a request for a connection has not been sent to Controller,
     *                       R_BLE_GAP_CancelCreateConn() was called.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_GAP_EVENT_CONN_CANCEL_COMP,

    /**
     *  @brief    The White List has been configured.
     *  @details
     *  When White List has been configured, this event is notified to the application layer.
     *
     * ## Event Code: 0x1112
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_STATE(0x0008)</td>
     *                  <td>
     *                       The add or delete operation was called, before the previous clear 
     *                       operation has been completed.
     *                  </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_OPERATION(0x0009)</td>
     *                  <td>
     *                       While doing advertising or scanning or creating a link with the White List,
     *                       R_BLE_GAP_ConfWhiteList() was called.
     *                  </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_MEM_ALLOC_FAILED(0x000C)</td>
     *                  <td>
     *                       White List has already registered the maximum number of devices.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_white_list_conf_evt_t
     */
    BLE_GAP_EVENT_WHITE_LIST_CONF_COMP,

    /**
     *  @brief     Random address has been set to Controller.
     *  @details
     *  This event notifies Controller has been set the random address by R_BLE_GAP_SetRandAddr().
     *
     * ## Event Code: 0x1113
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_OPERATION(0x0009)</td>
     *                  <td>
     *                       When local device was in legacy advertising, R_BLE_GAP_SetRandAddr() was called.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_GAP_EVENT_RAND_ADDR_SET_COMP,

    /**
     *  @brief     Channel Map has been retrieved.
     *  @details
     *  This event notifies Channel Map has been retrieved by R_BLE_GAP_ReadChMap().
     *
     * ## Event Code: 0x1114
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_HDL(0x000E)</td>
     *                  <td>
     *                       The remote device specified by R_BLE_GAP_ReadChMap() was not found.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_rd_ch_map_evt_t
     */
    BLE_GAP_EVENT_CH_MAP_RD_COMP,

    /**
     *  @brief     Channel Map has set.
     *  @details
     *  This event notifies Channel Map has been configured by R_BLE_GAP_SetChMap().
     *
     * ## Event Code: 0x1115
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_ARG(0x0003)</td>
     *                  <td>
     *                       The channel map specified by R_BLE_GAP_SetChMap() was all-zero.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_GAP_EVENT_CH_MAP_SET_COMP,

    /**
     *  @brief     RSSl has been retrieved.
     *  @details
     *  This event notifies RSSI has been retrieved by R_BLE_GAP_ReadRssi().
     *
     * ## Event Code: 0x1116
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_HDL(0x000E)</td>
     *                  <td>
     *                       The remote device specified by R_BLE_GAP_ReadRssi() was not found.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_rd_rssi_evt_t
     */
    BLE_GAP_EVENT_RSSI_RD_COMP,

    /**
     *  @brief     Information about the remote device has been retrieved.
     *  @details
     *  This event notifies information about the remote device has been retrieved by R_BLE_GAP_GetRemDevInfo().
     *
     * ## Event Code: 0x1117
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_dev_info_evt_t
     */
    BLE_GAP_EVENT_GET_REM_DEV_INFO,

    /**
     *  @brief     Connection parameters has been configured.
     *  @details
     *  This event notifies the connection parameters has been updated.
     *
     * ## Event Code: 0x1118
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_DATA(0x0002)</td>
     *                  <td>
     *                       Local device rejected the request for updating connection parameters.
     *                  </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_ARG(0x0003)</td>
     *                  <td>
     *                       The remote device rejected the connection parameters suggested from local device.
     *                  </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_UNSUPPORTED(0x0007)</td>
     *                  <td>
     *                       The remote device doesn't support connection parameters update feature.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_conn_upd_evt_t
     */
    BLE_GAP_EVENT_CONN_PARAM_UPD_COMP,

    /**
     *  @brief     Local device has received the request for configuration of connection parameters.
     *  @details
     *  This event notifies the request for connection parameters update has been received.
     *
     * ## Event Code: 0x1119
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_conn_upd_req_evt_t
     */
    BLE_GAP_EVENT_CONN_PARAM_UPD_REQ,

    /**
     *  @brief     Authenticated Payload Timeout.
     *  @details
     *  This event notifies Authenticated Payload Timeout has occurred.
     *
     * ## Event Code: 0x111A
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_conn_hdl_evt_t
     */
    BLE_GAP_EVENT_AUTH_PL_TO_EXPIRED,

    /**
     *  @brief     The request for update transmission packet size and transmission time have been sent to Controller.
     *  @details
     *  This event notifies a request for updating packet data length and 
     *  transmission timer has been sent to Controller.
     *
     * ## Event Code: 0x111B
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_ARG(0x0003)</td>
     *                  <td>
     *                       The tx_octets or tx_time parameter specified by R_BLE_GAP_SetDataLen() is invalid.
     *                  </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_UNSUPPORTED(0x0007)</td>
     *                  <td>
     *                       The remote device does not support updating packet data length and transmission time.
     *                  </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_HDL(0x000E)</td>
     *                  <td>
     *                        When R_BLE_GAP_SetDataLen() was called, the connection was not established.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_conn_hdl_evt_t
     */
    BLE_GAP_EVENT_SET_DATA_LEN_COMP,

    /**
     *  @brief     Transmission packet size and transmission time have been changed.
     *  @details
     *  This event notifies packet data length and transmission time have been updated.
     *
     * ## Event Code: 0x111C
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_data_len_chg_evt_t
     */
    BLE_GAP_EVENT_DATA_LEN_CHG,

    /**
     *  @brief     The Resolving List has been configured.
     *  @details
     *  When Resolving List has been configured by R_BLE_GAP_ConfRslvList(),
     *  this event is notified to the application layer.
     *
     * ## Event Code: 0x111D
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_STATE(0x0008)</td>
     *                  <td>
     *                       The add or delete operation was called,
     *                       before the previous clear operation has been completed.
     *                  </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_OPERATION(0x0009)</td>
     *                  <td>
     *                       While doing advertising or scanning or creating a link with resolvable private address,
     *                       R_BLE_GAP_ConfRslvList() was called.
     *                  </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_MEM_ALLOC_FAILED(0x000C)</td>
     *                  <td>
     *                       Resolving List has already registered the maximum number of devices.
     *                  </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_HDL(0x000E)</td>
     *                  <td>
     *                       The specified Identity Address was not found in Resolving List.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_rslv_list_conf_evt_t
     */
    BLE_GAP_EVENT_RSLV_LIST_CONF_COMP,

    /**
     *  @brief     Resolvable private address function has been enabled or disabled.
     *  @details
     *  When Resolvable Private Address function in Controller has been enabled by R_BLE_GAP_EnableRpa(),
     *  this event is notified to the application layer.
     *
     * ## Event Code: 0x111E
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_OPERATION(0x0009)</td>
     *                  <td>
     *                      While advertising, scanning, or establishing a link with resolvable private address,
     *                      R_BLE_GAP_EnableRpa() was called.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_GAP_EVENT_RPA_EN_COMP,

    /**
     *  @brief      The update time of resolvable private address has been changed.
     *  @details
     *  When Resolvable Private Address Timeout in Controller has been updated by R_BLE_GAP_SetRpaTo(),
     *  this event is notified to the application layer.
     *
     * ## Event Code: 0x111F
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_ARG(0x0003)</td>
     *                  <td>
     *                      The rpa_timeout parameter specified by R_BLE_GAP_SetRpaTo() is out of range.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_GAP_EVENT_SET_RPA_TO_COMP,

    /**
     *  @brief      The resolvable private address of local device has been retrieved.
     *  @details
     *  When the resolvable private address of local device has been retrieved by R_BLE_GAP_ReadRpa(),
     *  this event is notified to the application layer.
     *
     * ## Event Code: 0x1120
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_HDL(0x000E)</td>
     *                  <td>
     *                      The identity address specified by R_BLE_GAP_ReadRpa() was not registered in Resolving List.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_rd_rpa_evt_t
     */
    BLE_GAP_EVENT_RD_RPA_COMP,

    /**
     *  @brief       PHY for connection has been changed.
     *  @details
     *  This event notifies the application layer that PHY for a connection has been updated.
     *
     * ## Event Code: 0x1121
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_phy_upd_evt_t
     */
    BLE_GAP_EVENT_PHY_UPD,

    /**
     *  @brief      The request for updating PHY for connection has been sent to Controller.
     *  @details
     *  When Controller has received a request for updating PHY for a connection by R_BLE_GAP_SetPhy(),
     *  this event is notified to the application layer.
     *
     * ## Event Code: 0x1122
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_HDL(0x000E)</td>
     *                  <td>
     *                      The remote device specified by R_BLE_GAP_SetPhy() was not found.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_conn_hdl_evt_t
     */
    BLE_GAP_EVENT_PHY_SET_COMP,

    /**
     *  @brief      The request for setting default PHY has been sent to Controller.
     *  @details
     *  When the PHY preferences which a remote device may change has been configured by R_BLE_GAP_SetDefPhy(),
     *  this event is notified to the application layer.
     *
     * ## Event Code: 0x1123
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_GAP_EVENT_DEF_PHY_SET_COMP,

    /**
     *  @brief      PHY configuration has been retrieved.
     *  @details
     *  When the PHY settings has been retrieved by R_BLE_GAP_ReadPhy(),
     *  this event is notified to the application layer.
     *
     * ## Event Code: 0x1124
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_HDL(0x000E)</td>
     *                  <td>
     *                      The link specified by R_BLE_GAP_ReadPhy() was not found.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_phy_rd_evt_t
     */
    BLE_GAP_EVENT_PHY_RD_COMP,

    /**
     *  @brief      Scan Request has been received.
     *  @details
     *  This event notifies the application layer that a Scan Request packet has been received from a Scanner.
     *
     * ## Event Code: 0x1125
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_scan_req_recv_evt_t
     */
    BLE_GAP_EVENT_SCAN_REQ_RECV,

    /**
     *  @brief      The request for establishing a periodic sync has been sent to Controller.
     *  @details
     *  This event notifies the application layer that Controller has received a request
     *  for a Periodic Sync establishment.
     *
     * ## Event Code: 0x1126
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_OPERATION(0x0009)</td>
     *                  <td>
     *                       When R_BLE_GAP_CreateSync() was called,
     *                       this event for previous the API call has not been received.
     *                  </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_ALREADY_IN_PROGRESS(0x000A)</td>
     *                  <td>
     *                      The advertising set specified by R_BLE_GAP_CreateSync() has already established
     *                      a periodic sync.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_GAP_EVENT_CREATE_SYNC_COMP,

    /**
     *  @brief      The periodic advertising sync has been established.
     *  @details
     *  This event notifies the application layer that a Periodic sync has been established.
     *
     * ## Event Code: 0x1127
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_NOT_YET_READY(0x0012)</td>
     *                  <td>
     *                      The request for a Periodic Sync establishment was cancelled by
     *                      R_BLE_GAP_CancelCreateSync().
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_sync_est_evt_t
     */
    BLE_GAP_EVENT_SYNC_EST,

