fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
    /**
     *  @brief       The periodic advertising sync has been terminated.
     *  @details
     *  This event notifies the application layer that the Periodic Sync has been terminated
     *  by R_BLE_GAP_TerminateSync().
     *
     * ## Event Code: 0x1128
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_OPERATION(0x0009)</td>
     *                  <td>
     *                       While establishing a Periodic Sync by R_BLE_GAP_CreateSync(),
     *                       R_BLE_GAP_TerminateSync() was called.
     *                  </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_HDL(0x000E)</td>
     *                  <td>
     *                       The sync handle specified by R_BLE_GAP_TerminateSync() was not found.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_sync_hdl_evt_t
     */
    BLE_GAP_EVENT_SYNC_TERM,

    /**
     *  @brief       The periodic advertising sync has been lost.
     *  @details
     *  This event notifies the application layer that the Periodic Sync has been lost.
     *
     * ## Event Code: 0x1129
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_sync_hdl_evt_t
     */
    BLE_GAP_EVENT_SYNC_LOST,

    /**
     *  @brief       The request for cancel of establishing a periodic advertising sync has been sent to Controller.
     *  @details
     *  This event notifies the request for a Periodic Sync establishment has been cancelled
     *  by R_BLE_GAP_CancelCreateSync().
     *
     * ## Event Code: 0x112A
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_OPERATION(0x0009)</td>
     *                  <td>
     *                       When R_BLE_GAP_CancelCreateSync() was called,
     *                       a request for a Periodic Sync establishment by R_BLE_GAP_CreateSync()
     *                       has not been sent to Controller.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_GAP_EVENT_SYNC_CREATE_CANCEL_COMP,

    /**
     *  @brief       The Periodic Advertiser list has been configured.
     *  @details
     *  When Periodic Advertiser List has been configured by R_BLE_GAP_ConfPerdAdvList(),
     *  this event is notified to the application layer.
     *
     * ## Event Code: 0x112B
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_ARG(0x0003)</td>
     *                  <td>
     *                        The advertiser has already been registered in Periodic Advertiser List.
     *                  </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_STATE(0x0008)</td>
     *                  <td>
     *                       The add or delete operation was called, before the previous clear 
     *                       operation has been completed.
     *                  </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_OPERATION(0x0009)</td>
     *                  <td>
     *                         When establishing a periodic sync by R_BLE_GAP_CreateSync(),
     *                         R_BLE_GAP_ConfPerdAdvList() was called.
     *                  </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_MEM_ALLOC_FAILED(0x000C)</td>
     *                  <td>
     *                         Periodic Advertiser List has already registered the maximum number of devices.
     *                  </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_HDL(0x000E)</td>
     *                  <td>
     *                         The device specified by R_BLE_GAP_ConfPerdAdvList() was not found.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_perd_list_conf_evt_t
     */
    BLE_GAP_EVENT_PERD_LIST_CONF_COMP,

    /**
     *  @brief       Privacy Mode has been configured.
     *  @details
     *  This event notifies the application layer that the Privacy Mode has been configured by R_BLE_GAP_SetPrivMode().
     *
     * ## Event Code: 0x112B
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_ARG(0x0003)</td>
     *                  <td>Address type or privacy mode is out of range.</td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_OPERATION(0x0009)</td>
     *                  <td>
     *                         While advertising, scanning, or establishing a link with resolvable private address,
     *                         R_BLE_GAP_SetPrivMode() was called.
     *                  </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_HDL(0x000E)</td>
     *                  <td>
     *                         The address specified by R_BLE_GAP_SetPrivMode() has not been registered
     *                         in Resolving List.
     *                  </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_GAP_EVENT_PRIV_MODE_SET_COMP,

    /**
     *  @brief       The pairing request from a remote device has been received.
     *  @details
     *  This event notifies the application layer that a pairing request from a remote device has been received.
     *
     * ## Event Code: 0x1401
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_pairing_info_evt_t
     */
    BLE_GAP_EVENT_PAIRING_REQ = 0x1401,

    /**
     *  @brief       The request for input passkey has been received.
     *  @details
     *  This event notifies that a request for Passkey input in pairing has been received.
     *
     * ## Event Code: 0x1402
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_conn_hdl_evt_t
     */
    BLE_GAP_EVENT_PASSKEY_ENTRY_REQ,

    /**
     *  @brief       The request for displaying a passkey has been received.
     *  @details
     *  This event notifies that a request for Passkey display in pairing has been received.
     *
     * ## Event Code: 0x1403
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_passkey_display_evt_t
     */
    BLE_GAP_EVENT_PASSKEY_DISPLAY_REQ,

    /**
     *  @brief     The request for confirmation with Numeric Comparison has received.
     *  @details
     *  This event notifies that a request for Numeric Comparison in pairing has been received.
     *
     * ## Event Code: 0x1404
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_num_comp_evt_t
     */
    BLE_GAP_EVENT_NUM_COMP_REQ,

    /**
     *  @brief     Key Notification from a remote device has been received.
     *  @details
     *  This event notifies the application layer that the remote device has input a key in Passkey Entry.
     *
     * ## Event Code: 0x1405
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_key_press_ntf_evt_t
     */
    BLE_GAP_EVENT_KEY_PRESS_NTF,

    /**
     *  @brief     Pairing has been completed.
     *  @details
     *  This event notifies the application layer that the pairing has completed.
     *
     * ## Event Code: 0x1406
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_SMP_LE_PASSKEY_ENTRY_FAIL(0x2001)</td>
     *                  <td>PassKey Entry is failed.</td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_SMP_LE_OOB_DATA_NOT_AVAILABLE(0x2002)</td>
     *                  <td>OOB Data is not available.</td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_SMP_LE_AUTH_REQ_NOT_MET(0x2003)</td>
     *                  <td>The requested pairing can not be performed because of IO Capability. </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_SMP_LE_CONFIRM_VAL_NOT_MATCH(0x2004)</td>
     *                  <td>Confirmation value does not match.</td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_SMP_LE_PAIRING_NOT_SPRT(0x2005)</td>
     *                  <td>Pairing is not supported.</td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_SMP_LE_INSUFFICIENT_ENC_KEY_SIZE(0x2006)</td>
     *                  <td>Encryption Key Size is insufficient.</td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_SMP_LE_CMD_NOT_SPRT(0x2007)</td>
     *                  <td>The pairing command received is not supported.</td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_SMP_LE_UNSPECIFIED_REASON(0x2008)</td>
     *                  <td>Pairing failed with an unspecified reason.</td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_SMP_LE_REPEATED_ATTEMPTS(0x2009)</td>
     *                  <td>The number of repetition exceeded the upper limit.</td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_SMP_LE_INVALID_PARAM(0x200A)</td>
     *                  <td>Invalid parameter is set.</td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_SMP_LE_DHKEY_CHECK_FAIL(0x200B)</td>
     *                  <td>DHKey Check error.</td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_SMP_LE_NUM_COMP_FAIL(0x200C)</td>
     *                  <td>Numeric Comparison failure.</td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_SMP_LE_DISCONNECTED(0x200F)</td>
     *                  <td>Disconnection in pairing.</td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_SMP_LE_TO(0x2011)</td>
     *                  <td> Failure due to timeout.</td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_SMP_LE_LOC_KEY_MISSING(0x2014)</td>
     *                  <td>Pairing/Encryption failure because local device lost the LTK.</td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_pairing_info_evt_t
     */
    BLE_GAP_EVENT_PAIRING_COMP,

    /**
     *  @brief     Key Notification from a remote device has been received.
     *  @details
     *  This event notifies the application layer that the encryption status of a link has been changed.
     *
     * ## Event Code: 0x1407
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_enc_chg_evt_t
     */
    BLE_GAP_EVENT_ENC_CHG,

    /**
     *  @brief     Keys has been received from a remote device.
     *  @details
     *  This event notifies the application layer that the remote device has distributed the keys.
     *
     * ## Event Code: 0x1408
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_peer_key_info_evt_t
     */
    BLE_GAP_EVENT_PEER_KEY_INFO,

    /**
     *  @brief     The request for key distribution has been received.
     *  @details
     *  When local device has been received a request for key distribution to remote device,
     *  this event is notified to the application layer.
     *
     * ## Event Code: 0x1409
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_conn_hdl_evt_t
     */
    BLE_GAP_EVENT_EX_KEY_REQ,

    /**
     *  @brief     LTK has been request from a remote device.
     *  @details
     *  When local device has been received a LTK request from a remote device,
     *  this event is notified to the application layer.
     *
     * ## Event Code: 0x140A
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_ltk_req_evt_t
     */
    BLE_GAP_EVENT_LTK_REQ,

    /**
     *  @brief     LTK reply has been sent to Controller.
     *  @details
     *  When local device has replied to the LTK request from the remote device,
     *  this event is notified to the application layer.
     *
     * ## Event Code: 0x140B
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_ltk_rsp_evt_t
     */
    BLE_GAP_EVENT_LTK_RSP_COMP,

    /**
     *  @brief     The authentication data to be used in Secure Connections OOB has been created.
     *  @details
     *  This event notifies OOB data for Secure Connections has been generated by R_BLE_GAP_CreateScOobData().
     *
     * ## Event Code: 0x140C
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_gap_sc_oob_data_evt_t
     */
    BLE_GAP_EVENT_SC_OOB_CREATE_COMP,

    /**
     * @brief An connectionless CTE IQ sample is reported.
     *
     * ## result
     * 0x0000   Response without CTE info
     * other    Rejected by remote peer
     *
     * ## Event Data:
     * None
     */
    BLE_GAP_EVENT_CTE_CONN_REQ_FAILED,

    /**
     * @brief An connectionless CTE IQ sample is reported.
     *
     * ## Event Data:
     *  st_ble_gap_cte_connless_rept_t
     */
    BLE_GAP_EVENT_CTE_CONNLESS_REPT,

    /**
     * @brief An connection CTE IQ sample is reported.
     *
     * ## Event Data:
     *  st_ble_gap_cte_conn_rept_t
     */
    BLE_GAP_EVENT_CTE_CONN_REPT,

    /**
     * @brief a Connection Subrate Update procedure has completed and
     * some parameters of the specified connection have changed.
     *
     * ## Event Data:
     *  st_ble_subrate_upd_t
     */
    BLE_GAP_EVENT_SUBRATE_CHANGE,

    /**
     *  @brief This event notifies that it has received periodic advertising synchronization
     *         information from the device referred to by the Connection_Handle parameter
     *  ## Event Data:
     *  st_ble_gap_past_est_evt_t
     */
    BLE_GAP_EVENT_PAST_RECV,

    /**
     *  @brief  Transmit power level report.
     *  @details
     *  This event is a report of the transmit power level on the ACL connection identified by the conn_hdl
     *
     *  ## Event Data:
     *  st_ble_gap_tx_power_reporting_evt_t
     */
    BLE_GAP_EVENT_TX_POWER_REPT,

    /**
     * @brief Report a path loss threshold crossing on
     * the ACL connection identified by the Connection_Handle parameter.
     *
     * ## Event Data:
     * st_ble_gap_pass_loss_thr_evt_t
     */
    BLE_GAP_EVENT_PATH_LOSS_THR,

    /**
     * @brief Indicates that the HCI_LE_Request_Peer_SCA command has been completed.
     * ## Event Data:
     * st_ble_gap_req_peer_sca_evt_t
     */
    BLE_GAP_EVENT_REQ_PEER_SCA_COMP,

    /**
     * @brief
     *
     * ## Event Data:
     * None
     */
    BLE_GAP_EVENT_CTE_SET_CONNLESS_PARAM_COMP,

    /**
     * @brief
     *
     * ## Event Data:
     * None
     */
    BLE_GAP_EVENT_CTE_CONNLESS_TX_ON,

    /**
     * @brief
     *
     * ## Event Data:
     * None
     */
    BLE_GAP_EVENT_CTE_CONNLESS_TX_OFF,

    /**
     * @brief
     *
     * ## Event Data:
     * st_ble_gap_sync_hdl_evt_t
     */
    BLE_GAP_EVENT_CTE_CONNLESS_RX_ON,

    /**
     * @brief
     *
     * ## Event Data:
     * st_ble_gap_sync_hdl_evt_t
     */
    BLE_GAP_EVENT_CTE_CONNLESS_RX_OFF,

    /**
     * @brief
     *
     * ## Event Data:
     * st_ble_gap_conn_hdl_evt_t
     */
    BLE_GAP_EVENT_CTE_SET_CONN_PARAM_COMP,

    /**
     * @brief
     *
     * ## Event Data:
     * st_ble_gap_conn_hdl_evt_t
     */
    BLE_GAP_EVENT_CTE_SET_CONN_RSP_ON,

    /**
     * @brief
     *
     * ## Event Data:
     * st_ble_gap_conn_hdl_evt_t
     */
    BLE_GAP_EVENT_CTE_SET_CONN_RSP_OFF,

    /**
     * @brief
     *
     * ## Event Data:
     * st_ble_gap_conn_hdl_evt_t
     */
    BLE_GAP_EVENT_CTE_SET_CONN_RECV_PARAM_COMP,

    /**
     * @brief
     *
     * ## Event Data:
     * st_ble_gap_conn_hdl_evt_t
     */
    BLE_GAP_EVENT_CTE_CONN_REQ_ON,

    /**
     * @brief
     *
     * ## Event Data:
     * st_ble_gap_conn_hdl_evt_t
     */
    BLE_GAP_EVENT_CTE_CONN_REQ_OFF,

    /**
     * @brief
     *
     * ## Event Data:
     * None
     */
    BLE_GAP_EVENT_SET_DEF_SUBRATE_COMP,

    /**
     * @brief
     *
     * ## Event Data:
     * None
     */
    BLE_GAP_EVENT_REQ_SUBRATE_COMP,

    /**
     * @brief
     *
     * ## Event Data:
     * st_ble_gap_conn_hdl_evt_t
     */
    BLE_GAP_EVENT_PAST_START_COMP,

    /**
     * @brief
     *
     * ## Event Data:
     * st_ble_gap_conn_hdl_evt_t
     */
    BLE_GAP_EVENT_PAST_SET_PARAM_COMP,

    /**
     * @brief
     *
     * ## Event Data:
     * st_ble_gap_conn_hdl_evt_t
     */
    BLE_GAP_EVENT_PAST_SET_DEF_PARAM_COMP,

    /**
     * @brief
     *
     * ## Event Data:
     * None
     */
    BLE_GAP_EVENT_UPD_SCA_COMP,

    /**
     * @brief
     *
     * ## Event Data:
     * None
     */
    BLE_GAP_EVENT_READ_REMOTE_TX_POWER_COMP,

    /**
     * @brief
     *
     * ## Event Data:
     * st_ble_gap_conn_hdl_evt_t
     */
    BLE_GAP_EVENT_SET_PATHLOSS_REPT_PARAM_COMP,

    /**
     * @brief
     *
     * ## Event Data:
     * st_ble_gap_conn_hdl_evt_t
     */
    BLE_GAP_EVENT_PATHLOSS_REPT_ON,

    /**
     * @brief
     *
     * ## Event Data:
     * st_ble_gap_conn_hdl_evt_t
     */
    BLE_GAP_EVENT_PATHLOSS_REPT_OFF,

    /**
     * @brief
     *
     * ## Event Data:
     * st_ble_gap_conn_hdl_evt_t
     */
    BLE_GAP_EVENT_LOCAL_TX_POWER_REPT_ON,

    /**
     * @brief
     *
     * ## Event Data:
     * st_ble_gap_conn_hdl_evt_t
     */
    BLE_GAP_EVENT_LOCAL_TX_POWER_REPT_OFF,

    /**
     * @brief
     *
     * ## Event Data:
     * st_ble_gap_conn_hdl_evt_t
     */
    BLE_GAP_EVENT_REMOTE_TX_POWER_REPT_ON,

    /**
     * @brief
     *
     * ## Event Data:
     * st_ble_gap_conn_hdl_evt_t
     */
    BLE_GAP_EVENT_REMOTE_TX_POWER_REPT_OFF,

    /**
     * @brief
     *
     * ## Event Data:
     * None
     */
    BLE_GAP_EVENT_SET_RPA_UPD_REASON_COMP,

    /**
     * @brief
     *
     * ## Event Data:
     * None
     */
    BLE_GAP_EVENT_DTM_RX_TEST_COMP,

    /**
     * @brief
     *
     * ## Event Data:
     * None
     */
    BLE_GAP_EVENT_DTM_TX_TEST_COMP,

    /**
     * @brief
     *
     * ## Event Data:
     * st_ble_gap_dtm_test_end_evt_t
     */
    BLE_GAP_EVENT_DTM_TEST_END_COMP,

    /**
     * @brief
     *
     * ## Event Data:
     * st_ble_gap_enhanced_read_tx_power_level_evt_t
     */
    BLE_GAP_EVENT_ENHANCED_READ_TX_POWER_LEVEL_COMP,

    /**
     * @brief
     *
     * ## Event Data:
     * None
     */
    BLE_GAP_EVENT_SET_HOST_FEAT_COMP,
} e_ble_gap_evt_t;

/*@}*/

