fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
/* ================================================= ISO Event Code ================================================ */

/** @addtogroup ISO_API
 *  @ingroup BLE_API
 *  @{
 */

/******************************************************************************************************************//**
 * @enum e_ble_iso_evt_t
 * @brief  ISO Event Identifier
 *********************************************************************************************************************/
typedef enum
{
    /**
     *  @brief     R_BLE_ISO_CreateBig() created a big successfully.
     *  @details
     *
     *  ## Event Data:
     *  st_ble_iso_big_comp_evt_t
     */
    BLE_ISO_EVENT_CREATE_BIG_COMP = 0x1500,

    /**
     *  @brief     Big Info is detected in a periodic adv data.
     *  @details
     *
     *  ## Event Data:
     *  st_ble_iso_biginfo_rept_evt_t
     */
    BLE_ISO_EVENT_BIGINFO_REPT,

    /**
     *  @brief   The sync-id specified by R_BLE_ISO_CreateBigSync() has already established
     *           a big sync.
     *  @details
     *
     *
     *  st_ble_iso_big_comp_evt_t
     * */
    BLE_ISO_EVENT_CREATE_BIG_SYNC_COMP,

    /**
     *  @brief     An ISO SDU is received.
     *  @details
     *
     *  ## Event Data:
     *  st_ble_iso_sdu_t
     */
    BLE_ISO_EVENT_ISO_RX_DATA_IND,

    /**
     *  @brief   An ISO SDU is sent.
     *  @details
     *
     *  ## Event Data:
     *  st_ble_iso_tx_comp_evt_t
     */
    BLE_ISO_EVENT_ISO_TX_COMP,

    /**
     * @brief This event notifies the application layer that the ISO sync has failed.
     *
     * ## Event Data:
     * st_ble_iso_group_hdl_evt_t
     */
    BLE_ISO_EVENT_SYNC_LOST,

    /**
     * @brief This event notifies the application layer that the BIG sync has been terminated
     *
     * ## Event Data:
     *  st_ble_iso_group_hdl_evt_t
     */
    BLE_ISO_EVENT_SYNC_TERM,

    /**
     * @brief The request for CIG setting parameter has been sent to Controller.
     *
     * ## Event Data:
     *  st_ble_iso_cig_set_evt_t
     */
    BLE_ISO_EVENT_CIG_PARAM_SET_COMP,

    /**
     * @brief The CIS request has been received from to remote device.
     *
     * ## Event Data:
     *  st_ble_iso_cis_req_evt_t
     */
    BLE_ISO_EVENT_CIS_REQ,

    /**
     * @brief An CIS connection is estabilished.
     *
     * ## Event Data:
     *  st_ble_iso_cis_est_evt_t
     */
    BLE_ISO_EVENT_CIS_EST,

    /**
     * @brief
     *
     * ## Event Data:
     * st_ble_gap_conn_hdl_evt_t
     */
    BLE_ISO_EVENT_SETUP_DATA_PATH_COMP,

    /**
     * @brief
     *
     * ## Event Data:
     * st_ble_iso_group_hdl_evt_t
     */
    BLE_ISO_EVENT_CIG_REMOVE_COMP,

    /**
     * @brief
     *
     * ## Event Data:
     * st_ble_iso_group_hdl_evt_t
     */
    BLE_ISO_EVENT_BIG_REMOVE_COMP,

    /**
     * @brief
     *
     * ## Event Data:
     * st_ble_gap_conn_hdl_evt_t
     */
    BLE_ISO_EVENT_REPLY_CIS_REQ_COMP,

    /**
     * @brief
     *
     * ## Event Data:
     * st_ble_iso_tx_sync_info_t
     */
    BLE_ISO_EVENT_GET_TX_SYNC_COMP,

    /**
     * @brief
     *
     * ## Event Data:
     * st_ble_gap_cte_antenna_info_t
     */
    BLE_GAP_EVENT_READ_ANT_INFO_COMP,

    /**
     * @brief
     *
     * ## Event Data:
     * st_ble_gap_conn_hdl_evt_t
     */
    BLE_ISO_EVENT_TX_TEST_COMP,

    /**
     * @brief
     *
     * ## Event Data:
     * st_ble_gap_conn_hdl_evt_t
     */
    BLE_ISO_EVENT_RX_TEST_COMP,

    /**
     * @brief
     *
     * ## Event Data:
     * st_ble_iso_test_cnt_info_t
     */
    BLE_ISO_EVENT_READ_TEST_CNT_COMP,

    /**
     * @brief
     *
     * ## Event Data:
     * st_ble_iso_test_end_rept_t
     */
    BLE_ISO_EVENT_TEST_ENDED,

    /**
     * @brief
     *
     * ## Event Data:
     * st_ble_iso_link_quality_info_t
     */
    BLE_ISO_EVENT_READ_LINK_QUALITY_COMP,

    /**
     * @brief
     *
     * ## Event Data:
     * st_ble_gap_conn_hdl_evt_t
     */
    BLE_ISO_EVENT_REMOVE_DATAPATH_COMP,

    /**
     * @brief
     *
     * ## Event Data:
     * None
     */
    BLE_GAP_EVENT_PER_ADV_RECV_ON,

    /**
     * @brief
     *
     * ## Event Data:
     * None
     */
    BLE_GAP_EVENT_PER_ADV_RECV_OFF,
} e_ble_iso_evt_t;

/*@}*/

/* ========================================== GATT Server Type Definitions ========================================= */

/** @addtogroup GATT_SERVER_API
 *  @ingroup BLE_API
 *  @{
 */

/******************************************************************************************************************//**
 * @ingroup GATT_SERVER_API
 * @ingroup GATT_CLIENT_API
 *  @struct st_ble_gatt_value_t
 *  @brief  Attribute Value.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief     Length of the attribute value.
     */
    uint16_t value_len;

    /**
     *  @brief     Attribute Value.
     */
    uint8_t * p_value;
} st_ble_gatt_value_t;

/******************************************************************************************************************//**
 * @ingroup GATT_SERVER_API
 * @ingroup GATT_CLIENT_API
 *  @struct st_ble_gatt_hdl_value_pair_t
 *  @brief  Attribute handle and attribute Value.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief     Attribute Handle
     */
    uint16_t attr_hdl;

    /**
     *  @brief     Attribute Value
     */
    st_ble_gatt_value_t value;
} st_ble_gatt_hdl_value_pair_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gatt_queue_att_val_t
 *  @brief  Queued writes Attribute Value.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief     Attribute Value for Queued Write .
     */
    uint8_t * p_value;

    /**
     *  @brief     Length of the attribute value.
     */
    uint16_t value_len;

    /**
     *  @brief     padding.
     */
    uint16_t padding;
} st_ble_gatt_queue_att_val_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gatt_queue_pair_t
 *  @brief  Queued writes Attribute Value.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief     Attribute Value for Queued Write
     */
    st_ble_gatt_queue_att_val_t queue_value;

    /**
     *  @brief     Attribute Handle
     */
    uint16_t attr_hdl;
} st_ble_gatt_queue_pair_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gatt_queue_elm_t
 *  @brief  Prepare Write Queue element for long chracteristic.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    Part of Long Characteristic Value and Characteristic Value Handle.
     */
    st_ble_gatt_queue_pair_t queue_value_pair;

    /**
     *  @brief    Offset that indicates the location to be written.
     */
    uint16_t offset;
} st_ble_gatt_queue_elm_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gatt_pre_queue_t
 *  @brief  Prepare Write Queue for long chracteristic.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    Buffer start address for Write Long Characteristic Request.
     */
    uint8_t * p_buf_start;

    /**
     *  @brief    Prepare Write Queue for Long Characteristic Value.
     */
    st_ble_gatt_queue_elm_t * p_queue;

    /**
     *  @brief    Buffer length.
     */
    uint16_t buffer_len;

    /**
     *  @brief    Connection Handle.
     */
    uint16_t conn_hdl;

    /**
     *  @brief    Current buffer offset.
     */
    uint16_t buf_offset;

    /**
     *  @brief    Number of elements in the prepare write queue.
     */
    uint8_t queue_size;

    /**
     *  @brief    Index of Prepare Write Queue.
     */
    uint8_t queue_idx;
} st_ble_gatt_pre_queue_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gatts_db_params_t
 *  @brief  Attribute value to be set to or retrieved from the GATT Database and the access type from the GATT Client.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    Attribute value to be set to or retrieved from the GATT Database.
     *            Note that the address of the value field in the value field is invalid in case of read access.
     */
    st_ble_gatt_value_t value;

    /**
     *  @brief    Attribute handle identifying the attribute to be set or retrieved.
     */
    uint16_t attr_hdl;

    /**
     *  @brief    Type of the access to GATT Database from the GATT Client.
     *  @sa       access_type_to_gatt_database
     */
    uint8_t db_op;
} st_ble_gatts_db_params_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gatts_db_conn_hdl_t
 *  @brief  Information about the service or the characteristic that the attribute belongs to.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    Connection handle identifying the GATT Client that accesses to the GATT DataBase.
     */
    uint16_t conn_hdl;

    /**
     *  @brief    ID of the service that the attribute belongs to.
     */
    uint8_t service_id;

    /**
     *  @brief    ID of the Characteristic that the attribute belongs to.
     */
    uint8_t char_id;
} st_ble_gatts_db_conn_hdl_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gatts_db_access_evt_t
 *  @brief  This structure notifies that the GATT Database has been accessed from a GATT Client.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    Information about the service or the characteristic that the attribute belongs to.
     */
    st_ble_gatts_db_conn_hdl_t * p_handle;

    /**
     *  @brief    Attribute value to be set to or retrieved from the GATT Database
     *            and the access type from the GATT Client.
     */
    st_ble_gatts_db_params_t * p_params;
} st_ble_gatts_db_access_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gatts_conn_evt_t
 *  @brief  This structure notifies that the link with the GATT Client has been established.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    Address of the GATT Client.
     */
    st_ble_dev_addr_t * p_addr;
} st_ble_gatts_conn_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gatts_disconn_evt_t
 *  @brief  This structure notifies that the link with the GATT Client has been disconnected.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    Address of the GATT Client.
     */
    st_ble_dev_addr_t * p_addr;
} st_ble_gatts_disconn_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gatts_ex_mtu_req_evt_t
 *  @brief  This structure notifies that a MTU Exchange Request PDU has been received from a GATT Client.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    Maximum receive MTU size by GATT Client.
     */
    uint16_t mtu;
} st_ble_gatts_ex_mtu_req_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gatts_cfm_evt_t
 *  @brief  This structure notifies that a Confirmation PDU has been received from a GATT Client.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    Attribute handle identifying the Characteristic sent by the Indication PDU.
     */
    uint16_t attr_hdl;
} st_ble_gatts_cfm_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gatts_read_by_type_rsp_evt_t
 *  @brief  This structure notifies that a Read By Type Response PDU has been sent from GATT Server.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    Attribute handle identifying the Characteristic read by the Read By Type Request PDU.
     */
    uint16_t attr_hdl;
} st_ble_gatts_read_by_type_rsp_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gatts_read_rsp_evt_t
 *  @brief  This structure notifies that a Read Response PDU has been sent from GATT Server.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    Attribute handle identifying the Characteristic read by the Read Request PDU.
     */
    uint16_t attr_hdl;
} st_ble_gatts_read_rsp_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gatts_read_blob_rsp_evt_t
 *  @brief  This structure notifies that a Read Blob Response PDU has been sent from GATT Server.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    Attribute handle identifying the Characteristic read by the Read Blob Request PDU.
     */
    uint16_t attr_hdl;
} st_ble_gatts_read_blob_rsp_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gatts_read_multi_rsp_evt_t
 *  @brief  This structure notifies that a Read Multiple Response PDU has been sent from GATT Server.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    The number of attribute read by the Read Multiple Request PDU.
     */
    uint8_t count;

    /**
     *  @brief    The list of attribute read by the Read Multiple Request PDU.
     */
    uint16_t * p_attr_hdl_list;
} st_ble_gatts_read_multi_rsp_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gatts_write_rsp_evt_t
 *  @brief  This structure notifies that a Write Response PDU has been sent from GATT Server.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    Attribute handle identifying the Characteristic written by the Write Request PDU.
     */
    uint16_t attr_hdl;
} st_ble_gatts_write_rsp_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gatts_prepare_write_rsp_evt_t
 *  @brief  This structure notifies that a Prepare Write Response PDU has been sent from GATT Server.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    Attribute handle identifying the Characteristic written by the Prepare Write Request PDU.
     */
    uint16_t attr_hdl;

    /**
     *  @brief     The length of written bytes by the Prepare Write Request PDU.
     */
    uint16_t length;

    /**
     *  @brief     The offset of the first octet to be written.
     */
    uint16_t offset;
} st_ble_gatts_prepare_write_rsp_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gatts_exe_write_rsp_evt_t
 *  @brief  This structure notifies that a Execute Write Response PDU has been sent from GATT Server.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    The flag that indicates whether execution or cancellation.
     *  @details
     *    |  value     |   description     |
     *    |:-----------|:----------------- |
     *    | 0x00       | Cancellation.     |
     *    | 0x01       | Execution.        |
     */
    uint8_t exe_flag;
} st_ble_gatts_exe_write_rsp_evt_t;

/* GATT DB Structure */

/******************************************************************************************************************//**
 *  @struct st_ble_gatts_db_uuid_cfg_t
 *  @brief  A structure that defines the information on the position where UUIDs are used.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    The position of the defined UUID is specified by offset value in uuid_table of st_ble_gatts_db_cfg_t.
     */
    uint16_t offset;

    /**
     *  @brief    The attribute handle that indicates the first position in st_ble_gatts_db_attr_cfg_t
     *            for the defined UUID is specified.
     */
    uint16_t first;

    /**
     *  @brief    The attribute handle that indicates the last position in st_ble_gatts_db_attr_cfg_t
     *            for the defined UUID is specified.
     */
    uint16_t last;
} st_ble_gatts_db_uuid_cfg_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gatts_db_attr_cfg_t
 *  @brief  A structure that defines the detailed information of the attributes.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    The properties of attribute are specified.
     *  @details  Set the following properties by a bitwise OR.
     *    |              macro                        |   description                          |
     *    |:------------------------------------------|:-------------------------------------- |
     *    | BLE_GATT_DB_READ(0x01)                    | Allow clients to read.                 |
     *    | BLE_GATT_DB_WRITE(0x02)                   |  Allow clients to write.               |
     *    | BLE_GATT_DB_WRITE_WITHOUT_RSP(0x04)       |  Allow clients to write.               |
     *    | BLE_GATT_DB_READ_WRITE(0x07)              |  Allow clients to access of all.       |
     */
    uint8_t desc_prop;

    /**
     *  @brief    The auxiliary properties of attribute are specified.
     *  @details  Set the following properties by a bitwise OR.
     *      <table>
     *          <tr>
     *              <th>macro</th>
     *              <th>description</th>
     *          </tr>
     *          <tr>
     *              <td>BLE_GATT_DB_NO_AUXILIARY_PROPERTY(0x00)</td>
     *              <td>
     *                  No auxiliary properties.\n
     *                  It is invalid when used with other properties at the same time.
     *              </td>
     *          </tr>
     *          <tr>
     *              <td>BLE_GATT_DB_FIXED_LENGTH_PROPERTY(0x01)</td>
     *              <td>
     *                  Fixed length attribute value.
     *              </td>
     *          </tr>
     *          <tr>
     *              <td>BLE_GATT_DB_AUTHORIZATION_PROPERTY(0x02)</td>
     *              <td>
     *                  Attributes requiring authorization.
     *              </td>
     *          </tr>
     *          <tr>
     *              <td>BLE_GATT_DB_ATTR_DISABLED(0x10)</td>
     *              <td>
     *                  The attribute is disabled.
     *                  If this value is set, the attribute cannot be found and accessed by a GATT Client.
     *                  It is invalid when used with other properties at the same time.
     *              </td>
     *          </tr>
     *          <tr>
     *              <td>BLE_GATT_DB_128_BIT_UUID_FORMAT(0x20)</td>
     *              <td>
     *                  Attribute with 128 bit UUID.\n
     *                  If this macro is not set, the attribute value is 16-bits UUID.
     *              </td>
     *          </tr>
     *          <tr>
     *              <td>BLE_GATT_DB_PEER_SPECIFIC_VAL_PROPERTY(0x40)</td>
     *              <td>
     *                  Attribute managed by each GATT Client.
     *              </td>
     *          </tr>
     *          <tr>
     *              <td>BLE_GATT_DB_CONST_ATTR_VAL_PROPERTY(0x80)</td>
     *              <td>
     *                  Fixed attribute value.\n
     *                  Writing from Client and setting from Server are prohibited.
     *              </td>
     *          </tr>
     *      </table>
     */
    uint8_t aux_prop;

    /**
     *  @brief    The length of the attribute value is specified.
     */
    uint16_t length;

    /**
     *  @brief    The position of the next attribute with the same UUID
     *            as the defined attribute is specified by an attribute handle.
     */
    uint16_t next;

    /**
     *  @brief    The storage area of attribute value.
     *  @details  UUID of the defined attribute is set by specifying the position of the UUID registered
     *            in uuid_table of st_ble_gatts_db_cfg_t with the array offset value.
     */
    uint16_t uuid_offset;

    /**
     *  @brief    Storage area of attribute value.
     *  @details  The address in the array registered in No.1-No.4 is specified to set the attribute value storage 
     *  area of the defined attribute.
     */
    uint8_t * p_data_offset;
} st_ble_gatts_db_attr_cfg_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gatts_db_attr_list_t
 *  @brief  The number of attributes are stored.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    The number of the services or the characteristics.
     */
    uint8_t count;
} st_ble_gatts_db_attr_list_t;

