fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
/******************************************************************************************************************//**
 *  @struct st_ble_gatts_db_char_cfg_t
 *  @brief  A structure that defines the detailed information of the characteristics.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    The total number of attributes in the defined characteristic is specified.
     */
    st_ble_gatts_db_attr_list_t list;

    /**
     *  @brief    The first attribute handle of the characteristic is specified.
     */
    uint16_t start_hdl;

    /**
     *  @brief    The index of service to which the characteristic belongs is specified.
     */
    uint8_t service_id;
} st_ble_gatts_db_char_cfg_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gatts_db_serv_cfg_t
 *  @brief  A structure that defines the detailed information of the characteristics.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief     The total number of service declarations in the defined service is specified.
     */
    st_ble_gatts_db_attr_list_t list;

    /**
     *  @brief    The properties of the defined service are specified.
     *  @details  Set the security level, the security mode and the key size with a bitwise OR.
     *            The bit0-bit3 are specified as the security level.
     *            Select one of the following.
     *              <table>
     *                  <tr>
     *                      <th>macro</th>
     *                      <th>description</th>
     *                  </tr>
     *                  <tr>
     *                      <td>BLE_GATT_DB_SER_SECURITY_UNAUTH(0x00000001)</td>
     *                      <td>Unauthenticated pairing(Security Mode1 Security Level 2, 
     *                      Security Mode 2 Security Level 1)<BR/>
     *                      Unauthenticated pairing is required to access the service.
     *                      </td>
     *                  </tr>
     *                  <tr>
     *                      <td>BLE_GATT_DB_SER_SECURITY_AUTH(0x00000002)</td>
     *                      <td>Authenticated pairing(Security Mode1 Security Level 3, 
     *                      Security Mode 2 Security Level 2)<BR/>
     *                      Authenticated pairing is required to access the service.
     *                      </td>
     *                  </tr>
     *                  <tr>
     *                      <td>BLE_GATT_DB_SER_SECURITY_SECONN(0x00000004)</td>
     *                      <td>Authenticated LE secure connections that generates 16bytes 
     *                      LTK(Security Mode1 Security Level 4)<BR/>
     *                      Authenticated LE secure connections pairing that generates 16bytes LTK is required to 
     *                      access the service. If this bit is set, bit24-27 are ignored.
     *                      </td>
     *                  </tr>
     *              </table>
     *              <BR/>
     *              The bit4 is specified as the security mode.<BR/>
     *              <table>
     *                  <tr>
     *                      <th>macro</th>
     *                      <th>description</th>
     *                  </tr>
     *                  <tr>
     *                      <td>BLE_GATT_DB_SER_SECURITY_ENC(0x00000010)</td>
     *                      <td>Encryption<BR/>
     *                      Encryption by the LTK exchanged in pairing is required to access.</td>
     *                  </tr>
     *              </table>
     *              <BR/>
     *              If the security requirement of the service is not needed,
     *              specify the bit0-bit4 to BLE_GATT_DB_SER_NO_SECURITY_PROPERTY(0x00000000).
     *              (Security Mode1 Security Level 1)<BR/>
     *              The bit24-bit27 are specified as the key size required by the defined service.<BR/>
     *              Select one of the following.<BR/>
     *              <table>
     *                  <tr>
     *                      <th>macro</th>
     *                      <th>description</th>
     *                  </tr>
     *                  <tr>
     *                      <td>BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_7(0x01000000)</td>
     *                      <td>7-byte encryption key.</td>
     *                  </tr>
     *                  <tr>
     *                      <td>BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_8(0x02000000)</td>
     *                      <td>8-byte encryption key.</td>
     *                  </tr>
     *                  <tr>
     *                      <td>BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_9(0x03000000)</td>
     *                      <td>9-byte encryption key.</td>
     *                  </tr>
     *                  <tr>
     *                      <td>BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_10(0x04000000)</td>
     *                      <td>10-byte encryption key.</td>
     *                  </tr>
     *                  <tr>
     *                      <td>BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_11(0x05000000)</td>
     *                      <td>11-byte encryption key.</td>
     *                  </tr>
     *                  <tr>
     *                      <td>BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_12(0x06000000)</td>
     *                      <td>12-byte encryption key.</td>
     *                  </tr>
     *                  <tr>
     *                      <td>BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_13(0x07000000)</td>
     *                      <td>13-byte encryption key.</td>
     *                  </tr>
     *                  <tr>
     *                      <td>BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_14(0x08000000)</td>
     *                      <td>14-byte encryption key.</td>
     *                  </tr>
     *                  <tr>
     *                      <td>BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_15(0x09000000)</td>
     *                      <td>15-byte encryption key.</td>
     *                  </tr>
     *                  <tr>
     *                      <td>BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_16(0x0A000000)</td>
     *                      <td>16-byte encryption key.</td>
     *                  </tr>
     *                  <tr>
     *                      <td>BLE_GATT_DB_SER_ENC_KEY_SIZE_DONT_CARE(0x00000000)</td>
     *                      <td>7-byte or larger encryption key.</td>
     *                  </tr>
     *              </table>
     *              <BR/>
     *              Other bits are reserved.<BR/>
     */
    uint32_t desc;

    /**
     *  @brief     The start attribute handle of the defined service is specified.
     */
    uint16_t start_hdl;

    /**
     *  @brief      The end attribute handle of the defined service is specified.
     */
    uint16_t end_hdl;

    /**
     *  @brief      The start index of the characteristic that belongs to the defined service is specified.
     */
    uint8_t char_start_idx;

    /**
     *  @brief      The end index of the characteristic that belongs to the defined service is specified.
     */
    uint8_t char_end_idx;
} st_ble_gatts_db_serv_cfg_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gatts_db_cfg_t
 *  @brief  This is the structure of GATT Database that is specified in R_BLE_GATTS_SetDbInst().
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief      The array to register the UUID to be used.
     */
    const uint8_t * p_uuid_table;

    /**
     *  @brief      The array to register variable attribute values.
     */
    uint8_t * p_attr_val_table;

    /**
     *  @brief      The array to register fixed attribute values.
     */
    const uint8_t * p_const_attr_val_table;

    /**
     *  @brief      The array to manage the attribute values handled for each GATT client.
     */
    uint8_t * p_rem_spec_val_table;

    /**
     *  @brief      The array to register the default of the attribute value handled by each GATT client.
     */
    const uint8_t * p_const_rem_spec_val_table;

    /**
     *  @brief      The array to register information on the position where UUIDs are used.
     */
    const st_ble_gatts_db_uuid_cfg_t * p_uuid_cfg;

    /**
     *  @brief      The array to register the detailed information of attributes.
     */
    const st_ble_gatts_db_attr_cfg_t * p_attr_cfg;

    /**
     *  @brief       The array to register the detailed information of characteristics.
     */
    const st_ble_gatts_db_char_cfg_t * p_char_cfg;

    /**
     *  @brief        The array to register the detailed information of services.
     */
    const st_ble_gatts_db_serv_cfg_t * p_serv_cfg;

    /**
     *  @brief        The number of services included in the GATT Database.
     */
    uint8_t serv_cnt;

    /**
     *  @brief        The number of characteristics included in the GATT Database.
     */
    uint8_t char_cnt;

    /**
     *  @brief        The number of UUIDs included in the GATT Database.
     */
    uint8_t uuid_type_cnt;

    /**
     *  @brief        The total size of attribute value that needs to be managed for each GATT client.
     */
    uint8_t peer_spec_val_cnt;
} st_ble_gatts_db_cfg_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gatts_evt_data_t
 *  @brief  st_ble_gatts_evt_data_t is the type of the data notified in a GATT Server Event.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief        Connection handle identifying the GATT Client.
     */
    uint16_t conn_hdl;

    /**
     *  @brief        The size of GATT Server Event parameters.
     */
    uint16_t param_len;

    /**
     *  @brief         GATT Server Event parameters. This parameter differs in each GATT Server Event.
     */
    void * p_param;
} st_ble_gatts_evt_data_t;

/******************************************************************************************************************//**
 * @typedef ble_gatts_app_cb_t
 * @brief   ble_gatts_app_cb_t is the GATT Server Event callback function type.
 * @param[in] event_type    The type of GATT Server Event.
 * @param[in] event_result  The result of GATT Server Event
 * @param[in] p_event_data    Data notified by GATT Server Event.
 * @return none
 *********************************************************************************************************************/
typedef void (* ble_gatts_app_cb_t)(uint16_t event_type, ble_status_t event_result,
                                    st_ble_gatts_evt_data_t * p_event_data);

/*@}*/

/* ========================================== GATT Client Type Definitions ========================================= */

/** @addtogroup GATT_CLIENT_API
 *  @ingroup BLE_API
 *  @{
 */

/******************************************************************************************************************//**
 *  @ingroup GATT_CLIENT_API
 *  @struct st_ble_gatt_hdl_range_t
 *  @brief  Attribute handle range.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief          Start Attribute Handle.
     */
    uint16_t start_hdl;

    /**
     *  @brief         End Attribute Handle.
     */
    uint16_t end_hdl;
} st_ble_gatt_hdl_range_t;

/******************************************************************************************************************//**
 * @ingroup GATT_CLIENT_API
 *  @struct st_ble_gattc_reliable_writes_char_pair_t
 *  @brief  This is used in R_BLE_GATTC_ReliableWrites() to specify the pair of Characteristic Value and
 *          Characteristic Value Handle.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief         Pair of Characteristic Value and Characteristic Value Handle.
     */
    st_ble_gatt_hdl_value_pair_t write_data;

    /**
     *  @brief         Offset that indicates the location to be written.
     *  @details       Normally, set 0 to this parameter.\n
     *                 If this parameter sets to a value other than 0,Adjust the offset parameter and the length of
     *                 the value to be written not to exceed the length of the Characteristic.
     */
    uint16_t offset;
} st_ble_gattc_reliable_writes_char_pair_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gattc_conn_evt_t
 *  @brief  This structure notifies that the link with the GATT Server has been established.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    Address of the GATT Server.
     */
    st_ble_dev_addr_t * p_addr;
} st_ble_gattc_conn_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gattc_disconn_evt_t
 *  @brief  This structure notifies that the link with the GATT Server has been disconnected.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    Address of the GATT Server.
     */
    st_ble_dev_addr_t * p_addr;
} st_ble_gattc_disconn_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gattc_ex_mtu_rsp_evt_t
 *  @brief  This structure notifies that a MTU Exchange Response PDU has been received from a GATT Server.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    MTU size(in bytes) that GATT Server can receive.
     */
    uint16_t mtu;
} st_ble_gattc_ex_mtu_rsp_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gattc_serv_16_evt_t
 *  @brief  This structure notifies that a 16-bit UUID Service has been discovered.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    Attribute handle range of the 16-bit UUID service.
     */
    st_ble_gatt_hdl_range_t range;

    /**
     *  @brief    Service UUID.
     */
    uint16_t uuid_16;
} st_ble_gattc_serv_16_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gattc_serv_128_evt_t
 *  @brief  This structure notifies that a 128-bit UUID Service has been discovered.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    Attribute handle range of the 128-bit UUID service.
     */
    st_ble_gatt_hdl_range_t range;

    /**
     *  @brief    Service UUID.
     */
    uint8_t uuid_128[BLE_GATT_128_BIT_UUID_SIZE];
} st_ble_gattc_serv_128_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gattc_inc_serv_16_evt_t
 *  @brief  This structure notifies that a 16-bit UUID Included Service has been discovered.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    Service Declaration handle of the 16-bit UUID Included Service.
     */
    uint16_t decl_hdl;

    /**
     *  @brief    The contents of the Included Service.
     */
    st_ble_gattc_serv_16_evt_t service;
} st_ble_gattc_inc_serv_16_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gattc_inc_serv_128_evt_t
 *  @brief  This structure notifies that a 128-bit UUID Included Service has been discovered.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    Service Declaration handle of the 128-bit UUID Included Service.
     */
    uint16_t decl_hdl;

    /**
     *  @brief    The contents of the Included Service.
     */
    st_ble_gattc_serv_128_evt_t service;
} st_ble_gattc_inc_serv_128_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gattc_char_16_evt_t
 *  @brief  This structure notifies that a 16-bit UUID Characteristic has been discovered.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    Attribute handle of Characteristic Declaration.
     */
    uint16_t decl_hdl;

    /**
     *  @brief    Characteristic Properties.
     *  @details  It is a bitwise OR of the following values.\n
     *            Refer to Core Spec [Vol.3] Generic Attribute Profile(GATT) "3.3.1.1 Characteristic Properties"
     *            regarding the details of the Characteristic Properties.
     *            |  value     |   description                        |
     *            |:-----------|:------------------------------------ |
     *            | 0x01       | Broadcast property                   |
     *            | 0x02       | Read property                        |
     *            | 0x04       | Write Without Response property      |
     *            | 0x08       | Write property                       |
     *            | 0x10       | Notify property                      |
     *            | 0x20       | Indicate property                    |
     *            | 0x40       | Authenticated Signed Writes property |
     *            | 0x80       | Extended Properties property         |
     */
    uint8_t cproperty;

    /**
     *  @brief    Value Handle of the Characteristic.
     */
    uint16_t value_hdl;

    /**
     *  @brief    Characteristic UUID.
     */
    uint16_t uuid_16;
} st_ble_gattc_char_16_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gattc_char_128_evt_t
 *  @brief  This structure notifies that a 128-bit UUID Characteristic has been discovered.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    Attribute Handle of Characteristic Declaration.
     */
    uint16_t decl_hdl;

    /**
     *  @brief    Characteristic Properties.
     *  @details  It is a bitwise OR of the following values.\n
     *            Refer to Core Spec [Vol.3] Generic Attribute Profile(GATT) "3.3.1.1 Characteristic Properties"
     *            regarding the details of the Characteristic Properties.
     *            |  value     |   description                        |
     *            |:-----------|:------------------------------------ |
     *            | 0x01       | Broadcast property                   |
     *            | 0x02       | Read property                        |
     *            | 0x04       | Write Without Response property      |
     *            | 0x08       | Write property                       |
     *            | 0x10       | Notify property                      |
     *            | 0x20       | Indicate property                    |
     *            | 0x40       | Authenticated Signed Writes property |
     *            | 0x80       | Extended Properties property         |
     */
    uint8_t cproperty;

    /**
     *  @brief    Value Handle of the Characteristic.
     */
    uint16_t value_hdl;

    /**
     *  @brief    Characteristic UUID.
     */
    uint8_t uuid_128[BLE_GATT_128_BIT_UUID_SIZE];
} st_ble_gattc_char_128_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gattc_char_desc_16_evt_t
 *  @brief  This structure notifies that a 16-bit UUID Characteristic Descriptor has been discovered.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    Attribute Handle of Characteristic Descriptor.
     */
    uint16_t desc_hdl;

    /**
     *  @brief    Characteristic Descriptor UUID.
     */
    uint16_t uuid_16;
} st_ble_gattc_char_desc_16_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gattc_char_desc_128_evt_t
 *  @brief  This structure notifies that a 128-bit UUID Characteristic Descriptor has been discovered.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    Attribute Handle of Characteristic Descriptor.
     */
    uint16_t desc_hdl;

    /**
     *  @brief    Characteristic Descriptor UUID.
     */
    uint8_t uuid_128[BLE_GATT_128_BIT_UUID_SIZE];
} st_ble_gattc_char_desc_128_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gattc_err_rsp_evt_t
 *  @brief  This structure notifies that a Error Response PDU has been received from a GATT Server.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    The op code of the ATT Request that causes the Error Response.
     *            |             op_code                   |
     *            |:--------------------------------------|
     *            |  Exchange MTU Request(0x02)           |
     *            |  Find Information Request(0x04)       |
     *            |  Find By Type Value Request(0x06)     |
     *            |  Read By Type Request(0x08)           |
     *            |  Read Request(0x0A)                   |
     *            |  Read Blob Request(0x0C)              |
     *            |  Read Multiple Request(0x0E)          |
     *            |  Read by Group Type Request(0x10)     |
     *            |  Write Request(0x12)                  |
     *            |  Prepare Write Request(0x16)          |
     *            |  Execute Write Request(0x18)          |
     */
    uint8_t op_code;

    /**
     *  @brief    Attribute handle that is target for the request.
     */
    uint16_t attr_hdl;

