fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
    /**
     *  @brief    The error codes notified from the GATT Server.
     *  @details  It is a bitwise OR of GATT Error Group ID : 0x3000 and the following error codes defined in
     *            Core Spec and Core Spec Supplement.
     *              <table>
     *                  <tr>
     *                      <th>Error Code</th>
     *                      <th>description</th>
     *                  </tr>
     *                  <tr>
     *                      <td>BLE_ERR_GATT_INVALID_HANDLE(0x3001)</td>
     *                      <td>Invalid attribute handle</td>
     *                  </tr>
     *                  <tr>
     *                      <td>BLE_ERR_GATT_READ_NOT_PERMITTED(0x3002)</td>
     *                      <td>The attribute cannot be read.</td>
     *                  </tr>
     *                  <tr>
     *                      <td>BLE_ERR_GATT_WRITE_NOT_PERMITTED(0x3003)</td>
     *                      <td>The attribute cannot be written.</td>
     *                  </tr>
     *                  <tr>
     *                      <td>BLE_ERR_GATT_INVALID_PDU(0x3004)</td>
     *                      <td>Invalid PDU.</td>
     *                  </tr>
     *                  <tr>
     *                      <td>BLE_ERR_GATT_INSUFFICIENT_AUTHENTICATION(0x3005)</td>
     *                      <td>The authentication to access the attribute is insufficient.</td>
     *                  </tr>
     *                  <tr>
     *                      <td>BLE_ERR_GATT_REQUEST_NOT_SUPPORTED(0x3006)</td>
     *                      <td>The request is not supported.</td>
     *                  </tr>
     *                  <tr>
     *                      <td>BLE_ERR_GATT_INVALID_OFFSET(0x3007)</td>
     *                      <td>The specified offset is larger than the length of the attribute value.</td>
     *                  </tr>
     *                  <tr>
     *                      <td>BLE_ERR_GATT_INSUFFICIENT_AUTHORIZATION(0x3008)</td>
     *                      <td>Authorization is required to access the attribute.</td>
     *                  </tr>
     *                  <tr>
     *                      <td>BLE_ERR_GATT_PREPARE_WRITE_QUEUE_FULL(0x3009)</td>
     *                      <td>The Write Queue in the GATT Server is full.</td>
     *                  </tr>
     *                  <tr>
     *                      <td>BLE_ERR_GATT_ATTRIBUTE_NOT_FOUND(0x300A)</td>
     *                      <td>The specified attribute is not found.</td>
     *                  </tr>
     *                  <tr>
     *                      <td>BLE_ERR_GATT_ATTRIBUTE_NOT_LONG(0x300B)</td>
     *                      <td>The attribute cannot be read by Read Blob Request.</td>
     *                  </tr>
     *                  <tr>
     *                      <td>BLE_ERR_GATT_INSUFFICIENT_ENC_KEY_SIZE(0x300C)</td>
     *                      <td>The Encryption Key Size is insufficient.</td>
     *                  </tr>
     *                  <tr>
     *                      <td>BLE_ERR_GATT_INVALID_ATTRIBUTE_LEN(0x300D)</td>
     *                      <td>The length of the specified attribute is invalid.</td>
     *                  </tr>
     *                  <tr>
     *                      <td>BLE_ERR_GATT_UNLIKELY_ERROR(0x300E)</td>
     *                      <td>Because an error has occurred,  the process cannot be advanced.</td>
     *                  </tr>
     *                  <tr>
     *                      <td>BLE_ERR_GATT_INSUFFICIENT_ENCRYPTION(0x300F)</td>
     *                      <td>Encryption is required to access the attribute.
     *                      </td>
     *                  </tr>
     *                  <tr>
     *                      <td>BLE_ERR_GATT_UNSUPPORTED_GROUP_TYPE(0x3010)</td>
     *                      <td>The type of the specified attribute is not supported.
     *                      </td>
     *                  </tr>
     *                  <tr>
     *                      <td>BLE_ERR_GATT_INSUFFICIENT_RESOURCES(0x3011)</td>
     *                      <td>The resource to complete the request is insufficient.
     *                      </td>
     *                  </tr>
     *                  <tr>
     *                      <td>0x3080 - 0x309F</td>
     *                      <td>
     *                          Application Error.
     *                          The upper layer defines the error codes.
     *                      </td>
     *                  </tr>
     *                  <tr>
     *                      <td>0x30E0 - 0x30FF</td>
     *                      <td>
     *                          The error code defined in Common Profile and
     *                          Service Error Core Specification Supplement(CSS).<BR/>
     *                          CSS ver.7 defines the error codes from 0x30FC to 0x30FF.
     *                      </td>
     *                  </tr>
     *                  <tr>
     *                      <td>BLE_ERR_GATT_WRITE_REQ_REJECTED(0x30FC)</td>
     *                      <td>
     *                          The Write Request has not been completed due to the reason other than Permission.
     *                      </td>
     *                  </tr>
     *                  <tr>
     *                      <td>BLE_ERR_GATT_CCCD_IMPROPERLY_CFG(0x30FD)</td>
     *                      <td>The CCCD is set to be invalid.</td>
     *                  </tr>
     *                  <tr>
     *                      <td>BLE_ERR_GATT_PROC_ALREADY_IN_PROGRESS(0x30FE)</td>
     *                      <td>The request is now in progress.</td>
     *                  </tr>
     *                  <tr>
     *                      <td>BLE_ERR_GATT_OUT_OF_RANGE(0x30FF)</td>
     *                      <td>The attribute value is out of range.</td>
     *                  </tr>
     *              </table>
     */
    uint16_t rsp_code;
} st_ble_gattc_err_rsp_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gattc_ntf_evt_t
 *  @brief  This structure notifies that a Notification PDU has been received from a GATT Server.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    Characteristic that causes the Notification.
     */
    st_ble_gatt_hdl_value_pair_t data;
} st_ble_gattc_ntf_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gattc_ind_evt_t
 *  @brief  This structure notifies that a Indication PDU has been received from a GATT Server.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    Characteristic that causes the Indication.
     */
    st_ble_gatt_hdl_value_pair_t data;
} st_ble_gattc_ind_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gattc_svc_chng_evt_t
 *  @brief  This structure notifies that a service changed PDU has been received from a GATT Server.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    Client Characteristic Configuration Descriptor value.
     */
    uint16_t ind_cfg;
} st_ble_gattc_svc_chng_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gattc_rd_char_evt_t
 *  @brief  This structure notifies that read response to R_BLE_GATTC_ReadChar() or R_BLE_GATTC_ReadCharUsingUuid()
 *          has been received from a GATT Server.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief    The contents of the Characteristic that has been read.
     */
    st_ble_gatt_hdl_value_pair_t read_data;
} st_ble_gattc_rd_char_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gattc_wr_char_evt_t
 *  @brief  This structure notifies that write response to R_BLE_GATTC_WriteChar() 
 *          has been received from a GATT Server.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief   Value Handle of the Characteristic/Characteristic Descriptor that has been written.
     */
    uint16_t value_hdl;
} st_ble_gattc_wr_char_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gattc_att_info_req_ind_evt_t
 *  @brief  This structure notifies that an att_info_req_ind event has arrived
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief   Value Handle of the Characteristic/Characteristic Descriptor that information is required.
     */
    uint16_t value_hdl;
} st_ble_gattc_att_info_req_ind_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gattc_wr_char_without_rsp_evt_t
 *  @brief  This structure notifies that write response to R_BLE_GATTC_WriteCharWithoutRsp()
 *  has been received from a GATT Server.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief   Value Handle of the Characteristic/Characteristic Descriptor that has been written.
     */
    uint16_t value_hdl;
} st_ble_gattc_wr_char_without_rsp_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gattc_rd_multi_char_evt_t
 *  @brief  This structure notifies that read response to R_BLE_GATTC_ReadMultiChar() has been received
 *          from a GATT Server.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief   The number of Value Handles of the Characteristics that has been read.
     */
    uint16_t value_hdl_num;

    /**
     *  @brief   The contents of multiple Characteristics that have been read.
     */
    st_ble_gatt_value_t multi_char_val;
} st_ble_gattc_rd_multi_char_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gattc_char_part_wr_evt_t
 *  @brief  This structure notifies that write response to R_BLE_GATTC_WriteLongChar() or R_BLE_GATTC_ReliableWrites()
 *          has been received from a GATT Server.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief   The data to be written to the Characteristic/Long Characteristic/Long Characteristic Descriptor.
     */
    st_ble_gatt_hdl_value_pair_t write_data;

    /**
     *  @brief   Offset that indicates the location to be written.
     */
    uint16_t offset;
} st_ble_gattc_char_part_wr_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_gattc_reliable_writes_comp_evt_t
 *  @brief  This structure notifies that a response to R_BLE_GATTC_ExecWrite() has been received
 *          from a GATT Server.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief   This field indicates the command of the Execute Write that has been done.
     *  @details
     *            |  value     |   description       |
     *            |:-----------|:------------------- |
     *            | 0x00       | Cancel the write.   |
     *            | 0x01       | Execute the write.  |
     */
    uint8_t exe_flag;
} st_ble_gattc_reliable_writes_comp_evt_t;

