fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
/* RBLE GATT Client Command Parameters */

#ifndef BSP_OVERRIDE_BLE_GATTC_RD_MULTI_REQ_PARAM_T

/******************************************************************************************************************//**
 *  @struct st_ble_gattc_rd_multi_req_param_t
 *  @brief  This is used in R_BLE_GATTC_ReadMultiChar() to specify multiple Characteristics to be read.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief   List of Value Handles that point the Characteristics to be read.
     */
    uint16_t * p_hdl_list;

    /**
     *  @brief   List of Value Length that point the Characteristics to be read.
     */
    uint16_t * p_len_list;

    /**
     *  @brief   The number of Value Handles included in the hdl_list parameter.
     */
    uint16_t list_count;
} st_ble_gattc_rd_multi_req_param_t;
#endif

/******************************************************************************************************************//**
 *  @struct st_ble_gattc_evt_data_t
 *  @brief  st_ble_gattc_evt_data_t is the type of the data notified in a GATT Client Event.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief   Connection handle identifying the GATT Server.
     */
    uint16_t conn_hdl;

    /**
     *  @brief    The size of GATT Client Event parameters.
     */
    uint16_t param_len;

    /**
     *  @brief   GATT Client Event parameters. This parameter differs in each GATT Client Event.
     */
    void * p_param;
} st_ble_gattc_evt_data_t;

/******************************************************************************************************************//**
 * @typedef ble_gattc_app_cb_t
 * @brief   ble_gattc_app_cb_t is the GATT Client Event callback function type.
 * @param[in] event_type    The type of GATT Client Event.
 * @param[in] event_result  The result of GATT Client Event
 * @param[in] p_event_data  Data notified by GATT Client Event.
 * @return none
 *********************************************************************************************************************/
typedef void (* ble_gattc_app_cb_t)(uint16_t event_type, ble_status_t event_result,
                                    st_ble_gattc_evt_data_t * p_event_data);

/*@}*/

/* ============================================= L2CAP Type Definitions ============================================ */

/** @addtogroup L2CAP_API
 *  @ingroup BLE_API
 *  @{
 */

/******************************************************************************************************************//**
 * @ingroup L2CAP_API
 * @struct st_ble_l2cap_conn_req_param_t
 * @brief  L2CAP CBFC Channel connection request parameters.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief Identifier indicating the protocol/profile that uses L2CAP CBFC Channel on local device.
     */
    uint16_t local_psm;

    /**
     *  @brief Identifier indicating the protocol/profile that uses L2CAP CBFC Channel on remote device.
     */
    uint16_t remote_psm;

    /**
     *  @brief MTU size(byte) receivable on L2CAP CBFC Channel.
     */
    uint16_t mtu;

    /**
     *  @brief MPS size(byte) receivable on L2CAP CBFC Channel.
     */
    uint16_t mps;

    /**
     *  @brief The number of LE-Frame that local device can receive.
     */
    uint16_t credit;
} st_ble_l2cap_conn_req_param_t;

/******************************************************************************************************************//**
 * @struct st_ble_l2cap_conn_rsp_param_t
 * @brief  L2CAP CBFC Channel connection response parameters.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief CID identifying the L2CAP CBFC Channel on local device.
     *         The valid range is 0x40-0x40 + BLE_L2CAP_MAX_CBFC_PSM - 1.
     */
    uint16_t lcid;

    /**
     *  @brief  The response to the connection request. Select one of the following.
     *                  <table>
     *                      <tr>
     *                          <th>macro</th>
     *                          <th>description</th>
     *                      </tr>
     *                      <tr>
     *                          <td><span style="color:#307D7E">BLE_L2CAP_CF_RSP_SUCCESS(0x0000)</span></td>
     *                          <td>Notify the remote device that the connection can be established.</td>
     *                      </tr>
     *                      <tr>
     *                          <td><span style="color:#307D7E">BLE_L2CAP_CF_RSP_RFSD_INSF_AUTH(0x0005)</span></td>
     *                          <td>Notify the remote device that the connection can not be established
     *                              because of insufficient authentication.</td>
     *                      </tr>
     *                      <tr>
     *                          <td><span style="color:#307D7E">BLE_L2CAP_CF_RSP_RFSD_INSF_AUTRZ(0x0006)</span></td>
     *                          <td>Notify the remote device that the connection can not be established
     *                              because of insufficient Authorization.</td>
     *                      </tr>
     *                      <tr>
     *                          <td><span style="color:#307D7E">BLE_L2CAP_CF_RSP_RFSD_INSF_ENC_KEY(0x0007)</span></td>
     *                          <td>Notify the remote device that the connection can not be established
     *                              because of Encryption Key Size.</td>
     *                      </tr>
     *                      <tr>
     *                          <td><span style="color:#307D7E">BLE_L2CAP_CF_RSP_RFSD_INSF_ENC(0x0008)</span></td>
     *                          <td>Notify the remote device that the connection can not be established
     *                              because of Encryption.</td>
     *                      </tr>
     *                      <tr>
     *                          <td><span style="color:#307D7E">BLE_L2CAP_CF_RSP_RFSD_UNAC_PARAM(0x000B)</span></td>
     *                          <td>Notify the remote device that the connection can not be established
     *                              because the parameters is unacceptable to local device.</td>
     *                      </tr>
     *                  </table>
     */
    uint16_t response;

    /**
     *  @brief MTU(byte) of packet that L2CAP CBFC Channel on local device can receive.
     */
    uint16_t mtu;

    /**
     *  @brief MPS(byte) of packet that L2CAP CBFC Channel on local device can receive.
     */
    uint16_t mps;

    /**
     *  @brief The number of LE-Frame that L2CAP CBFC Channel on local device can receive.
     */
    uint16_t credit;
} st_ble_l2cap_conn_rsp_param_t;

/******************************************************************************************************************//**
 * @struct st_ble_l2cap_cf_conn_evt_t
 * @brief  L2CAP CBFC Channel connection parameters.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief CID identifying the L2CAP CBFC Channel.
     */
    uint16_t cid;

    /**
     *  @brief PSM allocated by the cid field.
     */
    uint16_t psm;

    /**
     *  @brief MTU of local (specified in @ref BLE_L2CAP_EVENT_CF_CONN_IND)
     *         / remote (notified in @ref BLE_L2CAP_EVENT_CF_CONN_CNF) device.
     */
    uint16_t mtu;

    /**
     *  @brief MPS of local (specified in @ref BLE_L2CAP_EVENT_CF_CONN_IND)
     *         / remote (notified in @ref BLE_L2CAP_EVENT_CF_CONN_CNF) device.
     */
    uint16_t mps;

    /**
     *  @brief Credit of local (specified in @ref BLE_L2CAP_EVENT_CF_CONN_IND)
     *         / remote (notified in @ref BLE_L2CAP_EVENT_CF_CONN_CNF) device.
     */
    uint16_t credit;
} st_ble_l2cap_cf_conn_evt_t;

/******************************************************************************************************************//**
 * @struct st_ble_l2cap_cf_data_evt_t
 * @brief  Sent/Received Data parameters.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief CID identifying the L2CAP CBFC Channel that has sent or received the data .
     */
    uint16_t cid;

    /**
     *  @brief PSM allocated by the cid field.
     */
    uint16_t psm;

    /**
     *  @brief Data length.
     */
    uint16_t data_len;

    /**
     *  @brief Sent/Received data.
     */
    uint8_t * p_data;
} st_ble_l2cap_cf_data_evt_t;

/******************************************************************************************************************//**
 * @struct st_ble_l2cap_cf_credit_evt_t
 * @brief  Credit parameters of local or remote device.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief CID identifying the L2CAP CBFC Channel.
     */
    uint16_t cid;

    /**
     *  @brief PSM allocated by the cid field.
     */
    uint16_t psm;

    /**
     *  @brief Current credit of local/remote device.
     */
    uint16_t credit;
} st_ble_l2cap_cf_credit_evt_t;

/******************************************************************************************************************//**
 * @struct st_ble_l2cap_cf_disconn_evt_t
 * @brief  Disconnection parameters.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief CID identifying the L2CAP CBFC Channel that has been disconnected.
     */
    uint16_t cid;
} st_ble_l2cap_cf_disconn_evt_t;

/******************************************************************************************************************//**
 * @struct st_ble_l2cap_rej_evt_t
 * @brief  Command Reject parameters.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief  The reason that the remote device has sent Command Reject.
     */
    uint16_t reason;

    /**
     *  @brief  Optional information about the reason that the remote device has sent Command Reject.
     */
    uint16_t data_1;

    /**
     *  @brief  Optional information about the reason that the remote device has sent Command Reject.
     */
    uint16_t data_2;
} st_ble_l2cap_rej_evt_t;

/******************************************************************************************************************//**
 * @struct st_ble_l2cap_cf_evt_data_t
 * @brief st_ble_l2cap_cf_evt_data_t is the type of the data notified in a L2CAP Event.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief  Connection handle identifying the remote device.
     */
    uint16_t conn_hdl;

    /**
     *  @brief  The size of L2CAP Event parameters.
     */
    uint16_t param_len;

    /**
     *  @brief  L2CAP Event parameters. This parameter differs in each L2CAP Event.
     */
    void * p_param;
} st_ble_l2cap_cf_evt_data_t;

/******************************************************************************************************************//**
 * @typedef ble_l2cap_cf_app_cb_t
 * @brief   ble_l2cap_cf_app_cb_t is the L2CAP Event callback function type.
 * @param[in] event_type    The type of L2CAP Event.
 * @param[in] event_result  The result of L2CAP Event
 * @param[in] p_event_data    Data notified by L2CAP Event.
 * @return none
 *********************************************************************************************************************/
typedef void (* ble_l2cap_cf_app_cb_t)(uint16_t event_type, ble_status_t event_result,
                                       st_ble_l2cap_cf_evt_data_t * p_event_data);

/*@}*/

/* ================================================ L2CAP Event Code =============================================== */

/** @addtogroup L2CAP_API
 *  @ingroup BLE_API
 *  @{
 */

/******************************************************************************************************************//**
 * @ingroup L2CAP_API
 * @enum e_r_ble_l2cap_cf_evt_t
 * @brief  L2CAP Event Identifier
 *********************************************************************************************************************/
typedef enum
{
    /**
     *  @brief After the connection request for L2CAP CBFC Channel has been sent with R_BLE_L2CAP_ReqCfConn(),
     *         when the L2CAP CBFC Channel connection response has been received,
     *         BLE_L2CAP_EVENT_CF_CONN_CNF event occurs.
     *
     * ## Event Code: 0x5001
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_RSP_TIMEOUT(0x0011)</td>
     *                  <td>L2CAP Command timeout.</td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_L2CAP_PSM_NOT_SUPPORTED(0x4002)</td>
     *                  <td>PSM specified by R_BLE_L2CAP_ReqCfConn() is not supported.</td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_L2CAP_NO_RESOURCE(0x4004)</td>
     *                  <td>No resource for connection.</td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_L2CAP_INSUF_AUTHEN(0x4005)</td>
     *                  <td>Insufficient authentication.</td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_L2CAP_INSUF_AUTHOR(0x4006)</td>
     *                  <td>Insufficient authorization.</td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_L2CAP_INSUF_ENC_KEY_SIZE(0x4007)</td>
     *                  <td>Insufficient encryption key size.</td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_L2CAP_REFUSE_INSUF_ENC(0x4008)</td>
     *                  <td>Insufficient encryption.</td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_L2CAP_REFUSE_INVALID_SCID(0x4009)</td>
     *                  <td> Invalid Source CID. </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_L2CAP_REFUSE_SCID_ALREADY_ALLOC(0x400A)</td>
     *                  <td>Source CID already allocated.</td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_L2CAP_REFUSE_UNACCEPTABLE_PARAM(0x400B)</td>
     *                  <td>Unacceptable parameters.</td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_l2cap_cf_conn_evt_t
     */
    BLE_L2CAP_EVENT_CF_CONN_CNF = 0x5001,

    /**
     *  @brief  When a connection request for L2CPA CBFC Channel has been received from a remote device,
     *          BLE_L2CAP_EVENT_CF_CONN_IND event occurs.
     *
     * ## Event Code: 0x5002
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_NOT_FOUND(0x000D)</td>
     *                  <td>CF connection request has not been received or lcid not found. </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_L2CAP_PSM_NOT_SUPPORTED(0x4002)</td>
     *                  <td>PSM specified by R_BLE_L2CAP_ReqCfConn() is not supported.</td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_l2cap_cf_conn_evt_t
     */
    BLE_L2CAP_EVENT_CF_CONN_IND = 0x5002,

    /**
     *  @brief  After local device has sent a disconnection request for L2CAP CBFC Channel by
     *          R_BLE_L2CAP_DisconnectCf(), when the local device has received the response,
     *          BLE_L2CAP_EVENT_CF_DISCONN_CNF event occurs.
     *
     * ## Event Code: 0x5003
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_l2cap_cf_disconn_evt_t
     */
    BLE_L2CAP_EVENT_CF_DISCONN_CNF = 0x5003,

    /**
     *  @brief  When local device has received a disconnection request for L2CAP CBFC Channel from the remote device,
     *          BLE_L2CAP_EVENT_CF_DISCONN_IND event occurs.\n
     *          Host stack automatically replies the to the disconnection request.
     *
     * ## Event Code: 0x5004
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_l2cap_cf_disconn_evt_t
     */
    BLE_L2CAP_EVENT_CF_DISCONN_IND = 0x5004,

    /**
     *  @brief  When local device has received data on L2CAP CBFC Channel, BLE_L2CAP_EVENT_CF_RX_DATA_IND event occurs.
     *
     * ## Event Code: 0x5005
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_l2cap_cf_data_evt_t
     */
    BLE_L2CAP_EVENT_CF_RX_DATA_IND = 0x5005,

    /**
     *  @brief  When the credit of the L2CAP CBFC Channel has reached the Low Water Mark,
     *          BLE_L2CAP_EVENT_CF_LOW_RX_CRD_IND event occurs.
     *
     * ## Event Code: 0x5006
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_l2cap_cf_credit_evt_t
     */
    BLE_L2CAP_EVENT_CF_LOW_RX_CRD_IND = 0x5006,

    /**
     *  @brief  When local device has received credit from a remote device, BLE_L2CAP_EVENT_CF_TX_CRD_IND event occurs.
     *
     * ## Event Code: 0x5007
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_l2cap_cf_credit_evt_t
     */
    BLE_L2CAP_EVENT_CF_TX_CRD_IND = 0x5007,

    /**
     *  @brief  When the data transmission has been completed from host stack to Controller,
     *          BLE_L2CAP_EVENT_CF_TX_DATA_CNF event occurs.
     *
     * ## Event Code: 0x5008
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_DISCONNECTED(0x000F)  </td>
     *                  <td>While transmitting data, L2CAP CBFC Channel has been disconnected.</td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_l2cap_cf_data_evt_t
     */
    BLE_L2CAP_EVENT_CF_TX_DATA_CNF = 0x5008,

    /**
     *  @brief  When local device has received Command Reject PDU, BLE_L2CAP_EVENT_CMD_REJ event occurs.
     *
     * ## Event Code: 0x5009
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_l2cap_rej_evt_t
     */
    BLE_L2CAP_EVENT_CMD_REJ = 0x5009
} e_r_ble_l2cap_cf_evt_t;

/*@}*/

/* ======================================== Vendor Specific Type Definitions ======================================= */

/** @addtogroup VS_API
 *  @ingroup BLE_API
 *  @{
 */

/******************************************************************************************************************//**
 *  @ingroup VS_API
 *  @struct st_ble_vs_tx_test_param_t
 *  @brief  This is the extended transmitter test parameters used in R_BLE_VS_StartTxTest().
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief Channel used in Tx test.
     */
    uint8_t ch;

    /**
     *  @brief Length(in bytes) of the packet used in Tx Test.
     */
    uint8_t test_data_len;

    /**
     *  @brief Packet Payload.
     */
    uint8_t packet_payload;

    /**
     *  @brief Transmitter PHY used in test.
     */
    uint8_t phy;

    /**
     *  @brief Tx Power Level used in DTM Tx Test.
     */
    uint8_t tx_power;

    /**
     *  @brief Option.
     */
    uint8_t option;

    /**
     *  @brief The number of packet to be sent.
     */
    uint16_t num_of_packet;
} st_ble_vs_tx_test_param_t;

/******************************************************************************************************************//**
 *  @struct st_ble_vs_rx_test_param_t
 *  @brief  This is the extended receiver test parameters used in R_BLE_VS_StartRxTest().
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief Channel used in Rx test.
     */
    uint8_t ch;

    /**
     *  @brief Receiver PHY used in the test.
     */
    uint8_t phy;
} st_ble_vs_rx_test_param_t;

/******************************************************************************************************************//**
 *  @struct st_ble_vs_set_rf_ctrl_param_t
 *  @brief  This is the RF parameters used in R_BLE_VS_SetRfControl().
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief RF power on/off.
     */
    uint8_t power;

    /**
     *  @brief This field indicates whether the parameters change in RF power on.
     */
    uint8_t option;

    /**
     *  @brief RF rapid clock frequency adjust value(OSC internal CL adjust).
     */
    uint8_t clval;

