fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
    /**
     *  @brief RF slow clock configurations.
     */
    uint8_t slow_clock;

    /**
     *  @brief Set tx power in power on.
     */
    uint8_t tx_power;

    /**
     *  @brief Set RF option.
     */
    uint8_t rf_option;
} st_ble_vs_set_rf_ctrl_param_t;

/******************************************************************************************************************//**
 *  @struct st_ble_vs_test_end_evt_t
 *  @brief  This structure notifies that the extended test has been terminated.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief The number of packet successfully received in the receiver test.
     */
    uint16_t num_of_packet;

    /**
     *  @brief The number of CRC error packets in the receiver test.
     */
    uint16_t num_of_crc_err_packet;

    /**
     *  @brief Average RSSI(dBm) in the receiver test.
     */
    int8_t ave_rssi;

    /**
     *  @brief Maximum RSSI(dBm) in the receiver test.
     */
    int8_t max_rssi;

    /**
     *  @brief Minimum RSSI(dBm) in the receiver test.
     */
    int8_t min_rssi;
} st_ble_vs_test_end_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_vs_set_tx_pwr_comp_evt_t
 *  @brief  This structure notifies that tx power has been set.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief Connection handle that identifying the link whose tx power has been set.
     */
    uint16_t conn_hdl;

    /**
     *  @brief Tx power that has been set(dBm).
     */
    int8_t curr_tx_pwr;
} st_ble_vs_set_tx_pwr_comp_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_vs_get_tx_pwr_comp_evt_t
 *  @brief  This structure notifies that tx power has been retrieved.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief Connection handle that identifying the link whose tx power has been retrieved.
     */
    uint16_t conn_hdl;

    /**
     *  @brief Current tx power(dBm).
     */
    int8_t curr_tx_pwr;

    /**
     *  @brief Maximum tx power(dBm).
     */
    int8_t max_tx_pwr;
} st_ble_vs_get_tx_pwr_comp_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_vs_set_rf_ctrl_comp_evt_t
 *  @brief  This structure notifies that RF has been configured.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief The result of RF power control.
     */
    uint8_t ctrl;
} st_ble_vs_set_rf_ctrl_comp_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_vs_get_bd_addr_comp_evt_t
 *  @brief  This structure notifies that BD_ADDR has been retrieved.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief The area that public/random address has been retrieved.
     *    |  value                              |   description       |
     *    |:------------------------------------|:------------------- |
     *    | BLE_VS_ADDR_AREA_REG(0x00)          | Register.           |
     *    | BLE_VS_ADDR_AREA_DATA_FLASH(0x01)   | Data Flash.         |
     */
    uint8_t area;

    /**
     *  @brief The address that has been retrieved.
     */
    st_ble_dev_addr_t addr;
} st_ble_vs_get_bd_addr_comp_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_vs_get_rand_comp_evt_t
 *  @brief  This structure notifies that random number has been generated.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief Length of random number.
     */
    uint8_t rand_size;

    /**
     *  @brief Random number.
     */
    uint8_t * p_rand;
} st_ble_vs_get_rand_comp_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_vs_tx_flow_chg_evt_t
 *  @brief  This structure notifies that the state transition of TxFlow has been changed.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     * @brief The state of the flow control.
     * |        value                 |   description                                                              |
     * |:---------------------------- |:-------------------------------------------------------------------------- |
     * | BLE_VS_TX_FLOW_CTL_ON(0x00)  | The number of buffer has reached the High Water Mark from flow off state.  |
     * | BLE_VS_TX_FLOW_CTL_OFF(0x01) | The number of buffer has reached the Low Water Mark from flow on state.    |
     */
    uint8_t state;

    /**
     *  @brief The number of the current transmission buffers.
     */
    uint32_t buffer_num;
} st_ble_vs_tx_flow_chg_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_vs_evt_data_t
 *  @brief  st_ble_vs_evt_data_t is the type of the data notified in a Vendor Specific Event.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief The size of Vendor Specific Event parameters.
     */
    uint16_t param_len;

    /**
     *  @brief Vendor Specific Event parameters. This parameter differs in each Vendor Specific Event.
     */
    void * p_param;
} st_ble_vs_evt_data_t;

/******************************************************************************************************************//**
 *  @struct st_ble_vs_get_scan_ch_map_comp_evt_t
 *  @brief  This structure notifies that current scan channel map.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief The result of current scan channel map.
     */
    uint8_t ch_map;
} st_ble_vs_get_scan_ch_map_comp_evt_t;

/******************************************************************************************************************//**
 *  @struct st_ble_vs_get_fw_version_comp_evt_t
 *  @brief  This structure notifies the current firmware version.
 *********************************************************************************************************************/
typedef struct BLE_PACKED_OPTION
{
    /**
     *  @brief The result of get firmware version.
     */
    uint8_t major;
    uint8_t minor;
    uint8_t special;
} st_ble_vs_get_fw_version_comp_evt_t;

/******************************************************************************************************************//**
 * @typedef ble_vs_app_cb_t
 * @brief   ble_vs_app_cb_t is the Vendor Specific Event callback function type.
 * @param[in] event_type    The type of Vendor Specific Event.
 * @param[in] event_result  The result of API call which generates the Vendor Specific Event.
 * @param[in] p_event_data  Data notified in the Vendor Specific Event.
 * @return none
 *********************************************************************************************************************/
typedef void (* ble_vs_app_cb_t)(uint16_t event_type, ble_status_t event_result, st_ble_vs_evt_data_t * p_event_data);

/*@}*/

/* =========================================== Vendor Specific Event Code ========================================== */

/** @addtogroup VS_API
 *  @ingroup BLE_API
 *  @{
 */

/******************************************************************************************************************//**
 * @ingroup VS_API
 * @enum e_r_ble_vs_evt_t
 * @brief  Vendor Specific Event Identifier
 *********************************************************************************************************************/
typedef enum
{
    /**
     *  @brief This event notifies that the tx power has been set by R_BLE_VS_SetTxPower().
     *
     * ## Event Code: 0x8001
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_ARG(0x0003)</td>
     *                  <td>The tx_power parameter specified by R_BLE_VS_SetTxPower() is out of range.</td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_HDL(0x000E)</td>
     *                  <td>The link identified with the conn_hdl specified by R_BLE_VS_SetTxPower() is not found.</td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_vs_set_tx_pwr_comp_evt_t
     */
    BLE_VS_EVENT_SET_TX_POWER = 0x8001,

    /**
     *  @brief This event notifies that the tx power has been retrieved by R_BLE_VS_GetTxPower().
     *
     * ## Event Code: 0x8002
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_HDL(0x000E)</td>
     *                  <td>The link identified with the conn_hdl specified by R_BLE_VS_GetTxPower() is not found.</td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_vs_get_tx_pwr_comp_evt_t
     */
    BLE_VS_EVENT_GET_TX_POWER = 0x8002,

    /**
     *  @brief This event notifies that the extended transmitter test has been started by R_BLE_VS_StartTxTest().
     *
     * ## Event Code: 0x8003
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_ARG(0x0003)</td>
     *                  <td>The parameter specified by R_BLE_VS_StartTxTest() is out of range.</td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_VS_EVENT_TX_TEST_START = 0x8003,

    /**
     *  @brief This event notifies that the number specified by R_BLE_VS_StartTxTest() of packets has been sent.
     *
     * ## Event Code: 0x8004
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_VS_EVENT_TX_TEST_TERM = 0x8004,

    /**
     *  @brief This event notifies that the extended receiver test has been started by R_BLE_VS_StartRxTest().
     *
     * ## Event Code: 0x8005
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_ARG(0x0003)</td>
     *                  <td>The parameter specified by R_BLE_VS_StartRxTest() is out of range.</td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_VS_EVENT_RX_TEST_START = 0x8005,

    /**
     *  @brief This event notifies that the extended test has been terminated by R_BLE_VS_EndTest().
     *
     * ## Event Code: 0x8006
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_vs_test_end_evt_t
     */
    BLE_VS_EVENT_TEST_END = 0x8006,

    /**
     *  @brief This event notifies that the coding scheme has been configured by R_BLE_VS_SetCodingScheme().
     *
     * ## Event Code: 0x8007
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_ARG(0x0003)</td>
     *                  <td>The coding_scheme parameter specified by R_BLE_VS_SetCodingScheme() is out of range.</td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_VS_EVENT_SET_CODING_SCHEME_COMP = 0x8007,

    /**
     *  @brief This event notifies that the RF has been configured by R_BLE_VS_SetRfControl().
     *
     * ## Event Code: 0x8008
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_ARG(0x0003)</td>
     *                  <td>The parameter specified by R_BLE_VS_SetRfControl() is out of range.</td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_OPERATION(0x0009)</td>
     *                  <td>During the power on or the power off, the same power state is specified
     *                      by R_BLE_VS_SetRfControl().</td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_vs_set_rf_ctrl_comp_evt_t
     */
    BLE_VS_EVENT_RF_CONTROL_COMP = 0x8008,

    /**
     *  @brief This event notifies that public/random address has been set by R_BLE_VS_SetBdAddr().
     *
     * ## Event Code: 0x8009
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_ARG(0x0003)</td>
     *                  <td>The area parameter or the type field in the p_addr parameter specified
     *                      by R_BLE_VS_SetBdAddr() is out of range.</td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_VS_EVENT_SET_ADDR_COMP = 0x8009,

    /**
     *  @brief This event notifies that public/random address has been retrieved by R_BLE_VS_GetBdAddr().
     *
     * ## Event Code: 0x800A
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_ARG(0x0003)</td>
     *                  <td>The area parameter or the type field in the p_addr parameter specified
     *                      by R_BLE_VS_GetBdAddr() is out of range.</td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_vs_get_bd_addr_comp_evt_t
     */
    BLE_VS_EVENT_GET_ADDR_COMP = 0x800A,

    /**
     *  @brief This event notifies the application layer that random number has been generated by R_BLE_VS_GetRand().
     *
     * ## Event Code: 0x800B
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_ARG(0x0003)</td>
     *                  <td>The rand_size parameter specified by R_BLE_VS_GetRand() is out of range.</td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_vs_get_rand_comp_evt_t
     */
    BLE_VS_EVENT_GET_RAND = 0x800B,

    /**
     *  @brief This event notifies the application layer of the state transition of TxFlow.
     *
     * ## Event Code: 0x800C
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_vs_tx_flow_chg_evt_t
     */
    BLE_VS_EVENT_TX_FLOW_STATE_CHG = 0x800C,

    /**
     *  @brief This event notifies a failure occurs in RF. After receiving the event, reset MCU or RF.
     *
     * ## Event Code: 0x800D
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  None
     */
    BLE_VS_EVENT_FAIL_DETECT = 0x800D,

    /**
     *  @brief This event notifies that scan channel map has been set by R_BLE_VS_SetScanChMap().
     *
     * ## Event Code: 0x800E
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *              <tr>
     *                  <td class="paramname">BLE_ERR_INVALID_ARG(0x0003)</td>
     *                  <td>The ch_map parameter specified by R_BLE_VS_SetScanChMap() is out of range.</td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_VS_EVENT_SET_SCAN_CH_MAP = 0x800E,

    /**
     *  @brief This event notifies that scan channel map has been retrieved by R_BLE_VS_GetScanChMap().
     *
     * ## Event Code: 0x800F
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_vs_get_scan_ch_map_comp_evt_t
     */
    BLE_VS_EVENT_GET_SCAN_CH_MAP = 0x800F,

    /**
     *  @brief This event notifies that START_FW_UPDATE command has completed.
     *
     * ## Event Code: 0x072C
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_VS_EVENT_START_FW_UPDATE_COMP = 0x072C,

    /**
     *  @brief This event notifies that SEND_FW_DATA command has completed.
     *
     * ## Event Code: 0x072D
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_VS_EVENT_SEND_FW_DATA_COMP = 0x072D,

    /**
     *  @brief This event notifies that END_FW_UPDATE command has completed.
     *
     * ## Event Code: 0x072E
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_VS_EVENT_END_FW_UPDATE_COMP = 0x072E,

    /**
     *  @brief This event notifies that END_FW_UPDATE command has completed.
     *
     * ## Event Code: 0x0772
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  st_ble_vs_get_fw_version_comp_evt_t
     */
    BLE_VS_EVENT_GET_FW_VERSION_COMP = 0x0772,

    /**
     *  @brief This event notifies that module is ready.
     *
     * ## Event Code: 0x0746
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_VS_EVENT_MODULE_READY_COMP = 0x0746,

    /**
     *  @brief This event notifies that OTA firmware update has been started.
     *
     * ## Event Code: 0x09B0
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_VS_EVENT_OTA_START_NOTIFY = 0x09B0,

    /**
     *  @brief This event notifies that OTA firmware update has been completed successfully.
     *
     * ## Event Code: 0x09C0
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_VS_EVENT_OTA_END_NOTIFY = 0x09C0,

