fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
    /**
     *  @brief This event notifies that OTA firmware update has failed.
     *
     * ## Event Code: 0x09D0
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_VS_EVENT_OTA_ERROR_NOTIFY = 0x09D0,

    /**
     *  @brief  Invalid VS Event.
     *
     * ## Event Code: 0x80FF
     *
     *  ## result:
     *  <dl class="retval"><dt><dd>
     *          <table class="retval">
     *              <tr>
     *                  <td class="paramname">BLE_SUCCESS(0x0000)</td>
     *                  <td>Success </td>
     *              </tr>
     *          </table>
     *  </dd></dt></dl>
     *
     *  ## Event Data:
     *  none
     */
    BLE_VS_EVENT_INVALID = 0x80FF
} e_r_ble_vs_evt_t;

/*@}*/

/* ============================================= APP Callback Definition =========================================== */

typedef void (* ble_app_init_cb_t)(uint8_t param);

/* ============================================ Event Callback Definition ========================================== */

/******************************************************************************************************************//**
 * @ingroup BLE_API
 * @typedef ble_event_cb_t
 * @brief   ble_event_cb_t is the callback function type for R_BLE_SetEvent().
 * @return none
 *********************************************************************************************************************/
typedef void (* ble_event_cb_t)(void);

/* ============================================== MAIN API Declarations ============================================ */

/** @addtogroup BLE_API
 *  @{
 */

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_Open(void)
 * @brief   Open the BLE protocol stack.
 * @details This function should be called once before using the BLE protocol stack.
 * @retval  BLE_SUCCESS(0x0000) Success
 *********************************************************************************************************************/
ble_status_t R_BLE_Open(void);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_Close(void)
 * @brief   Close the BLE protocol stack.
 * @details This function should be called once to close the BLE protocol stack.
 * @retval  BLE_SUCCESS(0x0000) Success
 *********************************************************************************************************************/
ble_status_t R_BLE_Close(void);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_Execute(void)
 * @brief   Execute the BLE task.
 * @details This  handles all the task queued in the BLE protocol stack internal task queue and return.
 *          This function should be called repeatedly in the main loop.
 * @retval  BLE_SUCCESS(0x0000) Success
 *********************************************************************************************************************/
ble_status_t R_BLE_Execute(void);

/******************************************************************************************************************//**
 * @fn uint32_t R_BLE_IsTaskFree(void)
 * @brief   Check the BLE task queue is free or not.
 * @details This function returns the BLE task queue free status.
 *          When this function returns 0x0, call R_BLE_Execute() to execute the BLE task.
 * @retval  0x0 BLE task queue is not free
 * @retval  0x1 BLE task queue is free
 *********************************************************************************************************************/
uint32_t R_BLE_IsTaskFree(void);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_SetEvent(ble_event_cb_t cb)
 * @brief   Set event.
 * @details This function add an event in the BLE protocol stack internal queue. The event is handled in R_BLE_Execute
 *          just like Bluetooth event. This function is intended to be called in hardware interrupt context.
 *          Even if calling this function with the same cb before the cb is invoked, only one event is registered.
 *          The maximum number of the events can be registered at a time is eight.
 * @param   cb The callback for the event.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_ALREADY_IN_PROGRESS(0x000A) The event already registered with the callback.
 * @retval  BLE_ERR_CONTEXT_FULL(0x000B) No free slot for the event.
 *********************************************************************************************************************/
ble_status_t R_BLE_SetEvent(ble_event_cb_t cb);

/******************************************************************************************************************//**
 * @fn uint32_t R_BLE_GetVersion(void)
 * @brief   Get the BLE FIT module version.
 * @details This function returns the BLE FIT module version. \n
 *          The major version(BLE_VERSION_MAJOR) is contained in the two most significant bytes,
 *          and the minor version(BLE_VERSION_MINOR) occupies the remaining two bytes.
 * @retval  "BLE_VERSION_MAJOR | BLE_VERSION_MINOR"
 *********************************************************************************************************************/
uint32_t R_BLE_GetVersion(void);

/******************************************************************************************************************//**
 * @fn uint32_t R_BLE_GetLibType(void)
 * @brief   Get the type of BLE protocol stack library.
 * @details This function returns the type of BLE protocol stack library.
 * @retval  BLE_LIB_EXTENDED(0x00)   Extended
 * @retval  BLE_LIB_BALANCE(0x01)    Balance
 * @retval  BLE_LIB_COMPACT(0x02)    Compact
 *********************************************************************************************************************/
uint32_t R_BLE_GetLibType(void);

/*@}*/

/* ============================================== GAP API Declarations ============================================= */

/** @defgroup GAP_API GAP
 *  @ingroup BLE_API
 *  @{
 */

/******************************************************************************************************************//**
 * @ingroup GAP_API
 * @fn ble_status_t R_BLE_GAP_Init(ble_gap_app_cb_t gap_cb)
 * @brief   Initialize the Host Stack.
 * @details Host stack is initialized with this function. Before using All the R_BLE APIs,
 *          it's necessary to call this function. A callback function is registered with this function.
 *          In order to receive the GAP event, it's necessary to register a callback function.
 *          The result of this API call is notified in BLE_GAP_EVENT_STACK_ON event.
 * @param[in] gap_cb A callback function registered with this function.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) gap_cb is specified as NULL.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The reason for this error is as follows:
 *          - Host Stack was already initialized.
 *          - The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_Init(ble_gap_app_cb_t gap_cb);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_Terminate(void)
 * @brief   Terminate the Host Stack.
 * @details Host stack is terminated with this function.
 *          In order to reset all the Bluetooth functions, it's necessary to call this function.
 *          The result of this API call is notified in BLE_GAP_EVENT_STACK_OFF event.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_STATE(0x0008) Host stack hasn't been initialized.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_Terminate(void);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_UpdConn(uint16_t conn_hdl,
 *                                    uint8_t mode,
 *                                    uint16_t accept,
 *                                    st_ble_gap_conn_param_t * p_conn_updt_param
 *                                   )
 * @brief   Update the connection parameters.
 * @details This function updates the connection parameters or replies a request for
 *          updating connection parameters notified by BLE_GAP_EVENT_CONN_PARAM_UPD_REQ event.
 *          When the connection parameters has been updated,
 *          BLE_GAP_EVENT_CONN_PARAM_UPD_COMP event is notified to the application layer.
 * @param[in]   conn_hdl Connection handle identifying the link to be updated.
 * @param[in]   mode Connection parameter update request or response.
 *               |              macro                     |           description                                |
 *               |:-------------------------------------- |:---------------------------------------------------- |
 *               | BLE_GAP_CONN_UPD_MODE_REQ (0x01)       | Request for updating the connection parameters.      |
 *               | BLE_GAP_CONN_UPD_MODE_RSP (0x02)       | Reply a connection parameter update request.         |
 *
 * @param[in]   accept When mode is BLE_GAP_CONN_UPD_MODE_RSP,
 *                     accept or reject the connection parameters update request.
 *                     If mode is BLE_GAP_CONN_UPD_MODE_REQ, accept is ignored.
 *               |              macro                     |           description             |
 *               |:-------------------------------------- |:--------------------------------- |
 *               | BLE_GAP_CONN_UPD_ACCEPT (0x0000)       | Accept the update request.        |
 *               | BLE_GAP_CONN_UPD_REJECT (0x0001)       | Reject the update request.        |
 *
 * @param[in]   p_conn_updt_param Connection parameters to be updated.
 *                                When mode is BLE_GAP_CONN_UPD_MODE_RSP and
 *                                accept is BLE_GAP_CONN_UPD_REJECT, p_conn_updt_param is ignored.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) When accept is BLE_GAP_CONN_UPD_ACCEPT,
 *                                      p_conn_updt_param is specified as NULL.
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The following is out of range.
 *                                      - mode
 *                                      - accept
 *                                      - conn_intv_min field in p_conn_updt_param
 *                                      - conn_intv_max field in p_conn_updt_param
 *                                      - conn_latency in p_conn_updt_param
 *                                      - sup_to in p_conn_updt_param
 *                                      - conn_hdl
 * @retval  BLE_ERR_INVALID_STATE(0x0008) Not connected with the remote device.
 * @retval  BLE_ERR_CONTEXT_FULL(0x000B)  Sending a L2CAP command, an error occurred.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The remote device specified by conn_hdl is not found.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_UpdConn(uint16_t                  conn_hdl,
                               uint8_t                   mode,
                               uint16_t                  accept,
                               st_ble_gap_conn_param_t * p_conn_updt_param);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_SetDataLen(uint16_t conn_hdl, uint16_t tx_octets, uint16_t tx_time)
 * @brief   Update the packet size and the packet transmit time.
 * @details This function requests for changing the maximum transmission packet size
 *          and the maximum packet transmission time.
 *          When Controller has received the request from host stack,
 *          BLE_GAP_EVENT_SET_DATA_LEN_COMP event is notified to the application layer.
 *          When the transmission packet size or the transmission time has been changed,
 *          BLE_GAP_EVENT_DATA_LEN_CHG event is notified to the application layer.
 * @param[in] conn_hdl  Connection handle identifying the link whose the transmission packet size or
 *                      the transmission time to be changed.
 * @param[in] tx_octets Maximum transmission packet size.
 *                      Valid range is 0x001B - 0x00FB.
 * @param[in] tx_time   Maximum transmission time(us).
 *                     Valid range is 0x0148 - 0x4290.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_SetDataLen(uint16_t conn_hdl, uint16_t tx_octets, uint16_t tx_time);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_Disconnect(uint16_t conn_hdl, uint8_t reason)
 * @brief   Disconnect the link.
 * @details This function disconnects a link.
 *          When the link has disconnected, BLE_GAP_EVENT_DISCONN_IND event is notified to the application layer.
 * @param[in]   conn_hdl Connection handle identifying the link to be disconnected.
 * @param[in]   reason The reason for disconnection.
 *                     Usually, set 0x13 which indicates that a user disconnects the link.
 *                     If setting other than 0x13, refer the error code described
 *                     in Core Specification Vol.2 Part D ,"2 Error Code Descriptions".
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_ARG(0x0003) conn_hdl is out of range.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The remote device specified by conn_hdl is not found.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_Disconnect(uint16_t conn_hdl, uint8_t reason);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_SetPhy(uint16_t conn_hdl, st_ble_gap_set_phy_param_t * p_phy_param)
 * @brief   Set the phy for connection.
 * @details This function sets the PHY preferences for the connection.
 *          The result of this API call is notified in BLE_GAP_EVENT_PHY_SET_COMP event.
 *          When the PHY has been updated, BLE_GAP_EVENT_PHY_UPD event is notified to the application layer.
 *
 *          After PHY update, the PHY accept configuration of local device is the same as the values
 *          in BLE_GAP_EVENT_PHY_UPD event. \n
 *          For example, after calling R_BLE_GAP_SetPhy(), if tx_phy,
 *          rx_phy by BLE_GAP_EVENT_PHY_UPD event are updated to 2M PHY,
 *          the PHY accept configuration is 2M PHY only. \n
 *          Therefore after receiving BLE_GAP_EVENT_PHY_UPD event, if local device wants to accept the other PHY
 *          configuration, it needs to call R_BLE_GAP_SetPhy() with the desired PHY accept configuration.
 *
 *          Because the maximum transmission packet size or the maximum transmission time might be updated by
 *          PHY update, if the same packet size or transmission time as the previous one is desired,
 *          change the maximum transmission packet size or the maximum transmission time by
 *           @ref R_BLE_GAP_SetDataLen().
 *
 * @param[in] conn_hdl  Connection handle identifying the link whose PHY to be updated.
 * @param[in] p_phy_param PHY preferences.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) p_phy_param is specified as NULL.
 * @retval  BLE_ERR_INVALID_ARG(0x0003) conn_hdl or option field in p_phy_param is out of range.
 * @retval  BLE_ERR_UNSUPPORTED(0x0007) Not supported.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_SetPhy(uint16_t conn_hdl, st_ble_gap_set_phy_param_t * p_phy_param);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_SetDefPhy(st_ble_gap_set_def_phy_param_t * p_def_phy_param)
 * @brief   Set the default phy which allows remote device to change.
 * @details This function sets the PHY preferences which a remote device may change.
 *          The result of this API call is notified in BLE_GAP_EVENT_DEF_PHY_SET_COMP event.
 * @param[in] p_def_phy_param  The PHY preference which a remote device may change.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) p_def_phy_param is specified as NULL.
 * @retval  BLE_ERR_INVALID_ARG(0x0003) tx_phys or tx_phys field in p_def_phy_param is out of range.
 * @retval  BLE_ERR_UNSUPPORTED(0x0007) Not supported.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_SetDefPhy(st_ble_gap_set_def_phy_param_t * p_def_phy_param);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_SetPrivMode(st_ble_dev_addr_t * p_addr,
 *                                        uint8_t * p_privacy_mode,
 *                                        uint8_t device_num
 *                                       )
 * @brief   Set the privacy mode.
 * @details This function sets privacy mode for the remote device registered in Resolving List.
 *          By default, Network Privacy Mode is set.\n
 *          The result of this API call is notified in BLE_GAP_EVENT_PRIV_MODE_SET_COMP event.
 * @param[in] p_addr  An array of identity address of the remote device to set privacy mode.
 *                    The number of elements is specified by device_num.\n\n
 * @param[in] p_privacy_mode  An array of privacy mode to set to remote device.
 *            The number of elements is specified by device_num.\n
 *            The following value is set as the privacy mode.
 *               |              macro                     |           description             |
 *               |:-------------------------------------- |:--------------------------------- |
 *               | BLE_GAP_NET_PRIV_MODE (0x00)           | Network Privacy Mode.             |
 *               | BLE_GAP_DEV_PRIV_MODE (0x01)           | Device Privacy Mode.              |
 * @param[in] device_num  The number of devices to set privacy mode.
 *                        Valid range is 1-BLE_GAP_RSLV_LIST_MAX_ENTRY.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) p_addr or p_privacy_mode is specified as NULL.
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The following parameter is out of range.
 *                                       - The address type in p_addr.
 *                                       - The privacy mode specified by p_privacy_mode.
 *                                       - device_num
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The reason for this error is as follows:
 *                                         - While configuring privacy mode, this function was called.
 *                                         - The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_SetPrivMode(st_ble_dev_addr_t * p_addr, uint8_t * p_privacy_mode, uint8_t device_num);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_ConfWhiteList(uint8_t op_code, st_ble_dev_addr_t * p_addr, uint8_t device_num)
 * @brief   Set White List.
 * @details This function supports the following operations regarding White List.
 *          - Add the device to White List.
 *          - Delete the device from White List.
 *          - Clear White List.
 *
 *           The total number of White List entries is defined as BLE_GAP_WHITE_LIST_MAX_ENTRY.
 *           The result of this API call is notified in BLE_GAP_EVENT_WHITE_LIST_CONF_COMP event.
 * @param[in]  op_code
 *              The operation for  White List.
 *               |              macro            |           description            |
 *               |:----------------------------- |:-------------------------------- |
 *               | BLE_GAP_LIST_ADD_DEV(0x01)    | Add the device to the list.      |
 *               | BLE_GAP_LIST_REM_DEV(0x02)    | Delete the device from the list. |
 *               | BLE_GAP_LIST_CLR(0x03)        | Clear the list.                  |
 * @param[in]  p_addr An array of device address to add / delete to the list.
 *                    The number of elements is specified by device_num.
 *                    If op_code is BLE_GAP_LIST_CLR, p_addr is ignored.
 * @param[in]  device_num The number of devices add / delete to the list.
 *                        Valid range is 1-BLE_GAP_WHITE_LIST_MAX_ENTRY.
 *                        If op_code is BLE_GAP_LIST_CLR, device_num is ignored.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) When op_code is BLE_GAP_LIST_ADD_DEV or BLE_GAP_LIST_REM_DEV,
 *                                      p_addr is specified as NULL.
 * @retval  BLE_ERR_INVALID_ARG(0x0003) op_code or address type field in p_addr is out of range.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The reason for this error is as follows:
 *                                        - While operating White List, this function was called.
 *                                        - The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) There are no memories for operating the White List.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_ConfWhiteList(uint8_t op_code, st_ble_dev_addr_t * p_addr, uint8_t device_num);

