fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_GetVerInfo(void)
 * @brief   Get the version number of the Controller and the host stack.
 * @details This function retrieves the version information of local device.
 *          The result of this API call is notified in BLE_GAP_EVENT_LOC_VER_INFO event.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_GetVerInfo(void);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_ReadPhy(uint16_t conn_hdl)
 * @brief   Get the phy settings.
 * @details This function gets the PHY settings for the connection.
 *          The result of this API call is notified in BLE_GAP_EVENT_PHY_RD_COMP event.
 * @param[in] conn_hdl  Connection handle identifying the link whose PHY settings to be retrieved.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_ARG(0x0003) conn_hdl is out of range.
 * @retval  BLE_ERR_UNSUPPORTED(0x0007) Not supported.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_ReadPhy(uint16_t conn_hdl);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_ConfRslvList(uint8_t op_code,
 *                                         st_ble_dev_addr_t * p_addr,
 *                                         st_ble_gap_rslv_list_key_set_t * p_peer_irk,
 *                                         uint8_t device_num
 *                                         )
 * @brief   Set Resolving List.
 * @details This function supports the following operations regarding Resolving List.
 *          - Add the device to Resolving List.
 *          - Delete the device from Resolving List.
 *          - Clear Resolving List.
 *
 *           In order to generate a resolvable private address,
 *           a local IRK needs to be registered by R_BLE_GAP_SetLocIdInfo().
 *           If communicating with the identity address, register all-zero IRK as local IRK.
 *           In order to resolve resolvable private address of the remote device,
 *           the IRK distributed from the remote device needs to be added to Resolving List.
 *           The total number of Resolving List entries is defined as BLE_GAP_RESOLV_LIST_MAX_ENTRY.
 *           The result of this API call is notified in BLE_GAP_EVENT_RSLV_LIST_CONF_COMP event.
 * @param[in]  op_code
 *              The operation for Resolving List.
 *               |              macro            |           description            |
 *               |:----------------------------- |:-------------------------------- |
 *               | BLE_GAP_LIST_ADD_DEV(0x01)    | Add the device to the list.      |
 *               | BLE_GAP_LIST_REM_DEV(0x02)    | Delete the device from the list. |
 *               | BLE_GAP_LIST_CLR(0x03)        | Clear the list.                  |
 * @param[in]  p_addr An array of Identity Addresses to add / delete to the list.
 *                    The number of elements is specified by device_num.
 *                    If op_code is BLE_GAP_LIST_CLR, p_addr is ignored.
 * @param[in]  p_peer_irk The remote IRK and the type of local IRK added to Resolving List.
 *                        If op_code is other than BLE_GAP_LIST_ADD_DEV, p_peer_irk is ignored.
 *                        The number of elements is specified by device_num.
 * @param[in]  device_num The number of devices add / delete to the list.
 *                        Valid range is 1-BLE_GAP_RSLV_LIST_MAX_ENTRY.
 *                        If op_code is BLE_GAP_LIST_CLR, device_num is ignored.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) The reason for this error is as follows:
 *                                      - When added to or deleted from the list, p_addr is specified as NULL.
 *                                      - When added to the list, p_peer_irk is specified as NULL.
 *
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The reason for this error is as follows:
 *                                      - op_code is out of range.
 *                                      - When op_code is BLE_GAP_LIST_ADD_DEV or
 *                                        BLE_GAP_LIST_REM_DEV, device_num is out of range.
 *                                      - When op_code is BLE_GAP_LIST_ADD_DEV or
 *                                        BLE_GAP_LIST_REM_DEV, address type field in p_addr is out of range.
 *
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The reason for this error is as follows:
 *                                        - While operating Resolving List, this function was called.
 *                                        - The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) There are no memories for operating the Resolving List.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The specified Identity Address was not found in Resolving List.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_ConfRslvList(uint8_t                          op_code,
                                    st_ble_dev_addr_t              * p_addr,
                                    st_ble_gap_rslv_list_key_set_t * p_peer_irk,
                                    uint8_t                          device_num);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_EnableRpa(uint8_t enable)
 * @brief   Enable/Disable address resolution and generation of a resolvable private address.
 * @details This function enables or disables RPA functionality. The RPA functionality includes the following.
 *          - Generation of local resolvable private address
 *          - Resolution of remote resolvable private address
 *
 *          In order to do advertising, scanning or creating a link with local resolvable private address,
 *          the RPA functionality needs to be enabled.
 *          After enabling the RPA functionality and the identity address of remote device and
 *          the IRKs of local/remote device is registered,
 *          local device can generate own resolvable private address in the time interval set by R_BLE_GAP_SetRpaTo(),
 *          and can resolve a resolvable private address of a remote device.
 *          It is recommended that the RPA functionality is called immediately
 *          after the initialization by R_BLE_GAP_Init().
 *          The result of this API call is notified in BLE_GAP_EVENT_RPA_EN_COMP event.
 * @param[in] enable  Enable or disable address resolution function.
 *               |              macro              |           description                     |
 *               |:------------------------------- |:----------------------------------------- |
 *               | BLE_GAP_RPA_DISABLED(0x00)      | Disable RPA generation/resolution.        |
 *               | BLE_GAP_RPA_ENABLED(0x01)       | Enable RPA generation/resolution.         |
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_ARG(0x0003) enable is out of range.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_EnableRpa(uint8_t enable);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_SetRpaTo(uint16_t rpa_timeout)
 * @brief   Set the update time of resolvable private address.
 * @details This function sets the time interval to update the resolvable private address.
 *          The result of this API call is notified in BLE_GAP_EVENT_SET_RPA_TO_COMP event.
 * @param[in] rpa_timeout  Time interval to update resolvable private address in seconds.
 *                         Valid range is 0x003C - 0xA1B8.
 *                         Default is 900s.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_SetRpaTo(uint16_t rpa_timeout);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_ReadRpa(st_ble_dev_addr_t * p_addr)
 * @brief   Get the resolvable private address of local device.
 * @details This function retrieves the local resolvable private address.
 *          Before getting the address, enable the resolvable private address function by R_BLE_GAP_EnableRpa().
 *          The result of this API call is notified in BLE_GAP_EVENT_RD_RPA_COMP event.
 * @param[in] p_addr  Identity address registered in Resolving List.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) p_addr is specified as NULL.
 * @retval  BLE_ERR_INVALID_ARG(0x0003) Address type in p_addr is out of range.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The reason for this error is as follows.
 *                                        - When retrieving the local resolvable private address,
 *                                          this function was called.
 *                                        - The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_ReadRpa(st_ble_dev_addr_t * p_addr);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_ReadRssi(uint16_t conn_hdl)
 * @brief   Get RSSI.
 * @details This function retrieves RSSI.
 *          The result of this API call is notified in BLE_GAP_EVENT_RSSI_RD_COMP event.
 * @param[in] conn_hdl  Connection handle identifying the link whose RSSI to be retrieved.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_ARG(0x0003) conn_hdl is out of range.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_ReadRssi(uint16_t conn_hdl);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_ReadChMap(uint16_t conn_hdl)
 * @brief   Get the Channel Map.
 * @details This function retrieves the channel map.
 *          The result of this API call is notified in BLE_GAP_EVENT_CH_MAP_RD_COMP event.
 * @param[in] conn_hdl  Connection handle identifying the link whose channel map to be retrieved.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_ARG(0x0003) conn_hdl is out of range.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_ReadChMap(uint16_t conn_hdl);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_SetRandAddr(uint8_t * p_random_addr)
 * @brief   Set a random address.
 * @details This function sets static address or non-resolvable private address to Controller.
 *          Refer to Core Specification Vol 6, PartB,
 *          "1.3.2 Random Device Address" regarding the format of the random address.
 *          Resolvable private address cannot set by this API.
 *          The result of this API call is notified in BLE_GAP_EVENT_RAND_ADDR_SET_COMP event.
 * @param[in] p_random_addr  Static address or non-resolvable private address. \n
 *                           The BD address setting format is little endian.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) p_random_addr is specified as NULL.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_SetRandAddr(uint8_t * p_random_addr);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_SetAdvParam(st_ble_gap_adv_param_t * p_adv_param)
 * @brief   Set advertising parameters.
 * @details This function sets advertising parameters.
 *          It's possible to do advertising where the advertising parameters are different every each advertising set.
 *          The number of advertising set in the Controller is defined as BLE_MAX_NO_OF_ADV_SETS_SUPPORTED.
 *          Each advertising set is identified with advertising handle (0x00-0x03).
 *          Create an advertising set with this function before start advertising,
 *          setting periodic advertising parameters, start periodic advertising,
 *          setting advertising data/scan response data/periodic advertising data.
 *          The result of this API call is notified in BLE_GAP_EVENT_ADV_PARAM_SET_COMP event.
 * @param[in]   p_adv_param Advertising parameters.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) p_adv_param is specified as NULL.
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The below p_adv_param field value is out of range.
 *          - adv_handle
 *          - adv_intv_min/adv_intv_max
 *          - adv_ch_map
 *          - o_addr_type
 *          - p_addr_type
 *          - adv_phy
 *          - sec_adv_phy
 *          - scan_req_ntf_flag
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_SetAdvParam(st_ble_gap_adv_param_t * p_adv_param);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_SetAdvSresData(st_ble_gap_adv_data_t * p_adv_srsp_data)
 * @brief   Set advertising data/scan response data/periodic advertising data.
 * @details This function sets advertising data/scan response data/periodic advertising data to the advertising set.
 *          It is necessary to create an advertising set by R_BLE_GAP_SetAdvParam(), before calling this function.
 *          Set advertising data/scan response data/periodic advertising data,
 *          after allocating the memory for the data.
 *          The following shall be applied regarding the adv_prop_type field and the data_type field in
 *          st_ble_gap_adv_param_t parameter specified in R_BLE_GAP_SetAdvParam().
 *
 *          The following shall be applied regarding the adv_prop_type field and the data_type field in
 *          st_ble_gap_adv_param_t parameter specified in R_BLE_GAP_SetAdvParam().
 *          - When adv_prop_type is Legacy Advertising PDU type,
 *            - it's possible to set advertising data/scan response data up to 31 bytes.
 *            - advertising data/scan response data can be updated by this function in advertising.
 *          - When adv_prop_type is Extended Advertising PDU type,
 *            - it's possible to set at most 1650 bytes of data as advertising data/scan response data
 *              per 1 advertising set.
 *            - the total buffer size in Controller for advertising data/scan response data is 4250 bytes.
 *              Therefore please note that more than 4250 bytes of advertising data/scan response data
 *              can not be set to all the advertising sets.
 *              Please refer to Figure 1.1 and Figure 1.2 about examples of setting advertising
 *              data/scan response data.
 *            - it's possible to update advertising data/scan response data in advertising,
 *              if the data_length field in st_ble_gap_adv_data_t parameter is up to 251 bytes.
 *              @image html "adv_data_alloc_fail_en.svg" "Figure 1.1" width=700px
 *              @image html "adv_data_alloc_success_en.svg" "Figure 1.2" width=700px
 *          - When periodic advertising data is set,
 *            - At most 1650 bytes of data can be set to 1 advertising set.
 *            - The total buffer size in Controller for periodic advertising data is 4306 bytes.
 *              Therefore please note that more than 4306 bytes of periodic advertising data can not be
 *              set to all the advertising sets.
 *            - it's possible to update periodic advertising data in advertising,
 *              if the data_length field in st_ble_gap_adv_data_t parameter is up to 252 bytes.
 *
 *         The result of this API call is notified in @ref BLE_GAP_EVENT_ADV_DATA_UPD_COMP event.
 *
 * @param[in]   p_adv_srsp_data   Advertising data/scan response data/periodic advertising data.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) The reason for this error is as follows:
 *          - p_adv_srsp_data is specified as NULL.
 *          - data_length field in p_adv_srsp_data parameter is not 0 and p_data field is specified as NULL.
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The following field in p_adv_srsp_data parameter is out of range.
 *          - adv_hdl
 *          - data_type
 *          - data_length
 *          - zero_length_flag
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_SetAdvSresData(st_ble_gap_adv_data_t * p_adv_srsp_data);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_StartAdv(uint8_t adv_hdl, uint16_t duration, uint8_t max_extd_adv_evts)
 * @brief   Start advertising.
 * @details This function starts advertising.
 *          Create the advertising set specified with adv_hdl by R_BLE_GAP_SetAdvParam(),
 *          before calling this function.
 *          The result of this API call is notified in BLE_GAP_EVENT_ADV_ON event.
 * @param[in]   adv_hdl
 *              The advertising handle pointing to the advertising set which starts advertising.
 *              The valid range is 0x00 - 0x03.
 * @param[in]   duration
 *              The duration for which the advertising set identified by adv_hdl is enabled.
 *              Time = duration * 10ms.
 *              When the duration expires, BLE_GAP_EVENT_ADV_OFF event notifies that advertising is stopped.
 *              The valid range is 0x0000 - 0xFFFF.
 *              The duration parameter is ignored when the value is set to 0x0000.
 * @param[in]   max_extd_adv_evts
 *              The maximum number of advertising events that be sent during advertising.
 *              When all the advertising events(max_extd_adv_evts) have been sent,
 *              BLE_GAP_EVENT_ADV_OFF event notifies that advertising is stopped.
 *              The max_extd_adv_evts parameter is ignored when the value is set to 0x00.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_ARG(0x0003) adv_hdl is out of range.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_StartAdv(uint8_t adv_hdl, uint16_t duration, uint8_t max_extd_adv_evts);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_StopAdv(uint8_t adv_hdl)
 * @brief   Stop advertising.
 * @details This function stops advertising. The result of this API call is notified in BLE_GAP_EVENT_ADV_OFF event.
 * @param[in]   adv_hdl
 *              The advertising handle pointing to the advertising set which stops advertising.
 *              The valid range is 0x00 - 0x03.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_ARG(0x0003) adv_hdl is out of range.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_StopAdv(uint8_t adv_hdl);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_SetPerdAdvParam(st_ble_gap_perd_adv_param_t * p_perd_adv_param)
 * @brief   Set periodic advertising parameters.
 * @details This function sets periodic advertising parameters.
 *          Create the advertising set which supports Non-Connectable,
 *          Non-Scannable advertising by R_BLE_GAP_SetAdvParam() before setting periodic advertising parameters.
 *          The result of this API call is notified in BLE_GAP_EVENT_PERD_ADV_PARAM_SET_COMP event.
 * @param[in]  p_perd_adv_param  Periodic advertising parameters.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) p_perd_adv_param is specified as NULL.
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The following field in the p_perd_adv_param parameter is out of range.
 *          - adv_hdl
 *          - perd_intv_min or perd_intv_max
 *          - prop_type is neither 0x0000 nor 0x0040(BLE_GAP_PERD_PROP_TX_POWER)
 * @retval  BLE_ERR_UNSUPPORTED(0x0007) Not supported.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_SetPerdAdvParam(st_ble_gap_perd_adv_param_t * p_perd_adv_param);

