fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_StartPerdAdv(uint8_t adv_hdl)
 * @brief   Start periodic advertising.
 * @details This function starts periodic advertising.
 *          Set periodic advertising parameters to the advertising set, before starting periodic advertising.
 *          The result of this API call is notified in BLE_GAP_EVENT_PERD_ADV_ON event.
 * @param[in]  adv_hdl   Advertising handle identifying the advertising set which starts periodic advertising.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_ARG(0x0003) adv_hdl is out of range.
 * @retval  BLE_ERR_UNSUPPORTED(0x0007) Not supported.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_StartPerdAdv(uint8_t adv_hdl);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_StopPerdAdv(uint8_t adv_hdl)
 * @brief   Stop periodic advertising.
 * @details This function stops periodic advertising.
 *          If the return value of this API is BLE_SUCCESS, the result is notified in BLE_GAP_EVENT_PERD_ADV_OFF event.
 * @param[in]  adv_hdl   Specify the handle of Advertising Set to stop Periodic Advertising.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_ARG(0x0003) adv_hdl is out of range.
 * @retval  BLE_ERR_UNSUPPORTED(0x0007) Not supported.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_StopPerdAdv(uint8_t adv_hdl);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_GetRemainAdvBufSize(uint16_t * p_remain_adv_data_size,
 *                                                uint16_t * p_remain_perd_adv_data_size
 *                                               )
 * @brief   Get buffer size for advertising data/scan response data/periodic advertising data in the Controller.
 * @details This function gets the total size of advertising data/scan response data/periodic advertising data
 *          which can be currently set to Controller(all of the advertising sets).
 *          The application layer gets the data sizes via the parameters.
 *          By this API function call, no events occur.
 * @param[out]  p_remain_adv_data_size
 *              The free buffer size of Controller to which advertising data/scan response data can be currently set.
 * @param[out]  p_remain_perd_adv_data_size
 *              The free buffer size of Controller to which periodic advertising data can be currently set.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) p_remain_adv_data_size or p_remain_perd_adv_data_size is specified as NULL.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_GetRemainAdvBufSize(uint16_t * p_remain_adv_data_size, uint16_t * p_remain_perd_adv_data_size);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_RemoveAdvSet(uint8_t op_code, uint8_t adv_hdl)
 * @brief   Delete advertising set.
 * @details This function deletes an advertising set or deletes all the advertising sets.
 *          The result of this API call is notified in BLE_GAP_EVENT_ADV_SET_REMOVE_COMP event.
 * @param[in]  op_code The operation for delete or clear.
 *               |              macro               |           description            |
 *               |:-------------------------------- |:-------------------------------- |
 *               | BLE_GAP_RMV_ADV_SET_REM_OP(0x01) | Delete an advertising set.       |
 *               | BLE_GAP_RMV_ADV_SET_CLR_OP(0x02) | Delete all the advertising sets. |
 * @param[in]  adv_hdl
 *             Advertising handle identifying the advertising set deleted.
 *             If op_code is BLE_GAP_RMV_ADV_SET_CLR_OP, adv_hdl is ignored.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The reason for this error is as follows:
 *                                      - op_code is out of range.
 *                                      - When op_code is BLE_GAP_RMV_ADV_SET_REM_OP(0x01), adv_hdl is out of range.
 * @retval  BLE_ERR_UNSUPPORTED(0x0007) Not supported.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_RemoveAdvSet(uint8_t op_code, uint8_t adv_hdl);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_CreateConn(st_ble_gap_create_conn_param_t * p_param)
 * @brief   Request for a link establishment.
 * @details This function sends a connection request to a remote device to create a link.
 *          When Controller has received a request for establishment of a link from host stack,
 *          BLE_GAP_EVENT_CREATE_CONN_COMP event is notified to the application layer.
 *          When the link is established, BLE_GAP_EVENT_CONN_IND event is notified to the application layer.
 * @param[in] p_param Connection parameters.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) The reason for this error is as follows:
 *                                      - p_param is specified as NULL.
 *                                      - p_conn_param_1M field and p_conn_param_2M and
 *                                        p_conn_param_coded field in p_param are specified as NULL.
 *                                      - When creating a link with 1M PHY, p_conn_param
 *                                        in p_conn_param_1M field in p_param is specified as NULL.
 *                                      - When creating a link with 2M PHY,
 *                                        p_conn_param in p_conn_param_2M field in p_param is specified as NULL.
 *                                      - When creating a link with coded MPHY,
 *                                        p_conn_param in p_conn_param_coded field in p_param is specified as NULL.
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The reason for this error is as follows:
 *                                      - init_filter_policy in p_param is out of range.
 *                                      - remote_bd_addr_type field or own_addr_type address field
 *                                        in p_param is out of range.
 * @retval  BLE_ERR_UNSUPPORTED(0x0007) Not supported.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_CreateConn(st_ble_gap_create_conn_param_t * p_param);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_CancelCreateConn(void)
 * @brief   Cancel the request for a link establishment.
 * @details This function cancels a request for establishing a link.
 *          When Controller has received the cancel request from host stack,
 *          BLE_GAP_EVENT_CONN_CANCEL_COMP event is notified to the application layer.
 *          When the cancel procedure has completed,
 *          BLE_GAP_EVENT_CONN_IND event is notified to the application layer.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_UNSUPPORTED(0x0007) Not supported.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_CancelCreateConn(void);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_SetChMap(uint8_t * p_channel_map)
 * @brief   Set the Channel Map.
 * @details This function sets the channel map.
 *          The result of this API call is notified in BLE_GAP_EVENT_CH_MAP_SET_COMP event.
 * @param[in] p_channel_map  Channel map.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) p_channel_map is specified as NULL.
 * @retval  BLE_ERR_UNSUPPORTED(0x0007) Not supported.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_SetChMap(uint8_t * p_channel_map);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_StartScan(st_ble_gap_scan_param_t * p_scan_param,
 *                                      st_ble_gap_scan_on_t * p_scan_enable
 *                                     )
 * @brief   Set scan parameter and start scan.
 * @details This function starts scanning.
 *          When scanning for the first time, set the p_scan_param.
 *          Setting scan parameters can be omitted by specifying p_scan_param as NULL after next time.
 *          The result of this API call is notified in BLE_GAP_EVENT_SCAN_ON event.
 *          Advertising report is notified in BLE_GAP_EVENT_ADV_REPT_IND event.
 *          Figure 1.3 shows the relationship between scan period, scan duration, scan interval and scan window.
 *          @image html "scan_period_en.svg" "Figure 1.3"
 *
 *          When scan duration is non-zero, scan period is zero and scan duration expires,
 *          BLE_GAP_EVENT_SCAN_TO event is notified to the application layer.
 * @param[in]  p_scan_param
 *              Scan parameter.
 *              When p_scan_param is specified as NULL,
 *              host stack doesn't set scan parameters and start scanning with the previous parameters.
 * @param[in]  p_scan_enable
 *             Scan period, scan duration, duplicate filter and procedure type.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) The reason for this error is as follows:
 *                                      - p_scan_enable is specified as NULL.
 *                                      - p_phy_param_1M field and p_phy_param_coded field in
 *                                        p_scan_param are specified as NULL.
 *
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The reason for this error is as follows:
 *                                      - proc_type field in p_scan_enable is out of range.
 *                                      - filter_dups in p_scan_enable is out of range.
 *                                      - o_addr_type in p_scan_param is out of range.
 *                                      - filter_policy in p_scan_param is out of range.
 *                                      - scan_type of p_scan_param's p_phy_param_1M 
 *                                        or p_phy_param_coded is out of range.
 *
 * @retval  BLE_ERR_UNSUPPORTED(0x0007) Not supported.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_StartScan(st_ble_gap_scan_param_t * p_scan_param, st_ble_gap_scan_on_t * p_scan_enable);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_StopScan(void)
 * @brief   Stop scan.
 * @details This function stops scanning.
 *          The result of this API call is notified in BLE_GAP_EVENT_SCAN_OFF event.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_UNSUPPORTED(0x0007) Not supported.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_StopScan(void);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_CreateSync(st_ble_dev_addr_t * p_addr,
 *                                       uint8_t adv_sid,
 *                                       uint16_t skip,
 *                                       uint16_t sync_to
 *                                      )
 * @brief   Request for a periodic sync establishment.
 * @details This function sends a request for establishment of a periodic sync to a advertiser.
 *          In order to create a periodic sync, scan needs to be starting by R_BLE_GAP_StartScan().
 *          When Controller has received the request from host stack,
 *          BLE_GAP_EVENT_CREATE_SYNC_COMP event is notified to the application layer.
 *          When the periodic sync is established, BLE_GAP_EVENT_SYNC_EST event is notified to the application layer.
 * @param[in]  p_addr
 *             The address of periodic advertiser.When p_addr is specified as NULL,
 *             local device creates a periodic sync with the advertiser registered in Periodic Advertiser List.
 * @param[in]  adv_sid
 *             Advertising SID. When p_addr is specified as NULL, adv_sid is ignored.
 *             Valid range is 0x00 - 0x0F.
 * @param[in]  skip
 *             The number of consecutive periodic advertising packets
 *             that local device may skip after receiving a periodic advertising packet.
 *             Valid range is 0x0000 - 0x01F3.
 * @param[in]  sync_to
 *             The maximum permitted time between successful receives.When sync_to expires,
 *             the periodic sync is lost.
 *             Time(ms) = sync_to * 10.
 *             Valid range is 0x000A - 0x4000.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) p_addr is specified as NULL.
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The following parameter is out of range.
 *                                      - address type in p_addr
 *                                      - adv_sid
 *                                      - skip
 *                                      - sync_to
 *
 * @retval  BLE_ERR_UNSUPPORTED(0x0007) Not supported.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_CreateSync(st_ble_dev_addr_t * p_addr, uint8_t adv_sid, uint16_t skip, uint16_t sync_to);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_CancelCreateSync(void)
 * @brief   Cancel the request for a periodic sync establishment.
 * @details This function cancels a request for establishing a periodic sync.
 *          The result of this API call is notified in BLE_GAP_EVENT_SYNC_CREATE_CANCEL_COMP event.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_UNSUPPORTED(0x0007) Not supported.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_CancelCreateSync(void);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_TerminateSync(uint16_t sync_hdl)
 * @brief   Terminate the periodic sync.
 * @details This function terminates a periodic sync.
 *          The result of this API call is notified in BLE_GAP_EVENT_SYNC_TERM event.
 * @param[in]  sync_hdl Sync handle identifying the periodic sync to be terminated.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_ARG(0x0003) sync_hdl is out of range.
 * @retval  BLE_ERR_UNSUPPORTED(0x0007) Not supported.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_TerminateSync(uint16_t sync_hdl);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_ConfPerdAdvList(uint8_t op_code,
 *                                            st_ble_dev_addr_t * p_addr,
 *                                            uint8_t * p_adv_sid_set,
 *                                            uint8_t device_num
 *                                           )
 * @brief   Set Periodic Advertiser List.
 * @details This function supports the following operations regarding Periodic Advertiser List.
 *          - Add the device to Periodic Advertiser List.
 *          - Delete the device from Periodic Advertiser List.
 *          - Clear Periodic Advertiser List.
 *
 *           The total number of Periodic Advertiser List entries is defined as BLE_GAP_PERD_LIST_MAX_ENTRY.
 *           The result of this API call is notified in BLE_GAP_EVENT_PERD_LIST_CONF_COMP event.
 * @param[in]  op_code
 *              The operation for Periodic Advertiser List.
 *               |              macro            |           description            |
 *               |:----------------------------- |:-------------------------------- |
 *               | BLE_GAP_LIST_ADD_DEV(0x01)    | Add the device to the list.      |
 *               | BLE_GAP_LIST_REM_DEV(0x02)    | Delete the device from the list. |
 *               | BLE_GAP_LIST_CLR(0x03)        | Clear the list.                  |
 * @param[in]  p_addr An array of device address to add / delete to the list.
 *                    The number of elements is specified by device_num.
 *                    If op_code is BLE_GAP_LIST_CLR, p_addr is ignored.
 * @param[in]  p_adv_sid_set An array of SID of the advertiser to add / delete to the list.
 *                           The number of elements is specified by device_num.
 *                           If op_code is BLE_GAP_LIST_CLR, p_adv_sid_set is ignored.
 * @param[in]  device_num The number of devices add / delete to the list.
 *                        Valid range is 1-BLE_GAP_PERD_LIST_MAX_ENTRY.
 *                        If op_code is BLE_GAP_LIST_CLR, device_num is ignored.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) When op_code is BLE_GAP_LIST_ADD_DEV or BLE_GAP_LIST_REM_DEV,
 *                                      p_addr or p_adv_sid_set is specified as NULL.
 * @retval  BLE_ERR_INVALID_ARG(0x0003) op_code or address type field in p_addr or p_adv_sid_set or
 *                                      device_num is out of range.
 * @retval  BLE_ERR_UNSUPPORTED(0x0007) Not supported.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The reason for this error is as follows:
 *                                        - While operating Periodic Advertiser List, this function was called.
 *                                        - The task for host stack is not running.
 *
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) There are no memories for operating periodic advertiser.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_ConfPerdAdvList(uint8_t             op_code,
                                       st_ble_dev_addr_t * p_addr,
                                       uint8_t           * p_adv_sid_set,
                                       uint8_t             device_num);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_AuthorizeDev(uint16_t conn_hdl, uint8_t author_flag)
 * @brief   Authorize a remote device.
 * @details User authorizes a remote device by this function.
 *          This function is used when a remote device accesses a GATT Characteristic
 *          in local device which requests user authorization.
 *          The result of this API call is returned by a return value.
 * @param[in] conn_hdl  Connection handle identifying the remote device to be authorized or not by user.
 * @param[in] author_flag  Authorize or not the remote device.
 *               |              macro            |           description            |
 *               |:----------------------------- |:-------------------------------- |
 *               | BLE_GAP_NOT_AUTHORIZED(0x00)  | Not authorize the remote device. |
 *               | BLE_GAP_AUTHORIZED(0x01)      | Authorize the remote device.     |
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_ARG(0x0003) author_flag is out of range.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The remote device specified by conn_hdl is not found.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_AuthorizeDev(uint16_t conn_hdl, uint8_t author_flag);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_GetRemDevInfo(uint16_t conn_hdl)
 * @brief   Get the information about remote device.
 * @details This function retrieves information about the remote device.
 *          The information includes BD_ADDR, the version number and LE features.
 *          The result of this API call is notified in BLE_GAP_EVENT_GET_REM_DEV_INFO event.
 * @param[in] conn_hdl  Connection handle identifying the remote device whose information to be retrieved.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_GetRemDevInfo(uint16_t conn_hdl);

