fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_SetPairingParams(st_ble_gap_pairing_param_t * p_pair_param)
 * @brief   Set the parameters using pairing.
 * @details This function sets the parameters used in pairing.
 *          The parameters set by this API are sent to the remote device when pairing occurred.
 *          The result of this API call is returned by a return value.
 * @param[in] p_pair_param    Pairing parameters.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The following field in p_pair_param is out of range.
 *                                      - iocap
 *                                      - max_key_size
 *                                      - mitm
 *                                      - bonding
 *                                      - key_notf
 *                                      - sec_conn_only
 *
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_SetPairingParams(st_ble_gap_pairing_param_t * p_pair_param);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_SetLocIdInfo(st_ble_dev_addr_t * p_lc_id_addr, uint8_t * p_lc_irk)
 * @brief   Set the IRK and the identity address distributed to a remote device.
 * @details This function registers local IRK and identity address of local device in host stack.
 *          The IRK and the identity address are distributed to a remote device in pairing.
 *          The result of this API call is returned by a return value.
 * @param[in] p_lc_id_addr  Identity address to be registered in host stack.
 * @param[in] p_lc_irk  IRK to be registered in host stack.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) p_lc_id_addr or p_lc_irk is specified as NULL.
 * @retval  BLE_ERR_INVALID_ARG(0x0003) Address type field in p_lc_id_addr is out of range.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_SetLocIdInfo(st_ble_dev_addr_t * p_lc_id_addr, uint8_t * p_lc_irk);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_SetLocCsrk(uint8_t * p_local_csrk)
 * @brief   Set the CSRK distributed to a remote device.
 * @details This function registers local CSRK in host stack.
 *          The CSRK is distributed to a remote device in pairing.
 *          The result of this API call is returned by a return value.
 * @param[in] p_local_csrk    CSRK to be registered in host stack.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) p_local_csrk is specified as NULL.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_SetLocCsrk(uint8_t * p_local_csrk);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_StartPairing(uint16_t conn_hdl)
 * @brief   Start pairing.
 * @details This function starts pairing with a remote device.
 *          The result of this API call is returned by a return value.
 *          The result of pairing is notified in BLE_GAP_EVENT_PAIRING_COMP event.
 * @param[in] conn_hdl    Connection handle identifying the remote device which local device starts pairing with.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_STATE(0x0008) While generating OOB data, this function was called.
 * @retval  BLE_ERR_CONTEXT_FULL(0x000B) While pairing, this function was called.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The remote device specified by conn_hdl is not found.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_StartPairing(uint16_t conn_hdl);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_ReplyPairing(uint16_t conn_hdl, uint8_t response)
 * @brief   Reply the pairing request from a remote device.
 * @details This function replies to the pairing request from the remote device.
 *          The pairing request from the remote device is notified in BLE_GAP_EVENT_PAIRING_REQ event.
 *          The result of this API call is returned by a return value.
 *          The result of pairing is notified in BLE_GAP_EVENT_PAIRING_COMP event.
 * @param[in] conn_hdl    Connection handle identifying the remote device which local device starts pairing with.
 * @param[in] response    Accept or reject the pairing request from the remote device.
 *               |              macro            |           description            |
 *               |:----------------------------- |:-------------------------------- |
 *               | BLE_GAP_PAIRING_ACCEPT(0x00)  | Accept the pairing request.      |
 *               | BLE_GAP_PAIRING_REJECT(0x01)  | Reject the pairing request.      |
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_ARG(0x0003) response is out of range.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) While generating OOB data, this function was called.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The remote device specified by conn_hdl is not found.
 * @retval  BLE_ERR_NOT_YET_READY(0x0012) When this function was called,
 *                                        host stack has not yet received BLE_GAP_EVENT_PAIRING_REQ event.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_ReplyPairing(uint16_t conn_hdl, uint8_t response);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_StartEnc(uint16_t conn_hdl)
 * @brief   Encryption the link.
 * @details This function starts encryption of the link.
 *          In case of master device, the local device requests for the encryption to a remote device.
 *          In case of slave device, the local device sends a Security Request to a remote device.
 *          After receiving the Security Request, the remote device requests for the encryption to the local device.
 *          The result of the encryption is returned in BLE_GAP_EVENT_ENC_CHG event.
 * @param[in] conn_hdl  Connection handle identifying the link which is encrypted.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The reason for this error is as follows:
 *                                        - Pairing has not been completed.
 *                                        - The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The remote device specified by conn_hdl is not found.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_StartEnc(uint16_t conn_hdl);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_ReplyPasskeyEntry(uint16_t conn_hdl, uint32_t passkey, uint8_t response)
 * @brief   Reply the passkey entry request.
 * @details When BLE_GAP_EVENT_PASSKEY_ENTRY_REQ event is notified,
 *          the response to passkey entry is sent by this function.
 *          The result of this API call is returned by a return value.
 * @param[in] conn_hdl    Connection handle identifying the remote device which the reply to passkey entry is sent.
 * @param[in] passkey     Passkey.
 *                        The valid range is 000000 - 999999 in decimal.
 * @param[in] response    Active or negative reply to passkey entry.
 *               |              macro            |           description              |
 *               |:----------------------------- |:---------------------------------- |
 *               | BLE_GAP_PAIRING_ACCEPT(0x00)  | Accept the passkey entry pairing.  |
 *               | BLE_GAP_PAIRING_REJECT(0x01)  | Reject the passkey entry pairing.  |
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_ARG(0x0003) passkey or response is out of range.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The remote device specified by conn_hdl is not found.
 * @retval  BLE_ERR_NOT_YET_READY(0x0012) When this function was called, pairing has not yet started.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_ReplyPasskeyEntry(uint16_t conn_hdl, uint32_t passkey, uint8_t response);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_ReplyNumComp(uint16_t conn_hdl, uint8_t response)
 * @brief   Reply the numeric comparison request.
 * @details When BLE_GAP_EVENT_NUM_COMP_REQ event is notified,
 *          the response to Numeric Comparison is sent by this function.
 *          The result of this API call is returned by a return value.
 * @param[in] conn_hdl  Connection handle identifying the remote device which the reply to Numeric Comparison is sent.
 * @param[in] response  Active or negative reply in Numeric Comparison.
 *            |              macro         |           description                                                   |
 *            |:-------------------------- |:----------------------------------------------------------------------- |
 *            |BLE_GAP_PAIRING_ACCEPT(0x00)| The number displayed in the local is the same as the one of the remote. |
 *            |BLE_GAP_PAIRING_REJECT(0x01)| The number displayed in the local is differs from the one of the remote.|
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_ARG(0x0003) response is out of range.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) When this function was called,
 *                                        host stack has not yet received @ref BLE_GAP_EVENT_NUM_COMP_REQ event.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The remote device specified by conn_hdl is not found.
 * @retval  BLE_ERR_NOT_YET_READY(0x0012) When this function was called, pairing has not yet started.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_ReplyNumComp(uint16_t conn_hdl, uint8_t response);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_NotifyKeyPress(uint16_t conn_hdl, uint8_t key_press)
 * @brief   Notify the input key type which a remote device inputs in the passkey entry.
 * @details This function notifies the input key type to the remote device in passkey entry.
 *          The result is returned from this API.
 * @param[in] conn_hdl  Connection handle identifying the remote device to which the key notification is sent.
 * @param[in] key_press Input key type.
 *               |              macro                         |           description                 |
 *               |:------------------------------------------ |:------------------------------------- |
 *               | BLE_GAP_LESC_PASSKEY_ENTRY_STARTED(0x00)   | Notify that passkey entry started.    |
 *               | BLE_GAP_LESC_PASSKEY_DIGIT_ENTERED(0x01)   | Notify that passkey digit entered.    |
 *               | BLE_GAP_LESC_PASSKEY_DIGIT_ERASED(0x02)    | Notify that passkey digit erased.     |
 *               | BLE_GAP_LESC_PASSKEY_CLEARED(0x03)         | Notify that passkey cleared.          |
 *               | BLE_GAP_LESC_PASSKEY_ENTRY_COMPLETED(0x04) | Notify that passkey entry completed.  |
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_ARG(0x0003) key_press parameter is out of range.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The remote device specified by conn_hdl is not found.
 * @retval  BLE_ERR_NOT_YET_READY(0x0012) When this function was called, pairing has not yet started.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_NotifyKeyPress(uint16_t conn_hdl, uint8_t key_press);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_GetDevSecInfo(uint16_t conn_hdl, st_ble_gap_auth_info_t * p_sec_info)
 * @brief   Get the security information about the remote device.
 * @details This function gets the parameters which has been negotiated with the remote device in pairing.
 *          The parameters can be retrieved after pairing.
 *          The result is returned by p_sec_info.
 * @param[in] conn_hdl  Connection handle identifying the remote device whose bonding information is retrieved.
 * @param[in] p_sec_info  Return the security information which has been negotiated in pairing.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) p_sec_info is specified as NULL.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The remote device bonding information has not been set to host stack.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The remote device specified by conn_hdl is not found.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_GetDevSecInfo(uint16_t conn_hdl, st_ble_gap_auth_info_t * p_sec_info);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_ReplyExKeyInfoReq(uint16_t conn_hdl)
 * @brief   Distribute the keys of local device.
 * @details When key exchange request is notified by BLE_GAP_EVENT_EX_KEY_REQ event at pairing,
 *          keys of the local device are distributed.
 *          The result is returned from this API.
 * @param[in] conn_hdl  Connection handle identifying the remote device to which the key is distributed.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The remote device specified by conn_hdl is not found.
 * @retval  BLE_ERR_NOT_YET_READY(0x0012) When this function was called, pairing has not yet started.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_ReplyExKeyInfoReq(uint16_t conn_hdl);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_SetRemOobData( st_ble_dev_addr_t * p_addr,
 *                                           uint8_t oob_data_flag,
 *                                           st_ble_gap_oob_data_t * p_oob
 *                                         )
 * @brief   Set the oob data from a remote device.
 * @details This function registers the OOB data received from a remote device.
 *          When oob_data_flag indicates that the OOB data has been received,
 *          the setting regarding OOB data is reflected in pairing.
 *          In order to do OOB pairing, set the OOB data received from the remote device before pairing.
 *          The result is returned from this API.
 * @param[in] p_addr The remote device address.
 * @param[in] oob_data_flag This parameter indicates whether the local device has received the OOB data
 *                          from the remote device or not.
 *               |              macro                |           description                                   |
 *               |:--------------------------------- |:------------------------------------------------------- |
 *               | BLE_GAP_OOB_DATA_NOT_PRESENT(0x00)| Reply that No OOB data has been received when pairing.  |
 *               | BLE_GAP_OOB_DATA_PRESENT(0x01)    | Reply that the OOB data has been received when pairing. |
 * @param[in] p_oob The OOB data received from the remote device.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) The reason for this error is as follows.
 *                                      - p_addr is specified as NULL.
 *                                      - oob_data_flag is BLE_GAP_OOB_DATA_PRESENT and p_oob is specified as NULL.
 * @retval  BLE_ERR_INVALID_ARG(0x0003) oob_data_flag is out of range.
 * @retval  BLE_ERR_CONTEXT_FULL(0x000B) There is no room to register the OOB data received from a remote device.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_SetRemOobData(st_ble_dev_addr_t * p_addr, uint8_t oob_data_flag, st_ble_gap_oob_data_t * p_oob);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_CreateScOobData(void)
 * @brief   Create data for oob in secure connection.
 * @details This function generates the OOB data distributed to a remote device in Secure Connections.
 *          The result of this API call is notified in BLE_GAP_EVENT_SC_OOB_CREATE_COMP event.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The reason for this error is as follows:
 *                                        - This function was called in pairing.
 *                                        - The task for host stack is not running.
 * @retval  BLE_ERR_ALREADY_IN_PROGRESS(0x000A) This function was called in creating OOB data.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_CreateScOobData(void);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_SetBondInfo(st_ble_gap_bond_info_t * p_bond_info,
 *                                        uint8_t device_num,
 *                                        uint8_t * p_set_num
 *                                       )
 * @brief   Set the bonding information stored in non-volatile memory to the host stack.
 * @details Set the bonding information of the remote device in the host stack.
 *          After power re-supply, when the remote device bonding information stored in non-volatile memory is
 *          set to host stack, this function is used.
 *          Host stack can be set the number specified by the device_num parameter of bonding information.
 * @param[in] p_bond_info An array of bonding information. The number of elements is specified by device_num.
 * @param[in] device_num  The number of the devices of which host stack registers bonding information.
 * @param[in] p_set_num   The number of the devices whose bonding information was registered in host stack.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) p_bond_info or p_set_num is specified as NULL.
 * @retval  BLE_ERR_INVALID_ARG(0x0003) device_num is out of range.
 * @retval  BLE_ERR_CONTEXT_FULL(0x000B) Host stack already has the maximum number of bonding information.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_SetBondInfo(st_ble_gap_bond_info_t * p_bond_info, uint8_t device_num, uint8_t * p_set_num);

/******************************************************************************************************************//**
 * @fn void R_BLE_GAP_DeleteBondInfo(int32_t local,
 *                                        int32_t remote,
 *                                        st_ble_dev_addr_t * p_addr,
 *                                        ble_gap_del_bond_cb_t gap_del_bond_cb)
 * @brief This function deletes the bonding information in Host Stack.\n
 *          When a function for deleting the bonding information stored in non-volatile area is registered by the
 *          gap_del_bond_cb parameter, it is deleted as well as the bonding information in Host Stack.
 *
 * @param[in] local The type of the local bonding information to be deleted.
 *               |              macro                |           description                                   |
 *               |:--------------------------------- |:------------------------------------------------------- |
 *               | BLE_GAP_SEC_DEL_LOC_NONE(0x00)    | Delete no local keys.                                   |
 *               | BLE_GAP_SEC_DEL_LOC_IRK(0x01)     | Delete local IRK and identity address.                  |
 *               | BLE_GAP_SEC_DEL_LOC_CSRK(0x02)    | Delete local CSRK.                                      |
 *               | BLE_GAP_SEC_DEL_LOC_ALL(0x03)     | Delete all local keys.                                  |
 * @param[in] remote The type of the remote bonding information to be deleted.
 *               |              macro                |           description                                   |
 *               |:--------------------------------- |:------------------------------------------------------- |
 *               | BLE_GAP_SEC_DEL_REM_NONE(0x00)    | Delete no remote device keys.                           |
 *               | BLE_GAP_SEC_DEL_REM_SA(0x01)      | Delete the keys specified by the p_addr parameter.      |
 *               | BLE_GAP_SEC_DEL_REM_NOT_CONN(0x02)| Delete keys of not connected remote devices.            |
 *               | BLE_GAP_SEC_DEL_REM_ALL(0x03)     | Delete all remote device keys.                          |
 *               \n\n
 * @param[in] p_addr p_addr is specified as the address of the remote device whose keys are deleted
 *                   when the rem_info parameter is set to @ref BLE_GAP_SEC_DEL_REM_SA(0x01).
 *                   \n\n
 * @param[in] gap_del_bond_cb This parameter is a callback function which deletes the bonding information stored
 *                            in non-volatile area. \n After deleting the bonding information stored in Host Stack,
 *                            the callback function is called. If no bonding information is stored in
 *                            non-volatile area, specify the parameter as NULL.
 * @retval  none
 *********************************************************************************************************************/
void R_BLE_GAP_DeleteBondInfo(int32_t               local,
                              int32_t               remote,
                              st_ble_dev_addr_t   * p_addr,
                              ble_gap_del_bond_cb_t gap_del_bond_cb);

