fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_ReplyLtkReq(uint16_t conn_hdl,
 *                                        uint16_t ediv,
 *                                        uint8_t * p_peer_rand,
 *                                        uint8_t response
 *                                       )
 * @brief   Reply the LTK request from a remote device.
 * @details This function replies to the LTK request in BLE_GAP_EVENT_LTK_REQ event from a remote device.
 *          The result of the LTK reply is returned in BLE_GAP_EVENT_LTK_RSP_COMP event.
 *          When the link encryption has completed, BLE_GAP_EVENT_ENC_CHG event is notified.
 * @param[in] conn_hdl  Connection handle identifying the remote device which sent the LTK request.
 * @param[in] ediv  Ediv notified in BLE_GAP_EVENT_LTK_REQ event.
 * @param[in] p_peer_rand  Rand notified in BLE_GAP_EVENT_LTK_REQ event.
 * @param[in] response  Response to the LTK request.
 *                      If "BLE_GAP_LTK_REQ_ACCEPT" is specified,
 *                      when no LTK has been exchanged in pairing, reject the LTK request.
 *                      |              macro            |           description              |
 *                      |:----------------------------- |:---------------------------------- |
 *                      | BLE_GAP_LTK_REQ_ACCEPT(0x00)  | Reply for the LTK request.         |
 *                      | BLE_GAP_LTK_REQ_DENY(0x01)    | Reject the LTK request.            |
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) p_peer_rand is specified as NULL in case of legacy pairing.
 * @retval  BLE_ERR_INVALID_ARG(0x0003) response is out of range.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The remote device specified by conn_hdl is not found.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_ReplyLtkReq(uint16_t conn_hdl, uint16_t ediv, uint8_t * p_peer_rand, uint8_t response);

/******************************************************************************************************************//**
 *  @fn ble_status_t R_BLE_GAP_SetCteConnlessParam(st_ble_gap_cte_connless_t * p_cte_param)
 *  @brief Set the parameters for the transmission of Constant Tone Extensions in any periodic advertising.
 *  @param[in] p_cte_param parameters of type, length, and antenna switching pattern.
 *  @retval  BLE_SUCCESS(0x0000) Success
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_SetCteConnlessParam(st_ble_gap_cte_connless_t * p_cte_param);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_EnableCteConnless(uint16_t adv_hdl, uint8_t enable)
 * @brief Enable or disable Constant Tone Extensions in periodic advertising identified by the adv_hdl.
 * @param[in] adv_hdl handle of the periodic advertising which carries the CTE info.
 * @param[in] enable  Enable or disable address resolution function.
 *               |              macro              |           description                     |
 *               |:------------------------------- |:----------------------------------------- |
 *               | BLE_GAP_CTE_DISABLED(0x00)      | Disable connectionless CTE transmission   |
 *               | BLE_GAP_CTE_ENABLED(0x01)       | Enable connectionless CTE transmission    |
 *  @retval  BLE_SUCCESS(0x0000) Success
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_EnableCteConnless(uint16_t adv_hdl, uint8_t enable);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_StartCteConnlessRecv(st_ble_gap_cte_connless_recv_t * p_cte_recv)
 * @brief Enable sampling received Constant Tone Extension fields.
 * @details Application should receive BLE_GAP_EVENT_CTE_CONNLESS_REPT event.
 * @param[in] p_cte_recv antenna switching pattern and switching and sampling slot durations to be used.
 * @retval  BLE_SUCCESS(0x0000) Success
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_StartCteConnlessRecv(st_ble_gap_cte_connless_recv_t * p_cte_recv);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_StopCteConnlessRecv(uint16_t sync_hdl)
 * @brief Disable sampling received Constant Tone Extension fields
 * @param[in] sync_hdl handle of the periodic advertising sync which carries the CTE info.
 * @retval  BLE_SUCCESS(0x0000) Success
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_StopCteConnlessRecv(uint16_t sync_hdl);

/******************************************************************************************************************//**
 *  @fn ble_status_t R_BLE_GAP_SetCteConnParam(st_ble_gap_cte_conn_t * p_cte_param)
 *  @brief Set the parameters for the transmission of Constant Tone Extensions in ACL link.
 *  @param[in] p_cte_param parameters of type, length, and antenna switching pattern.
 *  @retval  BLE_SUCCESS(0x0000) Success
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_SetCteConnParam(st_ble_gap_cte_conn_t * p_cte_param);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_EnableCteConnRsp(uint16_t conn_hdl, uint8_t enable)
 * @brief Enable or disable Constant Tone Extensions Transmission in ACL link by conn_hdl.
 * @param[in] conn_hdl handle of the ACL link which carries the CTE info.
 * @param[in] enable  Enable or disable address resolution function.
 *               |              macro              |           description                     |
 *               |:------------------------------- |:----------------------------------------- |
 *               | BLE_GAP_CTE_DISABLED(0x00)      | Disable connectionless CTE transmission   |
 *               | BLE_GAP_CTE_ENABLED(0x01)       | Enable connectionless CTE transmission    |
 *  @retval  BLE_SUCCESS(0x0000) Success
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_EnableCteConnRsp(uint16_t conn_hdl, uint8_t enable);

/******************************************************************************************************************//**
 *  @fn ble_status_t R_BLE_GAP_SetCteConnRecvParam(st_ble_gap_cte_conn_rx_param_t * p_cte_param)
 *  @brief Set the parameters for the receiving of Constant Tone Extensions in ACL link.
 *          and start sampling.
 *  @param[in] p_cte_param parameters of type, length, and antenna switching pattern.
 *  @retval  BLE_SUCCESS(0x0000) Success
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_SetCteConnRecvParam(st_ble_gap_cte_conn_rx_param_t * p_cte_param);

/******************************************************************************************************************//**
 *  @fn ble_status_t R_BLE_GAP_StopCteConnRecvSampling(uint16_t conn_hdl)
 *  @brief Stop sampling of Constant Tone Extensions on the specified connection.
 *  @param[in] conn_hdl handle of the ACL link which carries the CTE info.
 *  @retval  BLE_SUCCESS(0x0000) Success
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_StopCteConnRecvSampling(uint16_t conn_hdl);

/******************************************************************************************************************//**
 *  @fn ble_status_t R_BLE_GAP_StartCteConnReq(st_ble_gap_cte_conn_req_t * p_req)
 *  @brief Set the parameters and start sending request of Constant Tone Extensions in ACL link to peer.
 *  @details If the request does not receive a CTE Response PDU with CTE info, BLE_GAP_EVENT_CTE_CONN_REQ_FAILED
 *           event is sent to application. Otherwise application should receive BLE_GAP_EVENT_CTE_CONN_REPT event.
 *  @param[in] p_req parameters connection CTE request.
 *  @retval  BLE_SUCCESS(0x0000) Success
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_StartCteConnReq(st_ble_gap_cte_conn_req_t * p_req);

/******************************************************************************************************************//**
 *  @fn ble_status_t R_BLE_GAP_StopCteConnReq(uint16_t handle)
 *  @brief Stop sending request of Constant Tone Extensions in ACL link to peer.
 *  @param[in] handle handle of the ACL link which carries the CTE info.
 *  @retval  BLE_SUCCESS(0x0000) Success
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_StopCteConnReq(uint16_t handle);

/******************************************************************************************************************//**
 *  @fn ble_status_t R_BLE_GAP_SetDefaultSubrate(st_ble_gap_subrate_param_t * p_subrate_param)
 *  @brief Set the initial values for the acceptable parameters for subrating requests,
 *  @param[in] p_subrate_param default parameters of subrate.
 *  @retval  BLE_SUCCESS(0x0000) Success
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_SetDefaultSubrate(st_ble_gap_subrate_param_t * p_subrate_param);

/******************************************************************************************************************//**
 *  @fn ble_status_t R_BLE_GAP_RequestSubrate(uint16_t conn_hdl, st_ble_gap_subrate_param_t * p_subrate_param)
 *  @brief Request a change to the subrating factor other parameters applied to an existing connection
 *          using the Connection Subrate Update procedure.
 *  @param[in] conn_hdl handle of the ACL link which carries the CTE info.
 *  @param[in] p_subrate_param request parameters of subrate.
 *  @retval  BLE_SUCCESS(0x0000) Success
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_RequestSubrate(uint16_t conn_hdl, st_ble_gap_subrate_param_t * p_subrate_param);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_StartPerdAdvSetInfoTransfer(uint16_t adv_hdl, uint16_t conn_hdl, uint16_t service_data)
 * @brief   This function starts Periodic advertising adv set info transfer to the connection.
 * @details Send synchronization information about the periodic advertising
 *          in an advertising set to a connected device.
 * @param[in] adv_hdl   Identifies the advertising set.
 * @param[in] conn_hdl  Connection handle identifying the remote device.
 * @param[in] service_data A value provided by the application for use by the application of the peer device.
 * @retval  BLE_SUCCESS(0x0000) Success
 *
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_StartPerdAdvSetInfoTransfer(uint16_t adv_hdl, uint16_t conn_hdl, uint16_t service_data);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_StartPerdAdvSyncTransfer(uint16_t sync_hdl, uint16_t conn_hdl, uint16_t service_data)
 * @brief   This function starts Periodic advertising sync transfer.
 * @details send synchronization information about the periodic advertising train identified by the Sync_Handle 
 *          parameter to a connected device.
 * @param[in] sync_hdl  Sync handle identifying the Periodic Sync that has been established.
 * @param[in] conn_hdl  Connection handle identifying the remote device.
 * @param[in] service_data A value provided by the application for use by the application of the peer device.
 * @retval  BLE_SUCCESS(0x0000) Success
 *
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_StartPerdAdvSyncTransfer(uint16_t sync_hdl, uint16_t conn_hdl, uint16_t service_data);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_SetPerdAdvSyncTransferParam(uint16_t conn_hdl, st_ble_gap_past_param_t * p_past_param)
 * @brief   This function starts to accept Periodic advertising sync transfer from the connection.
 * @details
 *          This API call enables BLE_GAP_EVENT_PAST_RECV event.n
 *
 * @param[in] conn_hdl  Connection handle identifying the remote device.
 * @param[in] p_past_param Periodic advertising sync transfer parameters.
 * @retval  BLE_SUCCESS(0x0000) Success
 *
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_SetPerdAdvSyncTransferParam(uint16_t conn_hdl, st_ble_gap_past_param_t * p_past_param);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_SetDefPerdAdvSyncTransferParam(st_ble_gap_past_param_t * p_past_param)
 * @brief   This function set the default parameter of Periodic advertising sync transfer
 *          for all subsequent connection. It does not affect any existing connection.
 * @details
 *          This API call enables BLE_GAP_EVENT_PAST_RECV event.
 *
 * @param[in] p_past_param  Periodic advertising sync transfer parameters.
 * @retval  BLE_SUCCESS(0x0000) Success
 *
 **************************************************************************************************************/
ble_status_t R_BLE_GAP_SetDefPerdAdvSyncTransferParam(st_ble_gap_past_param_t * p_past_param);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_ReadAntennaInfo(void)
 * @brief   This function read the switching rates, the sampling rates, the number of antennae, and the
 *          maximum length of a transmitted Constant Tone Extension
 *
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_SUCCESS(0x0000) Success, otherwise "HCI Spec Error" in enum RBLE_STATUS_enum.
 * @retval  BLE_ERR_UNSPECIFIED(0x0013) Unspecified error.
 **************************************************************************************************************/
ble_status_t R_BLE_GAP_ReadAntennaInfo(void);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_ReceiverTest(st_ble_gap_recv_test_param_t * p_rx_test_param)
 * @brief   Start a test where the DUT receives test reference
 *          packets at a fixed interval. The tester generates the test reference packets.
 * @details
 * @param[in] p_rx_test_param receiver test parameter
 * @retval  BLE_SUCCESS(0x0000) Success, otherwise "HCI Spec Error" in enum RBLE_STATUS_enum.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_ReceiverTest(st_ble_gap_recv_test_param_t * p_rx_test_param);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_TransmitterTest(st_ble_gap_trans_test_param_t * p_tx_test_param)
 * @brief   Start a test where the DUT generates test reference
 *          packets at a fixed interval. The Controller shall transmit at the power level
 *          indicated by the TX_Power_Level parameter.
 * @details
 * @param[in] p_tx_test_param transmitter test parameter
 * @retval  BLE_SUCCESS(0x0000) Success, otherwise "HCI Spec Error" in enum RBLE_STATUS_enum.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_TransmitterTest(st_ble_gap_trans_test_param_t * p_tx_test_param);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_ModifySleepClockAccuracy(uint8_t act)
 * @brief   request that the Controller changes its sleep clock
 *          accuracy for testing purposes. It should not be used under other
 *          circumstances.
 * @details
 * @param[in] act Switch to a more/less accurate clock.
 * @retval  BLE_SUCCESS(0x0000) Success, otherwise "HCI Spec Error" in enum RBLE_STATUS_enum.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_ModifySleepClockAccuracy(uint8_t act);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_ReadRemoteTransmitPowerLevel(uint16_t conn_hdl, uint8_t phy)
 * @brief   Read the transmit power level used by the remote device.
 * @details BLE_GAP_EVENT_TX_POWER_REPT is received as a result when R_BLE_GAP_SetTransmitPowerReportingEnable
 *          is enabled.
 * @param[in] conn_hdl Connection handle.
 * @param[in] phy The transmitter PHY of packets.
 * @retval  BLE_SUCCESS(0x0000) Success
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_ReadRemoteTransmitPowerLevel(uint16_t conn_hdl, uint8_t phy);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_SetPathLossReportingParam(st_ble_gap_set_path_loss_rpt_param_t * p_loss_rpt_param)
 * @brief   Set the path loss threshold reporting parameters for the ACL connection identified.
 * @details
 * @param[in] p_loss_rpt_param parameter for path loss report.
 * @retval  BLE_SUCCESS(0x0000) Success, otherwise "HCI Spec Error" in enum RBLE_STATUS_enum.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_SetPathLossReportingParam(st_ble_gap_set_path_loss_rpt_param_t * p_loss_rpt_param);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_SetPathLossReportingEnable(uint16_t conn_hdl, uint8_t enable)
 * @brief   Enable or disable path loss reporting for the ACL connection.
 * @details
 * @param[in] conn_hdl Connection handle.
 * @param[in] enable Reporting enable/disable.
 * @retval  BLE_SUCCESS(0x0000) Success, otherwise "HCI Spec Error" in enum RBLE_STATUS_enum.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_SetPathLossReportingEnable(uint16_t conn_hdl, uint8_t enable);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_SetTransmitPowerReportingEnable(uint16_t conn_hdl, 
 *      uint8_t local_enable, uint8_t remote_enable)
 * @brief   Enable or disable the transmit power level changing report
 * @details Enable or disable the reporting to the local Host of transmit power level
 *          changes in the local and remote Controllers for the ACL connection identified
 *          by the Connection_Handle parameter.
 * @param[in] conn_hdl Connection handle.
 * @param[in] local_enable Local transmit power reports enable/disable.
 * @param[in] remote_enable Remote transmit power reports enable/disable.
 * @retval  BLE_SUCCESS(0x0000) Success, otherwise "HCI Spec Error" in enum RBLE_STATUS_enum.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_SetTransmitPowerReportingEnable(uint16_t conn_hdl, uint8_t local_enable, uint8_t remote_enable);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_SetDataRelatedAddrChanges(uint8_t adv_hdl, uint8_t change_reason)
 * @brief   Specifies circumstances when the Controller shall refresh any Resolvable Private
 *          Address.
 * @details Specifies circumstances when the Controller shall refresh any Resolvable Private Addresss
 *          used by the advertising set identified by the Advertising_Handle parameter, whether or not
 *          the address timeout period has been reached. This function may be used while advertising is enabled.
 * @param[in] adv_hdl Used to identify an advertising set.
 * @param[in] change_reason reason(s) for refreshing addresses.
 * @retval  BLE_SUCCESS(0x0000) Success, otherwise "HCI Spec Error" in enum RBLE_STATUS_enum.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_SetDataRelatedAddrChanges(uint8_t adv_hdl, uint8_t change_reason);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_TestEnd(void)
 * @brief   Stop any test which is in progress. The Num_Packets
 *          for a transmitter test shall be reported as 0x0000. The Num_Packets is an
 *          unsigned number and contains the number of received packets.
 * @details
 * @retval  BLE_SUCCESS(0x0000) Success, otherwise "HCI Spec Error" in enum RBLE_STATUS_enum.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_TestEnd(void);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_ReqPeerSCA(uint16_t conn_hdl)
 * @brief   Read the Sleep Clock Accuracy (SCA) of the peer device.
 * @details
 * @param[in] conn_hdl Indicate an ACL connection.
 * @retval  BLE_SUCCESS(0x0000) Success, otherwise "HCI Spec Error" in enum RBLE_STATUS_enum.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_ReqPeerSCA(uint16_t conn_hdl);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_EnhancedReadTxPowerLevel(uint16_t conn_hdl, uint8_t phy)
 * @brief   Read the current and maximum transmit power levels of the local Controller on
 *          the ACL connection identified by the Connection_Handle parameter and the
 *          PHY indicated by the PHY parameter.
 * @details
 * @param[in] conn_hdl Indicate an ACL connection.
 * @param[in] phy Indicate PHY.
 * @retval  BLE_SUCCESS(0x0000) Success, otherwise "HCI Spec Error" in enum RBLE_STATUS_enum.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_EnhancedReadTxPowerLevel(uint16_t conn_hdl, uint8_t phy);

