fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GAP_SetHostFeat(uint8_t bit_number, uint8_t bit_value)
 * @brief   Set or clear a bit controlled by the Host
 *          in the Link Layer FeatureSet stored in the Controller.
 * @details
 * @param[in] bit_number Bit position in the FeatureSet
 * @param[in] bit_value Value of the bit
 * @retval  BLE_SUCCESS(0x0000) Success, otherwise "HCI Spec Error" in enum RBLE_STATUS_enum.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_SetHostFeat(uint8_t bit_number, uint8_t bit_value);

/*@}*/

/* ============================================== ISO API Declarations ============================================= */

/** @defgroup ISO_API ISO
 *  @ingroup BLE_API
 *  @{
 */

/******************************************************************************************************************//**
 *  @fn ble_status_t R_BLE_ISO_CreateBig(uint8_t * p_big_hdl, uint8_t adv_hdl, st_ble_iso_big_param_t * p_big_param)
 *  @brief Create a BIG.
 *  @param[out] p_big_hdl BIG handle is assigned by host stack, and value is passed out.
 *  @param[in] adv_hdl Periodic adv handle which carries the biginfo.
 *  @param[in] p_big_param BIG param
 *  @retval  BLE_SUCCESS(0x0000) Success
 *********************************************************************************************************************/
ble_status_t R_BLE_ISO_CreateBig(uint8_t * p_big_hdl, uint8_t adv_hdl, st_ble_iso_big_param_t * p_big_param);

/******************************************************************************************************************//**
 *  @fn ble_status_t R_BLE_ISO_StopBig(uint8_t big_hdl, uint8_t reason)
 *  @brief  Stop a BIG of the big_handle
 *  @param[in] big_hdl handle of the BIG to be stopped.
 *  @param[in] reason reason of termination.
 *  @retval  BLE_SUCCESS(0x0000) Success
 *********************************************************************************************************************/
ble_status_t R_BLE_ISO_StopBig(uint8_t big_hdl, uint8_t reason);

/******************************************************************************************************************//**
 *  @fn ble_status_t R_BLE_ISO_CreateBigSync(uint8_t* p_big_hdl,
 *                                   uint16_t sync_hdl,
 *                                   st_ble_iso_big_sync_param_t * p_big_sync_param);
 *  @brief  Create a BIG sync
 *  @param[out] p_big_hdl BIG handle is assigned by host stack, and value is passed out.
 *  @param[in] sync_hdl Periodic adv sid which carries the biginfo.
 *  @param[in] p_big_sync_param BIG param which is got from biginfo.
 *  @retval  BLE_SUCCESS(0x0000) Success
 *********************************************************************************************************************/
ble_status_t R_BLE_ISO_CreateBigSync(uint8_t                     * p_big_hdl,
                                     uint16_t                      sync_hdl,
                                     st_ble_iso_big_sync_param_t * p_big_sync_param);

/******************************************************************************************************************//**
 *  @fn ble_status_t R_BLE_ISO_TerminateBigSync(uint8_t big_hdl)
 *  @brief  Terminate a BIG sync
 *  @param[in] big_hdl handle of the BIG sync to be terminated.
 *  @retval  BLE_SUCCESS(0x0000) Success
 *********************************************************************************************************************/
ble_status_t R_BLE_ISO_TerminateBigSync(uint8_t big_hdl);

/******************************************************************************************************************//**
 *  @fn ble_status_t R_BLE_ISO_SetCigParam(uint8_t * p_cig_id, st_ble_iso_cig_param_t * p_cig_param)
 *  @brief Create a CIG with param.
 *  @details This function requests BLE system to create a CIG.
 *      The result of this API call is notified in @ref BLE_ISO_EVENT_CIG_PARAM_SET_COMP event.
 *  @param[out] p_cig_id CIG is assigned by host stack, and value is passed out.
 *  @param[in] p_cig_param CIG param
 *  @retval  BLE_SUCCESS(0x0000) Success
 *********************************************************************************************************************/
ble_status_t R_BLE_ISO_SetCigParam(uint8_t * p_cig_id, st_ble_iso_cig_param_t * p_cig_param);

/******************************************************************************************************************//**
 *  @fn ble_status_t R_BLE_ISO_CreateCis(st_ble_iso_cis_conn_t * p_cis_conn)
 *  @brief Create one or more CISes using the CIS param.
 *  @details This function send the CIS requests to the remote devices.
 *          The result of this API call is returned by a return value.
 *          Remote device receives BLE_ISO_EVENT_CIS_REQ event.
 *          The response from remote device is notified in @ref BLE_ISO_EVENT_CIS_EST event.
 *          Once CIS connectionis estabilished successfully, they can be disconnected by
 *          R_BLE_GAP_Disconnect.
 *  @param[in] p_cis_conn CIS param
 *  @retval  BLE_SUCCESS(0x0000) Success
 *********************************************************************************************************************/
ble_status_t R_BLE_ISO_CreateCis(st_ble_iso_cis_conn_t * p_cis_conn);

/******************************************************************************************************************//**
 *  @fn R_BLE_ISO_RemoveCig(uint8_t cig_id)
 *  @brief remove a CIG of id and all of CIS streams in this CIG.
 *  @param[out] cig_id CIG id to be removed.
 *  @retval  BLE_SUCCESS(0x0000) Success
 *********************************************************************************************************************/
ble_status_t R_BLE_ISO_RemoveCig(uint8_t cig_id);

/******************************************************************************************************************//**
 *  @fn ble_status_t R_BLE_ISO_ReplyCisRequest(uint8_t cig_id, uint8_t cis_id, uint8_t response, uint8_t reason)
 *  @brief   Reply the CIS request from a remote device.
 *  @details This function replies to the CIS request from the remote device.
 *          The CIS request from the remote device is notified in @ref BLE_ISO_EVENT_CIS_REQ event.
 *          The result of this API call is returned by a return value.
 *          The result is notified in BLE_ISO_EVENT_CIS_EST event.
 *  @param[in] cig_id     CIG ID
 *  @param[in] cis_id     CIS ID
 *  @param[in] response   Accept or reject the pairing request from the remote device.
 *               |              macro            |           description            |
 *               |:----------------------------- |:-------------------------------- |
 *               | BLE_ISO_CIS_ACCEPT(0x00)      | Accept the CIS request.      |
 *               | BLE_ISO_CIS_REJECT(0x01)      | Reject the CIS request.      |
 *  @param[in] reason    The reason for rejecting CIS request. This parameter is ignored when response is
 *          BLE_ISO_CIS_ACCEPT. Refer the error code described in
 *          Core Specification Vol.2 Part D ,"2 Error Code Descriptions".
 *********************************************************************************************************************/
ble_status_t R_BLE_ISO_ReplyCisRequest(uint8_t cig_id, uint8_t cis_id, uint8_t response, uint8_t reason);

/******************************************************************************************************************//**
 *  @fn ble_status_t R_BLE_ISO_SetupDataPath(uint16_t conn_hdl, st_ble_iso_chan_path * p_path)
 *  @brief Create the ISO data path between the Host and the Controller for a CIS.
 *  @details This function behaviors depending on the platform. For SoC without Bluetooth Audio
 *           support, only the following value are valid in param path:
 *               |              field            |           value                  |
 *               |:----------------------------- |:-------------------------------- |
 *               | path_id                       | BLE_ISO_DATA_PATH_HCI            |
 *               | coding_format                 | 0xFF (Vendor specific coding format)     |
 *  @param[in] conn_hdl     CIS handle
 *  @param[in] p_path       data path configuration
 *  @retval  BLE_SUCCESS(0x0000) Success
 *********************************************************************************************************************/
ble_status_t R_BLE_ISO_SetupDataPath(uint16_t conn_hdl, st_ble_iso_chan_path * p_path);

/******************************************************************************************************************//**
 *  @fn ble_status_t R_BLE_ISO_SendData(st_ble_iso_sdu_t * p_sdu_info)
 *  @brief Send a SDU payload to a ISO channel of conn_hdl.
 *  @details This function copies SDU payload into host's buffer and push the buffer into host's TX queue.
 *           Once the payload is accepted by controller scheduler, @ref BLE_ISO_EVENT_ISO_TX_COMP event
 *           is sent back to application. Due to limitation of host buffer capacity, the maximum size of
 *           SDU payload is 251 bytes (@ref BLE_ISO_DATA_MAX_PDU).
 *  @param[in] p_sdu_info SDU info and data
 *  @retval  BLE_SUCCESS(0x0000) Success
 *********************************************************************************************************************/
ble_status_t R_BLE_ISO_SendData(st_ble_iso_sdu_t * p_sdu_info);

/******************************************************************************************************************//**
 *  @fn ble_status_t R_BLE_ISO_SendDataNoCopy(st_ble_iso_sdu_t * p_sdu_info)
 *  @brief Send SDU payload to a ISO channel of conn_hdl without copying data.
 *  @details This function behaviors similar to R_BLE_ISO_SendData, but without copying SDU payload
 *           to the buffer in host. For this reason application should hold the buffer until a @ref
 *           BLE_ISO_EVENT_ISO_TX_COMP event with the same conn_hdl and seq_number of p_sdu_info is received.
 *           The maximum size of SDU payload defined by @ref BLE_ISO_DATA_MAX_SDU.
 *  @param[in] p_sdu_info SDU info and data
 *  @retval  BLE_SUCCESS(0x0000) Success
 *********************************************************************************************************************/
ble_status_t R_BLE_ISO_SendDataNoCopy(st_ble_iso_sdu_t * p_sdu_info);

/******************************************************************************************************************
 * @fn ble_status_t R_BLE_ISO_GetTxSync(uint16_t conn_hdl)
 * @brief   This function read read the TX_Time_Stamp and Time_Offset of the last transmitted SDU.
 * @param[out] tx_sync Address for tx sync information
 * @retval  BLE_SUCCESS(0x0000) Success
 *
 **************************************************************************************************************/
ble_status_t R_BLE_ISO_GetTxSync(uint16_t conn_hdl);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_ISO_CreateBigTest(uint8_t * p_big_hdl, uint8_t adv_hdl,
 *                                  st_ble_iso_create_big_test_param_t * p_create_big_test_param);
 * @brief   Create one or more BISes of a BIG (see [Vol 6] Part B,
 *          Section 4.4.6). All BISes in the BIG have the same values for all parameters.
 * @details
 * @param[out] p_big_hdl Used to identify a BIG.
 * @param[in] adv_hdl Used to identify an advertising set.
 * @param[in] p_create_big_test_param specified parameter of BIG param test
 * @retval  BLE_SUCCESS(0x0000) Success, otherwise "HCI Spec Error" in enum RBLE_STATUS_enum.
 *********************************************************************************************************************/
ble_status_t R_BLE_ISO_CreateBigTest(uint8_t                            * p_big_hdl,
                                     uint8_t                              adv_hdl,
                                     st_ble_iso_create_big_test_param_t * p_create_big_test_param);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_ISO_SetCigParamTest(uint8_t * p_cig_id,
 *                              st_ble_iso_set_cig_param_test_param_t * p_set_cig_param_test_param)
 * @brief   Create a CIG and set the parameters of one or more CISes that are associated with a CIG in the
 *          Controller.
 * @details
 * @param[in] p_set_cig_param_test_param specified parameter of CIG param_test
 * @param[out] p_cig_id cig ID is assigned by host stack, and value is passed out.
 * @retval  BLE_SUCCESS(0x0000) Success, otherwise "HCI Spec Error" in enum RBLE_STATUS_enum.
 *********************************************************************************************************************/
ble_status_t R_BLE_ISO_SetCigParamTest(uint8_t                               * p_cig_id,
                                       st_ble_iso_set_cig_param_test_param_t * p_set_cig_param_test_param);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_ISO_TransmitTest(uint16_t conn_hdl, uint8_t payload_type)
 * @brief   Configure an established CIS or BIS and transmit test payloads which are
 *          generated by the Controller.
 * @details
 * @param[in] conn_hdl Connection handle of the CIS or BIS.
 * @param[in] payload_type Configuration of SDUs in the payload.
 * @retval  BLE_SUCCESS(0x0000) Success, otherwise "HCI Spec Error" in enum RBLE_STATUS_enum.
 *********************************************************************************************************************/
ble_status_t R_BLE_ISO_TransmitTest(uint16_t conn_hdl, uint8_t payload_type);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_ISO_ReceiveTest(uint16_t conn_hdl, uint8_t payload_type)
 * @brief   Configure an established CIS or a synchronized BIG to receive payloads.
 * @details
 * @param[in] conn_hdl Connection handle of the CIS or BIS.
 * @param[in] payload_type Configuration of SDUs in the payload.
 * @retval  BLE_SUCCESS(0x0000) Success, otherwise "HCI Spec Error" in enum RBLE_STATUS_enum.
 *********************************************************************************************************************/
ble_status_t R_BLE_ISO_ReceiveTest(uint16_t conn_hdl, uint8_t payload_type);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_ISO_ReadTestCounters(uint16_t conn_hdl)
 * @brief   Read the test counters (see [Vol 6] Part B, Section 7)
 *          in the Controller which is configured in ISO Receive Test mode for a CIS or BIS
 *          specified by the Connection_Handle. Reading the test counters does not reset
 *          the test counters.
 * @details
 * @param[in] conn_hdl Connection handle of the CIS or BIS.
 * @retval  BLE_SUCCESS(0x0000) Success, otherwise "HCI Spec Error" in enum RBLE_STATUS_enum.
 *********************************************************************************************************************/
ble_status_t R_BLE_ISO_ReadTestCounters(uint16_t conn_hdl);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_ISO_TestEnd(uint16_t conn_hdl)
 * @brief   Terminate the ISO Transmit and/or Receive Test
 *          mode for a CIS or BIS specified by the Connection_Handle parameter but does
 *          not terminate the CIS or BIS.
 * @details
 * @param[in] conn_hdl Connection handle of the CIS or BIS.
 * @retval  BLE_SUCCESS(0x0000) Success, otherwise "HCI Spec Error" in enum RBLE_STATUS_enum.
 *********************************************************************************************************************/
ble_status_t R_BLE_ISO_TestEnd(uint16_t conn_hdl);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_ISO_ReadLinkQuality(uint16_t conn_hdl)
 * @brief   Returns the values of various counters related to link quality that
 *          are associated with the isochronous stream specified by the
 *          Connection_Handle parameter.
 * @details
 * @param[in] conn_hdl Connection handle of the CIS or BIS.
 * @retval  BLE_SUCCESS(0x0000) Success, otherwise "HCI Spec Error" in enum RBLE_STATUS_enum.
 *********************************************************************************************************************/
ble_status_t R_BLE_ISO_ReadLinkQuality(uint16_t conn_hdl);

/******************************************************************************************************************//**
 *  @fn R_BLE_ISO_RemoveDataPath(uint16_t conn_hdl, uint8_t dir)
 *  @brief Remove the input and/or output data path(s) associated with a CIS, CIS configuration, or BIS
 *         identified by the Connection_Handle parameter.
 *  @details
 *  @param[in] conn_hdl     Connection handle of the CIS or BIS
 *  @param[in] dir          Data path direction.
 *  @retval  BLE_SUCCESS(0x0000) Success
 *  @retval  BLE_ERR_INVALID_CHAN(0x0005) The handle does not indicate a CIS or BIS channel.
 *  @retval  BLE_ERR_UNSPECIFIED(0x0013) Unspecified error.
 *********************************************************************************************************************/
ble_status_t R_BLE_ISO_RemoveDataPath(uint16_t conn_hdl, uint8_t dir);

/******************************************************************************************************************//**
 *  @fn ble_status_t R_BLE_ISO_SetPerAdvRecvEnable(uint16_t sync_hdl, uint8_t enable)
 *  @brief Remove the input and/or output data path(s) associated with a CIS, CIS configuration, or BIS
 *         identified by the Connection_Handle parameter.
 *  @details
 *  @param[in] sync_hdl     Identifying the periodic advertising train
 *  @param[in] enable       Reporting enabled/disabled
 *  @retval  BLE_SUCCESS(0x0000) Success
 *  @retval  BLE_ERR_INVALID_ARG(0x0003) When parameter 'enable' represents neither enable nor disable.
 *  @retval  BLE_ERR_INVALID_HDL(0x000E) The handle does not indicate a synchronization connection.
 *  @retval  BLE_ERR_UNSPECIFIED(0x0013) Unspecified error.
 *********************************************************************************************************************/
ble_status_t R_BLE_GAP_SetPerAdvRecvEnable(uint16_t sync_hdl, uint8_t enable);

/** @} */

/* ========================================== GATT Common API Declarations ========================================= */

