fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
/** @defgroup GATT_COMMON_API GATT_COMMON
 *  @ingroup BLE_API
 *  @{
 */

/******************************************************************************************************************//**
 * @ingroup GATT_COMMON_API
 * @fn ble_status_t R_BLE_GATT_GetMtu(uint16_t conn_hdl, uint16_t * p_mtu)
 * @brief   This function gets the current MTU used in GATT communication.
 * @details Both GATT server and GATT Client can use this function. \n
 *          The result of this API call is returned by a return value.
 * @param[in] conn_hdl Connection handle identifying the GATT Server or the GATT Client.
 * @param[in] p_mtu The Current MTU. Before MTU exchange, this parameter is 23 bytes. \n
 *                  After MTU exchange, this parameter is the negotiated MTU.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) The mtu parameter is NULL.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The GATT Server or the GATT Client specified by conn_hdl was not found.
 *********************************************************************************************************************/
ble_status_t R_BLE_GATT_GetMtu(uint16_t conn_hdl, uint16_t * p_mtu);

/*@}*/

/* ========================================== GATT Server API Declarations ========================================= */

/** @defgroup GATT_SERVER_API GATT_SERVER
 *  @ingroup BLE_API
 *  @{
 */

/******************************************************************************************************************//**
 * @ingroup GATT_SERVER_API
 * @fn ble_status_t R_BLE_GATTS_Init(uint8_t cb_num)
 * @brief   This function initializes the GATT Server and registers the number of the callbacks for GATT Server event.
 * @details Specify the cb_num parameter to a value between 1 and BLE_GATTS_MAX_CB.\n
 *          R_BLE_GATTS_RegisterCb() registers the callback.\n
 *          The result of this API call is returned by a return value.
 * @param[in] cb_num The number of callbacks to be registered.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The cb_num parameter is out of range.
 *********************************************************************************************************************/
ble_status_t R_BLE_GATTS_Init(uint8_t cb_num);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GATTS_SetDbInst(st_ble_gatts_db_cfg_t * p_db_inst)
 * @brief   This function sets GATT Database to host stack.
 * @details The result of this API call is returned by a return value.
 * @param[in] p_db_inst GATT Database to be set.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) The reason for this error is as follows.
 *                                      - The db_inst parameter is specified as NULL.
 *                                      - The array in the db_inst is specified as NULL.
 *********************************************************************************************************************/
ble_status_t R_BLE_GATTS_SetDbInst(st_ble_gatts_db_cfg_t * p_db_inst);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GATTS_RegisterCb(ble_gatts_app_cb_t cb, uint8_t priority)
 * @brief   This function registers a callback for GATT Server event.
 * @details The number of the callback that may be registered by this function is the value specified
 *          by R_BLE_GATTS_Init().\n
 *          The result of this API call is returned by a return value.
 * @param[in] cb Callback function for GATT Server event.
 * @param[in] priority  The priority of the callback function.\n
 *                      Valid range is 1 <= priority <= BLE_GATTS_MAX_CB.\n
 *                      A lower priority number means a higher priority level.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) The cb parameter is specified as NULL.
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The priority parameter is out of range.
 * @retval  BLE_ERR_CONTEXT_FULL(0x000B) Host stack has already registered the maximum number of callbacks.
 *********************************************************************************************************************/
ble_status_t R_BLE_GATTS_RegisterCb(ble_gatts_app_cb_t cb, uint8_t priority);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GATTS_DeregisterCb(ble_gatts_app_cb_t cb)
 * @brief   This function deregisters the callback function for GATT Server event.
 * @details The result of this API call is returned by a return value.
 * @param[in] cb The callback function to be deregistered.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) The cb parameter is specified as NULL.
 * @retval  BLE_ERR_NOT_FOUND(0x000D) The callback has not been registered.
 *********************************************************************************************************************/
ble_status_t R_BLE_GATTS_DeregisterCb(ble_gatts_app_cb_t cb);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GATTS_Notification(uint16_t conn_hdl, st_ble_gatt_hdl_value_pair_t * p_ntf_data)
 * @brief   This function sends a notification of an attribute's value.
 * @details The maximum length of the attribute value that can be sent with notification is MTU-3.\n
 *          The result of this API call is returned by a return value.
 * @param[in] conn_hdl Connection handle identifying the remote device to be sent the notification.
 * @param[in] p_ntf_data The attribute value to send.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) The p_ntf_data parameter or the value field in the value field in
 *                                      the p_ntf_data parameter is NULL.
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The value_len field in the value field in the p_ntf_data parameter is 0
 *                                      or the attr_hdl field in the p_ntf_data parameters is 0.
 * @retval  BLE_ERR_INVALID_OPERATION(0x0009) This function was called while processing other request.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The remote device specified by conn_hdl was not found.
 *********************************************************************************************************************/
ble_status_t R_BLE_GATTS_Notification(uint16_t conn_hdl, st_ble_gatt_hdl_value_pair_t * p_ntf_data);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GATTS_Indication(uint16_t conn_hdl, st_ble_gatt_hdl_value_pair_t * p_ind_data)
 * @brief   This function sends a indication of an attribute's value.
 * @details  The maximum length of the attribute value that can be sent with indication is MTU-3.\n
 *           The result of this API call is returned by a return value.\n
 *           The remote device that receives a indication sends a confirmation.\n
 *           BLE_GATTS_EVENT_HDL_VAL_CNF event notifies the application layer that the confirmation has been received.
 * @param[in] conn_hdl Connection handle identifying the remote device to be sent the indication.
 * @param[in] p_ind_data The attribute value to send.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) The p_ind_data parameter or the value field in the value field in
 *                                      the p_ind_data parameter is NULL.
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The value_len field in the value field in the p_ind_data parameter is 0
 *                                      or the attr_hdl field in the p_ind_data parameters is 0.
 * @retval  BLE_ERR_INVALID_OPERATION(0x0009) This function was called while processing other request.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The remote device specified by conn_hdl was not found.
 *********************************************************************************************************************/
ble_status_t R_BLE_GATTS_Indication(uint16_t conn_hdl, st_ble_gatt_hdl_value_pair_t * p_ind_data);
/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GATTS_GetAttr(uint16_t conn_hdl, uint16_t attr_hdl, st_ble_gatt_value_t * p_value)
 * @brief   This function gets a attribute value from the GATT Database.
 * @details  The result of this API call is returned by a return value.
 * @param[in] conn_hdl If the attribute value that has information about the remote device is retrieved,
 *                     specify the remote device with the conn_hdl parameter.
 *                     When information about the remote device is not required,
 *                     set the conn_hdl parameter to BLE_GAP_INVALID_CONN_HDL.
 * @param[in] attr_hdl The attribute handle of the attribute value to be retrieved.
 * @param[out] p_value  The attribute value to be retrieved.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001)  The p_value parameter is specified as NULL.
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The attr_hdl parameter is 0 or larger than the last attribute handle
 *                                      of GATT Database.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The attribute is not in a state to be read.
 * @retval  BLE_ERR_INVALID_OPERATION(0x0009) The attribute cannot be read.
 * @retval  BLE_ERR_NOT_FOUND(0x000D) The attribute specified by the attr_hdl parameter is not belonging to
 *                                    any services or characteristics.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The remote device specified by the conn_hdl parameter was not found.
 *********************************************************************************************************************/
ble_status_t R_BLE_GATTS_GetAttr(uint16_t conn_hdl, uint16_t attr_hdl, st_ble_gatt_value_t * p_value);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GATTS_SetAttr(uint16_t conn_hdl, uint16_t attr_hdl, st_ble_gatt_value_t * p_value)
 * @brief   This function sets an attribute value to the GATT Database.
 * @details  The result of this API call is returned by a return value.
 * @param[in] conn_hdl If the attribute value that has information about the remote device is retrieved,
 *                     specify the remote device with the conn_hdl parameter.
 *                     When information about the remote device is not required,
 *                     set the conn_hdl parameter to BLE_GAP_INVALID_CONN_HDL.
 * @param[in] attr_hdl The attribute handle of the attribute value to be set.
 * @param[in] p_value  The attribute value to be set.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) The p_value parameter is specified as NULL.
 * @retval  BLE_ERR_INVALID_DATA(0x0002) The write size is larger than the length of the attribute value.
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The attr_hdl parameter is 0 or larger than the last attribute handle
 *                                      of GATT Database.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The attribute is not in a state to be written.
 * @retval  BLE_ERR_INVALID_OPERATION(0x0009) The attribute cannot be written.
 * @retval  BLE_ERR_NOT_FOUND(0x000D) The attribute specified by the attr_hdl parameter is not belonging to
 *                                    any services or characteristics.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The remote device specified by the conn_hdl parameter was not found.
 *********************************************************************************************************************/
ble_status_t R_BLE_GATTS_SetAttr(uint16_t conn_hdl, uint16_t attr_hdl, st_ble_gatt_value_t * p_value);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GATTS_SendErrRsp(uint16_t error_code)
 * @brief   This function sends an error response to a remote device.
 * @details  The result is returned from the API.\n
 *           The error code specified in the callback is notified as Error Response to the remote device.\n
 *           The result of this API call is returned by a return value.
 * @param[in] error_code The error codes to be notified the client.\n
 *                       It is a bitwise OR of GATT Error Group ID : 0x3000 and the following error codes defined
 *                       in Core Spec and Core Spec Supplement.
 *                      <table>
 *                          <tr>
 *                              <th>Error Code</th>
 *                              <th>description</th>
 *                          </tr>
 *                          <tr>
 *                              <td>BLE_ERR_GATT_INVALID_HANDLE(0x3001)</td>
 *                              <td>Invalid attribute handle</td>
 *                          </tr>
 *                          <tr>
 *                              <td>BLE_ERR_GATT_READ_NOT_PERMITTED(0x3002)</td>
 *                              <td>The attribute cannot be read.</td>
 *                          </tr>
 *                          <tr>
 *                              <td>BLE_ERR_GATT_WRITE_NOT_PERMITTED(0x3003)</td>
 *                              <td>The attribute cannot be written.</td>
 *                          </tr>
 *                          <tr>
 *                              <td>BLE_ERR_GATT_INVALID_PDU(0x3004)</td>
 *                              <td>Invalid PDU.</td>
 *                          </tr>
 *                          <tr>
 *                              <td>BLE_ERR_GATT_INSUFFICIENT_AUTHENTICATION(0x3005)</td>
 *                              <td>The authentication to access the attribute is insufficient.</td>
 *                          </tr>
 *                          <tr>
 *                              <td>BLE_ERR_GATT_REQUEST_NOT_SUPPORTED(0x3006)</td>
 *                              <td>The request is not supported.</td>
 *                          </tr>
 *                          <tr>
 *                              <td>BLE_ERR_GATT_INVALID_OFFSET(0x3007)</td>
 *                              <td>The specified offset is larger than the length of the attribute value.</td>
 *                          </tr>
 *                          <tr>
 *                              <td>BLE_ERR_GATT_INSUFFICIENT_AUTHORIZATION(0x3008)</td>
 *                              <td>Authorization is required to access the attribute.</td>
 *                          </tr>
 *                          <tr>
 *                              <td>BLE_ERR_GATT_PREPARE_WRITE_QUEUE_FULL(0x3009)</td>
 *                              <td>The Write Queue in the GATT Server is full.</td>
 *                          </tr>
 *                          <tr>
 *                              <td>BLE_ERR_GATT_ATTRIBUTE_NOT_FOUND(0x300A)</td>
 *                              <td>The specified attribute is not found.</td>
 *                          </tr>
 *                          <tr>
 *                              <td>BLE_ERR_GATT_ATTRIBUTE_NOT_LONG(0x300B)</td>
 *                              <td>The attribute cannot be read by Read Blob Request.</td>
 *                          </tr>
 *                          <tr>
 *                              <td>BLE_ERR_GATT_INSUFFICIENT_ENC_KEY_SIZE(0x300C)</td>
 *                              <td>The Encryption Key Size is insufficient.</td>
 *                          </tr>
 *                          <tr>
 *                              <td>BLE_ERR_GATT_INVALID_ATTRIBUTE_LEN(0x300D)</td>
 *                              <td>The length of the specified attribute is invalid.</td>
 *                          </tr>
 *                          <tr>
 *                              <td>BLE_ERR_GATT_UNLIKELY_ERROR(0x300E)</td>
 *                              <td>Because an error has occurred,  the process cannot be advanced.</td>
 *                          </tr>
 *                          <tr>
 *                              <td>BLE_ERR_GATT_INSUFFICIENT_ENCRYPTION(0x300F)</td>
 *                              <td>Encryption is required to access the attribute.
 *                              </td>
 *                          </tr>
 *                          <tr>
 *                              <td>BLE_ERR_GATT_UNSUPPORTED_GROUP_TYPE(0x3010)</td>
 *                              <td>The type of the specified attribute is not supported.
 *                              </td>
 *                          </tr>
 *                          <tr>
 *                              <td>BLE_ERR_GATT_INSUFFICIENT_RESOURCES(0x3011)</td>
 *                              <td>The resource to complete the request is insufficient.
 *                              </td>
 *                          </tr>
 *                          <tr>
 *                              <td>0x3080 - 0x309F</td>
 *                              <td>Application Error.
 *                              The upper layer defines the error codes.</td>
 *                          </tr>
 *                          <tr>
 *                              <td>0x30E0 - 0x30FF</td>
 *                              <td>
 *                                  The error code defined in Common Profile and Service Error
 *                                  Core Specification Supplement(CSS).<BR/>
 *                                  CSS ver.7 defines the error codes from 0x30FC to 0x30FF.
 *                              </td>
 *                          </tr>
 *                          <tr>
 *                              <td>BLE_ERR_GATT_WRITE_REQ_REJECTED(0x30FC)</td>
 *                              <td>The Write Request has not been completed due to the reason other than Permission.
 *                              </td>
 *                          </tr>
 *                          <tr>
 *                              <td>BLE_ERR_GATT_CCCD_IMPROPERLY_CFG(0x30FD)</td>
 *                              <td>The CCCD is set to be invalid.</td>
 *                          </tr>
 *                          <tr>
 *                              <td>BLE_ERR_GATT_PROC_ALREADY_IN_PROGRESS(0x30FE)</td>
 *                              <td>The request is now in progress.</td>
 *                          </tr>
 *                          <tr>
 *                              <td>BLE_ERR_GATT_OUT_OF_RANGE(0x30FF)</td>
 *                              <td>The attribute value is out of range.</td>
 *                          </tr>
 *                      </table>
 *
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The Group ID of the error_code parameter is not 0x3000, or it is 0x3000.
 * @retval  BLE_ERR_INVALID_OPERATION(0x0009) While processing other error response,this function was called.
 *********************************************************************************************************************/
ble_status_t R_BLE_GATTS_SendErrRsp(uint16_t error_code);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GATTS_RspExMtu(uint16_t conn_hdl, uint16_t mtu)
 * @brief   This function replies to a MTU Exchange Request from a remote device.
 * @details  BLE_GATTS_EVENT_EX_MTU_REQ event notifies the application layer
 *           that a MTU Exchange Request has been received.
 *           Therefore when the callback has received the event, call this function.\n
 *           The new MTU is the minimum of the mtu parameter specified by this function
 *           and the mtu field in BLE_GATTS_EVENT_EX_MTU_REQ event.\n
 *           Default MTU size is 23 bytes.\n
 *           The result of this API call is returned by a return value.\n
 * @param[in] conn_hdl Connection handle identifying the remote device to be sent MTU Exchange Response.
 * @param[in] mtu The maximum size(in bytes) of the GATT PDU that GATT Server can receive.\n
 *                Valid range is 23 <= mtu <= 247.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The mtu parameter is out of range.
 * @retval  BLE_ERR_INVALID_OPERATION(0x0009) This function was called while processing other request.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The remote device specified by conn_hdl was not found.
 *********************************************************************************************************************/
ble_status_t R_BLE_GATTS_RspExMtu(uint16_t conn_hdl, uint16_t mtu);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GATTS_SetPrepareQueue(st_ble_gatt_pre_queue_t * p_pre_queues, uint8_t queue_num)
 * @brief   Register prepare queue and buffer in Host Stack.
 * @details  This function registers the prepare queue and buffer for long chracteristic write and reliable writes.
 *           The result of this API call is returned by a return value.\n
 * @param[in] p_pre_queues The prepare write queues to be registered.
 * @param[in] queue_num The number of prepare write queues to be registered.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) The p_pre_queue parameter is specified as NULL.
 *********************************************************************************************************************/
ble_status_t R_BLE_GATTS_SetPrepareQueue(st_ble_gatt_pre_queue_t * p_pre_queues, uint8_t queue_num);

/*@}*/

