fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
/* ========================================== GATT Client API Declarations ========================================= */

/** @defgroup GATT_CLIENT_API GATT_CLIENT
 *  @ingroup BLE_API
 *  @{
 */

/******************************************************************************************************************//**
 * @ingroup GATT_CLIENT_API
 * @fn ble_status_t R_BLE_GATTC_Init(uint8_t cb_num)
 * @brief   This function initializes the GATT Client and registers the number of the callbacks for GATT Client event.
 * @details Specify the cb_num parameter to a value between 1 and BLE_GATTC_MAX_CB.\n
 *          R_BLE_GATTC_RegisterCb() registers the callback.\n
 *          The result of this API call is returned by a return value.
 * @param[in] cb_num The number of callbacks to be registered.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The cb_num parameter is out of range.
 *********************************************************************************************************************/
ble_status_t R_BLE_GATTC_Init(uint8_t cb_num);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GATTC_RegisterCb(ble_gattc_app_cb_t cb, uint8_t priority)
 * @brief   This function registers a callback function for GATT Client event.
 * @details The number of the callback that may be registered by this function is the value specified
 *          by R_BLE_GATTC_Init().\n
 *          The result of this API call is returned by a return value.
 * @param[in] cb Callback function for GATT Client event.
 * @param[in] priority  The priority of the callback function.\n
 *                      Valid range is 1 <= priority <= BLE_GATTC_MAX_CB.\n
 *                      A lower priority number means a higher priority level.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) The cb parameter is specified as NULL.
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The priority parameter is out of range.
 * @retval  BLE_ERR_CONTEXT_FULL(0x000B) Host stack has already registered the maximum number of callbacks.
 *********************************************************************************************************************/
ble_status_t R_BLE_GATTC_RegisterCb(ble_gattc_app_cb_t cb, uint8_t priority);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GATTC_DeregisterCb(ble_gattc_app_cb_t cb)
 * @brief   This function deregisters the callback function for GATT Client event.
 * @details The result of this API call is returned by a return value.
 * @param[in] cb The callback function to be deregistered.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) The cb parameter is specified as NULL.
 * @retval  BLE_ERR_NOT_FOUND(0x000D) The callback has not been registered.
 *********************************************************************************************************************/
ble_status_t R_BLE_GATTC_DeregisterCb(ble_gattc_app_cb_t cb);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GATTC_ReqExMtu(uint16_t conn_hdl, uint16_t mtu)
 * @brief   This function sends a MTU Exchange Request PDU to a GATT Server in order to change the current MTU.
 * @details  MTU Exchange Response is notified by BLE_GATTC_EVENT_EX_MTU_RSP event.\n
 *           The new MTU is the minimum value of the mtu parameter specified by this function and
 *           the mtu field in BLE_GATTC_EVENT_EX_MTU_RSP event.
 *           Default MTU size is 23 bytes.\n
 *           The result of this API call is returned by a return value.\n
 * @param[in] conn_hdl Connection handle identifying the GATT Server to be sent.
 * @param[in] mtu  The maximum size(in bytes) of the GATT PDU that GATT Client can receive. \n
 *                 Valid range is 23 <= mtu <= 247.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The mtu parameter is out of range.
 * @retval  BLE_ERR_INVALID_OPERATION(0x0009) While processing other request, this function was called.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The GATT Server specified by conn_hdl was not found.
 *********************************************************************************************************************/
ble_status_t R_BLE_GATTC_ReqExMtu(uint16_t conn_hdl, uint16_t mtu);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GATTC_DiscAllPrimServ(uint16_t conn_hdl)
 * @brief   This function discovers all Primary Services in a GATT Server.
 * @details  When 16-bit UUID Primary Service has been discovered, BLE_GATTC_EVENT_PRIM_SERV_16_DISC_IND event
 *           is notified to the application layer.\n
 *           When 128-bit UUID Primary Service has been discovered, BLE_GATTC_EVENT_PRIM_SERV_128_DISC_IND event
 *           is notified to the application layer.\n
 *           When the Primary Service discovery has been completed, BLE_GATTC_EVENT_ALL_PRIM_SERV_DISC_COMP event
 *           is notified to the application layer.
 * @param[in] conn_hdl Connection handle identifying the GATT Server to be discovered.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_OPERATION(0x0009) This function was called while processing other request.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The GATT Server specified by conn_hdl was not found.
 *********************************************************************************************************************/
ble_status_t R_BLE_GATTC_DiscAllPrimServ(uint16_t conn_hdl);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GATTC_DiscPrimServ(uint16_t conn_hdl, uint8_t * p_uuid, uint8_t uuid_type)
 * @brief   This function discovers Primary Service specified by p_uuid in a GATT Server.
 * @details  When Primary Service whose uuid is the same as the specified uuid has been discovered,
 *           BLE_GATTC_EVENT_PRIM_SERV_16_DISC_IND event or BLE_GATTC_EVENT_PRIM_SERV_128_DISC_IND event is
 *           notified to the application layer.\n
 *           When the Primary Service discovery has been completed, BLE_GATTC_EVENT_PRIM_SERV_DISC_COMP event
 *           is notified to the application layer.
 * @param[in] conn_hdl Connection handle identifying the GATT Server to be discovered.
 * @param[in] p_uuid UUID of Primary Service to be discovered.
 * @param[in] uuid_type UUID type(16-bit or 128-bit).
 *                      |              macro                 | description      |
 *                      |:---------------------------------- |:---------------- |
 *                      | BLE_GATT_16_BIT_UUID_FORMAT(0x01)  | 16-bit UUID      |
 *                      | BLE_GATT_128_BIT_UUID_FORMAT(0x02) | 128-bit UUID     |
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) The p_uuid parameter is specified as NULL.
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The uuid_type parameter is out of range.
 * @retval  BLE_ERR_INVALID_OPERATION(0x0009) While processing other request, this function was called.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The GATT Server specified by conn_hdl was not found.
 *********************************************************************************************************************/
ble_status_t R_BLE_GATTC_DiscPrimServ(uint16_t conn_hdl, uint8_t * p_uuid, uint8_t uuid_type);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GATTC_DiscAllSecondServ( uint16_t conn_hdl)
 * @brief   This function discovers all Secondary Services in a GATT Server.
 * @details  When a 16-bit UUID Secondary Service has been discovered, BLE_GATTC_EVENT_SECOND_SERV_16_DISC_IND event
 *           is notified to the application layer.\n
 *           When a 128-bit UUID Secondary Service has been discovered, BLE_GATTC_EVENT_SECOND_SERV_128_DISC_IND event
 *           is notified to the application layer.\n
 *           When the Secondary Service discovery has been completed, BLE_GATTC_EVENT_ALL_SECOND_SERV_DISC_COMP event
 *           is notified to the application layer.\n
 * @param[in] conn_hdl Connection handle identifying the GATT Server to be discovered.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_OPERATION(0x0009) While processing other request, this function was called.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The GATT Server specified by conn_hdl was not found.
 *********************************************************************************************************************/
ble_status_t R_BLE_GATTC_DiscAllSecondServ(uint16_t conn_hdl);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GATTC_DiscIncServ(uint16_t conn_hdl, st_ble_gatt_hdl_range_t * p_range)
 * @brief   This function discovers Included Services within the specified attribute handle range in a GATT Server.
 * @details  When Included Service that includes 16-bit UUID Service has been discovered,
 *           BLE_GATTC_EVENT_INC_SERV_16_DISC_IND event is notified to the application layer.\n
 *           When Included Service that includes 128-bit UUID Service has been discovered,
 *           BLE_GATTC_EVENT_INC_SERV_128_DISC_IND event is notified to the application layer.\n
 *           When the Included Service discovery has been completed,
 *           BLE_GATTC_EVENT_INC_SERV_DISC_COMP event is notified to the application layer.\n
 * @param[in] conn_hdl Connection handle identifying the GATT Server to be discovered.
 * @param[in] p_range Retrieval range of Included Service.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) The p_range parameter is specified as NULL.
 * @retval  BLE_ERR_INVALID_OPERATION(0x0009) While processing other request, this function was called.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The GATT Server specified by conn_hdl was not found.
 *********************************************************************************************************************/
ble_status_t R_BLE_GATTC_DiscIncServ(uint16_t conn_hdl, st_ble_gatt_hdl_range_t * p_range);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GATTC_DiscAllChar(uint16_t conn_hdl, st_ble_gatt_hdl_range_t * p_range)
 * @brief   This function discovers Characteristic within the specified attribute handle range in a GATT Server.
 * @details  When 16-bit UUID Characteristic has been discovered, BLE_GATTC_EVENT_CHAR_16_DISC_IND event
 *           is notified to the application layer.\n
 *           When 128-bit UUID Characteristic has been discovered, BLE_GATTC_EVENT_CHAR_128_DISC_IND event
 *           is notified to the application layer.\n
 *           When the Characteristic discovery has been completed, BLE_GATTC_EVENT_ALL_CHAR_DISC_COMP event
 *           is notified to the application layer.\n
 * @param[in] conn_hdl Connection handle identifying the GATT Server to be discovered.
 * @param[in] p_range Retrieval range of Characteristic.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) The p_range parameter is specified as NULL.
 * @retval  BLE_ERR_INVALID_OPERATION(0x0009) While processing other request, this function was called.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The GATT Server specified by conn_hdl was not found.
 *********************************************************************************************************************/
ble_status_t R_BLE_GATTC_DiscAllChar(uint16_t conn_hdl, st_ble_gatt_hdl_range_t * p_range);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GATTC_DiscCharByUuid(uint16_t conn_hdl,
 *                                             uint8_t * p_uuid,
 *                                             uint8_t uuid_type,
 *                                             st_ble_gatt_hdl_range_t * p_range
 *                                            )
 * @brief   This function discovers Characteristic specified by uuid within the specified attribute handle range
 *          in a GATT Server.
 * @details  When 16-bit UUID Characteristic has been discovered, BLE_GATTC_EVENT_CHAR_16_DISC_IND event
 *           is notified to the application layer.\n
 *           When 128-bit UUID Characteristic has been discovered, BLE_GATTC_EVENT_CHAR_128_DISC_IND event
 *           is notified to the application layer.\n
 *           When the Characteristic discovery has been completed, BLE_GATTC_EVENT_CHAR_DISC_COMP event
 *           is notified to the application layer.\n
 * @param[in] conn_hdl Connection handle identifying the GATT Server to be discovered.
 * @param[in] p_uuid UUID of Characteristic to be discovered.
 * @param[in] uuid_type UUID type of Characteristic to be discovered.
 *                      |              macro                 |           description                 |
 *                      |:---------------------------------- |:------------------------------------- |
 *                      | BLE_GATT_16_BIT_UUID_FORMAT(0x01)  | The p_uuid parameter is 16-bit UUID.  |
 *                      | BLE_GATT_128_BIT_UUID_FORMAT(0x02) | The p_uuid parameter is 128-bit UUID. |
 * @param[in] p_range Retrieval range of Characteristic.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) The p_uuid parameter or the p_range parameter is specified as NULL.
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The uuid_type parameter is out of range.
 * @retval  BLE_ERR_INVALID_OPERATION(0x0009) While processing other request, this function was called.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The GATT Server specified by conn_hdl was not found.
 *********************************************************************************************************************/
ble_status_t R_BLE_GATTC_DiscCharByUuid(uint16_t                  conn_hdl,
                                        uint8_t                 * p_uuid,
                                        uint8_t                   uuid_type,
                                        st_ble_gatt_hdl_range_t * p_range);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GATTC_DiscAllCharDesc(uint16_t conn_hdl, st_ble_gatt_hdl_range_t * p_range)
 * @brief   This function discovers Characteristic Descriptor within the specified attribute handle range
 *          in a GATT Server.
 * @details When 16-bit UUID Characteristic Descriptor has been discovered, BLE_GATTC_EVENT_CHAR_DESC_16_DISC_IND
 *          event is notified to the application layer.
 *          When 128-bit UUID Characteristic Descriptor has been discovered, BLE_GATTC_EVENT_CHAR_DESC_128_DISC_IND
 *          event is notified to the application layer.
 *          When the Characteristic Descriptor discovery has been completed, BLE_GATTC_EVENT_ALL_CHAR_DESC_DISC_COMP
 *          event is notified to the application layer.
 * @param[in] conn_hdl Connection handle identifying the GATT Server to be discovered.
 * @param[in] p_range Retrieval range of Characteristic Descriptor.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) The p_range parameter is specified as NULL.
 * @retval  BLE_ERR_INVALID_OPERATION(0x0009) While processing other request, this function was called.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The GATT Server specified by conn_hdl was not found.
 *********************************************************************************************************************/
ble_status_t R_BLE_GATTC_DiscAllCharDesc(uint16_t conn_hdl, st_ble_gatt_hdl_range_t * p_range);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GATTC_ReadChar(uint16_t conn_hdl, uint16_t value_hdl)
 * @brief   This function reads a Characteristic/Characteristic Descriptor in a GATT Server.
 * @details The result of the read is notified in BLE_GATTC_EVENT_CHAR_READ_RSP event.
 * @param[in] conn_hdl Connection handle identifying the GATT Server to be read.
 * @param[in] value_hdl Value handle of the Characteristic/Characteristic Descriptor to be read.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_ARG(0x0003) 0 is specified in the value_hdl parameter.
 * @retval  BLE_ERR_INVALID_OPERATION(0x0009) While processing other request, this function was called.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The GATT Server specified by conn_hdl was not found.
 *********************************************************************************************************************/
ble_status_t R_BLE_GATTC_ReadChar(uint16_t conn_hdl, uint16_t value_hdl);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GATTC_ReadCharUsingUuid(uint16_t conn_hdl,
 *                                             uint8_t * p_uuid,
 *                                             uint8_t uuid_type,
 *                                             st_ble_gatt_hdl_range_t * p_range
 *                                            );
 * @brief   This function reads a Characteristic in a GATT Server using a specified UUID.
 * @details  The result of the read is notified in BLE_GATTC_EVENT_CHAR_READ_BY_UUID_RSP event.
 * @param[in] conn_hdl Connection handle that identifies Characteristic to be read to GATT Server.
 * @param[in] p_uuid UUID of the Characteristic to be read.
 * @param[in] uuid_type  UUID type of the Characteristic to be read.
 *                      |              macro                 |           description                 |
 *                      |:---------------------------------- |:------------------------------------- |
 *                      | BLE_GATT_16_BIT_UUID_FORMAT(0x01)  | The p_uuid parameter is 16-bit UUID.  |
 *                      | BLE_GATT_128_BIT_UUID_FORMAT(0x02) | The p_uuid parameter is 128-bit UUID. |
 * @param[in] p_range Retrieval range of Characteristic.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) The p_uuid parameter or the p_range parameter is specified as NULL.
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The uuid_type parameter is out of range.
 * @retval  BLE_ERR_INVALID_OPERATION(0x0009) While processing other request, this function was called.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The GATT Server specified by conn_hdl was not found.
 *********************************************************************************************************************/
ble_status_t R_BLE_GATTC_ReadCharUsingUuid(uint16_t                  conn_hdl,
                                           uint8_t                 * p_uuid,
                                           uint8_t                   uuid_type,
                                           st_ble_gatt_hdl_range_t * p_range);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GATTC_ReadLongChar(uint16_t conn_hdl, uint16_t value_hdl, uint16_t offset)
 * @brief   This function reads a Long Characteristic in a GATT Server.
 * @details The contents of the Long Characteristic that has been read is notified every MTU-1 bytes to
 *          the application layer by BLE_GATTC_EVENT_CHAR_READ_RSP event.\n
 *          When all of the contents has been received in GATT Client, BLE_GATTC_EVENT_LONG_CHAR_READ_COMP event
 *          is notified to the application layer.
 * @param[in] conn_hdl Connection handle identifying the GATT Server to be read.
 * @param[in] value_hdl Value handle of the Long Characteristic to be read.
 * @param[in] offset Offset that indicates the location to be read.\n
 *                   Normally, set 0 to this parameter.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_ARG(0x0003) 0 is specified in the value_hdl parameter.
 * @retval  BLE_ERR_INVALID_OPERATION(0x0009) While processing other request, this function was called.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The GATT Server specified by conn_hdl was not found.
 *********************************************************************************************************************/
ble_status_t R_BLE_GATTC_ReadLongChar(uint16_t conn_hdl, uint16_t value_hdl, uint16_t offset);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GATTC_ReadMultiChar(uint16_t conn_hdl, st_ble_gattc_rd_multi_req_param_t * p_list)
 * @brief   This function reads multiple Characteristics in a GATT Server.
 * @details The contents of the multiple Characteristics that has been read is notified to the application layer
 *          by BLE_GATTC_EVENT_MULTI_CHAR_READ_RSP event.
 * @param[in] conn_hdl Connection handle that identifies Characteristic to be read to GATT Server.
 * @param[in] p_list List of Value Handles that point the Characteristics to be read.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) The p_list parameter or the p_hdl_list field in the p_list parameter is
 *                                      specified as NULL.
 * @retval  BLE_ERR_INVALID_ARG(0x0003) 0 is specified in the list_count field in the p_list parameter.
 * @retval  BLE_ERR_INVALID_OPERATION(0x0009) While processing other request, this function was called.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The GATT Server specified by conn_hdl was not found.
 *********************************************************************************************************************/
ble_status_t R_BLE_GATTC_ReadMultiChar(uint16_t conn_hdl, st_ble_gattc_rd_multi_req_param_t * p_list);

