fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GATTC_WriteCharWithoutRsp(uint16_t conn_hdl, st_ble_gatt_hdl_value_pair_t * p_write_data)
 * @brief   This function writes a Characteristic in a GATT Server without response.
 * @details The result is returned from the API.
 * @param[in] conn_hdl Connection handle that identifies Characteristic to be read to GATT Server.
 * @param[in] p_write_data Value to be written to the Characteristic.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) The p_write_data parameter or the p_value field in the value field
 *                                      in the p_write_data parameter is specified as NULL.
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The reason for this error is as follows:
 *                      - 0 is specified in the value_len field in the p_value field in the p_write_data parameter.
 *                      - 0 is specified in the attr_hdl field in the p_write_data parameter.
 * @retval  BLE_ERR_INVALID_OPERATION(0x0009) While processing other request, this function was called.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The GATT Server specified by conn_hdl was not found.
 *********************************************************************************************************************/
ble_status_t R_BLE_GATTC_WriteCharWithoutRsp(uint16_t conn_hdl, st_ble_gatt_hdl_value_pair_t * p_write_data);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GATTC_SignedWriteChar(uint16_t conn_hdl, st_ble_gatt_hdl_value_pair_t * p_write_data)
 * @brief   This function writes Signed Data to a Characteristic in a GATT Server without response.
 * @details The result of this API call is returned by a return value.
 * @param[in] conn_hdl Connection handle identifying the GATT Server to be written.
 * @param[in] p_write_data Signed Data to be written to the Characteristic.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) The p_write_data parameter or the p_value field in the value field
 *                                      in the p_write_data parameter is specified as NULL.
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The reason for this error is as follows:
 *                      - 0 is specified in the value_len field in the value field in the p_write_data parameter.
 *                      - 0 is specified in the attr_hdl field in the p_write_data parameter.
 * @retval  BLE_ERR_INVALID_OPERATION(0x0009) While processing other request, this function was called.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function or Signed Data.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The GATT Server specified by conn_hdl was not found.
 *********************************************************************************************************************/
ble_status_t R_BLE_GATTC_SignedWriteChar(uint16_t conn_hdl, st_ble_gatt_hdl_value_pair_t * p_write_data);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GATTC_WriteChar(uint16_t conn_hdl, st_ble_gatt_hdl_value_pair_t * p_write_data)
 * @brief   This function writes a Characteristic in a GATT Server.
 * @details The result of the write is notified in BLE_GATTC_EVENT_CHAR_WRITE_RSP event.
 * @param[in] conn_hdl  Connection handle identifying the GATT Server to be written.
 * @param[in] p_write_data Value to be written to the Characteristic.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) The p_write_data parameter or the p_value field in the value field
 *                                      in the p_write_data parameter is specified as NULL.
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The reason for this error is as follows:
 *                      - 0 is specified in the value_len field in the value field in the p_write_data parameter.
 *                      - 0 is specified in the attr_hdl field in the p_write_data parameter.
 * @retval  BLE_ERR_INVALID_OPERATION(0x0009) While processing other request, this function was called.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The GATT Server specified by conn_hdl was not found.
 *********************************************************************************************************************/
ble_status_t R_BLE_GATTC_WriteChar(uint16_t conn_hdl, st_ble_gatt_hdl_value_pair_t * p_write_data);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GATTC_WriteLongChar(uint16_t conn_hdl,
 *                                            st_ble_gatt_hdl_value_pair_t * p_write_data,
 *                                            uint16_t offset
 *                                            )
 * @brief   This function writes a Long Characteristic in a GATT Server.
 * @details The result of a write that has been done every segmentation is notified to the application layer
 *          in BLE_GATTC_EVENT_CHAR_PART_WRITE_RSP event.\n
 *          The maximum writable size to a Long Characteristic with this function is 512 bytes.\n
 *          When all of the contents has been written to the Long Characteristic, BLE_GATTC_EVENT_LONG_CHAR_WRITE_COMP
 *          event is notified to the application layer.
 * @param[in] conn_hdl Connection handle identifying the GATT Server to be written.
 * @param[in] p_write_data Value to be written to the Long Characteristic.
 * @param[in] offset Offset that indicates the location to be written.
 *                   Normally, set 0 to this parameter.\n
 *                   If this parameter sets to a value other than 0, adjust the offset parameter and
 *                   the length of the value to be written not to exceed the length of the Long Characteristic.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) The p_write_data parameter or the p_value field in the value field in
 *                                      the p_write_data parameter is specified as NULL.
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The reason for this error is as follows:
 *            - The value_len field in the value field in the p_write_data parameter is 0.
 *            - The sum of the value_len field in the value field in the p_write_data parameter
 *              and the offset parameter larger than 512.
 *            - The attr_hdl field in the p_write_data parameter is 0.
 * @retval  BLE_ERR_INVALID_OPERATION(0x0009) While processing other request, this function was called.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The GATT Server specified by conn_hdl was not found.
 *********************************************************************************************************************/
ble_status_t R_BLE_GATTC_WriteLongChar(uint16_t conn_hdl, st_ble_gatt_hdl_value_pair_t * p_write_data,
                                       uint16_t offset);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GATTC_ReliableWrites(uint16_t conn_hdl,
 *                                             st_ble_gattc_reliable_writes_char_pair_t * p_char_pair,
 *                                             uint8_t pair_num,
 *                                             uint8_t auto_flag
 *                                            )
 * @brief   This function performs the Reliable Writes procedure described in GATT Specification.
 * @details When the data written to the Characteristic has been transmitted, BLE_GATTC_EVENT_CHAR_PART_WRITE_RSP
 *          event is notified to the application layer.\n
 *          If the data included in the event is different from the data that GATT Client has sent,
 *          host stack automatically cancels the Reliable Writes.\n
 *          After all of the contents has been sent to the GATT Server, if the auto_flag parameter has been set to
 *          BLE_GATTC_EXEC_AUTO, the GATT Server automatically writes the data to the Characteristic.\n
 *          If the auto_flag parameter has been set to BLE_GATTC_EXEC_NOT_AUTO,
 *          BLE_GATTC_EVENT_RELIABLE_WRITES_TX_COMP
 *          event notifies the application layer in GATT Client that all of the contents has been sent to
 *          the GATT Server. Then GATT Client requests for writing the data to the Characteristic to the GATT Server
 *          with R_BLE_GATTC_ExecWrite().\n
 *          When the write has been done, BLE_GATTC_EVENT_RELIABLE_WRITES_COMP event is notified to
 *          the application layer.
 * @param[in] conn_hdl Connection handle identifying the GATT Server to be written.
 * @param[in] p_char_pair Pair of Characteristic Value and Characteristic Value Handle identifying the Characteristic
 *                        to be written by Reliable Writes.
 * @param[in] pair_num The number of the pairs specified by the p_char_pair parameter.\n
 *                   Valid range is 0 < pair_num <= BLE_GATTC_RELIABLE_WRITES_MAX_CHAR_PAIR.
 * @param[in] auto_flag  The flag that indicates whether auto execution or not.
 *        |              macro             |   description       |
 *        |:------------------------------ |:------------------- |
 *        | BLE_GATTC_EXEC_AUTO(0x01)      | Auto execution.     |
 *        | BLE_GATTC_EXEC_NOT_AUTO (0x02) | Not auto execution. |
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) The reason for this error is as follows:
 *       - The p_char_pair parameter is specified as NULL.
 *       - The p_value field in the value field in the write_data field in the p_char_pair parameter
 *         is specified as NULL.
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The reason for this error is as follows:
 *       - The pair_num parameter or the auto_flag parameter is out of range.
 *       - The value_len field in the value field in the write_data field in the p_char_pair parameter is 0.
 * @retval  BLE_ERR_INVALID_OPERATION(0x0009) While processing other request, this function was called.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function or
 *                                           to store the temporary write data.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The GATT Server specified by conn_hdl was not found.
 *********************************************************************************************************************/
ble_status_t R_BLE_GATTC_ReliableWrites(uint16_t                                   conn_hdl,
                                        st_ble_gattc_reliable_writes_char_pair_t * p_char_pair,
                                        uint8_t                                    pair_num,
                                        uint8_t                                    auto_flag);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_GATTC_ExecWrite(uint16_t conn_hdl, uint8_t exe_flag)
 * @brief   If the auto execute of Reliable Writes is not specified by R_BLE_GATTC_ReliableWrites(),
 *          this function is used to execute a write to Characteristic.
 * @details When all of the contents has been sent to the GATT Server, BLE_GATTC_EVENT_RELIABLE_WRITES_TX_COMP event
 *          notifies the application layer.\n
 *          After this event has been received, execute the write by this function.\n
 *          The result of the write is notified by BLE_GATTC_EVENT_RELIABLE_WRITES_COMP event.
 * @param[in] conn_hdl Connection handle identifying the target GATT Server.
 * @param[in] exe_flag The flag that indicates whether execution or cancellation.
 *        |              macro                          |   description       |
 *        |:------------------------------------------- |:------------------- |
 *        | BLE_GATTC_EXECUTE_WRITE_CANCEL_FLAG(0x00)   | Execute the write.  |
 *        | BLE_GATTC_EXECUTE_WRITE_EXEC_FLAG(0x01)     | Cancel the write.   |
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The exe_flag parameter is out of range.
 * @retval  BLE_ERR_INVALID_OPERATION(0x0009) The reason for this error is as follows:
 *           - GATT Client has not requested for Reliable Writes by R_BLE_GATTC_ReliableWrites().
 *           - Although auto execution has been specified by R_BLE_GATTC_ReliableWrites(), this function was called.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The GATT Server specified by conn_hdl was not found.
 *********************************************************************************************************************/
ble_status_t R_BLE_GATTC_ExecWrite(uint16_t conn_hdl, uint8_t exe_flag);

/*@}*/

/* ============================================= L2CAP API Declarations ============================================ */

/** @defgroup L2CAP_API L2CAP
 *  @ingroup BLE_API
 *  @{
 */

/******************************************************************************************************************//**
 * @ingroup L2CAP_API
 * @fn ble_status_t R_BLE_L2CAP_RegisterCfPsm(ble_l2cap_cf_app_cb_t cb, uint16_t psm, uint16_t lwm)
 * @brief   This function registers PSM that uses L2CAP CBFC Channel and a callback for L2CAP event.
 * @details Only one callback is available per PSM. Configure in each PSM the Low Water Mark of the LE-Frames
 *          that the local device can receive.\n
 *          When the number of the credit reaches the Low Water Mark, BLE_L2CAP_EVENT_CF_LOW_RX_CRD_IND event is
 *          notified to the application layer.\n
 *          The number of PSM is defined as BLE_L2CAP_MAX_CBFC_PSM.\n
 *          The result of this API call is returned by a return value.
 * @param[in] cb Callback function for L2CAP event.
 * @param[in] psm  Identifier indicating the protocol/profile that uses L2CAP CBFC Channel.
 *              <table>
 *                  <tr>
 *                      <th>type</th>
 *                      <th>range</th>
 *                      <th>description</th>
 *                  </tr>
 *                  <tr>
 *                      <td>Fixed, SIG assigned</td>
 *                      <td>0x0001 - 0x007F</td>
 *                      <td>PSM defined by SIG. For more information on PSM, refer Bluetooth SIG Assigned Number
 *                          (https://www.bluetooth.com/specifications/assigned-numbers).
 *                      </td>
 *                  </tr>
 *                  <tr>
 *                      <td>Dynamic</td>
 *                      <td>0x0080 - 0x00FF</td>
 *                      <td>
 *                          Statically allocated PSM by custom protocol or dynamically allocated PSM by GATT Service.
 *                      </td>
 *                  </tr>
 *              </table>
 * @param[in] lwm Low Water Mark that indicates the LE-Frame numbers that the local device can receive.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) The cb parameter is specified as NULL.
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The psm parameter is out of range.
 * @retval  BLE_ERR_CONTEXT_FULL(0x000B) More than BLE_L2CAP_MAX_CBFC_PSM+1 PSMs, callbacks has been registered.
 *********************************************************************************************************************/
ble_status_t R_BLE_L2CAP_RegisterCfPsm(ble_l2cap_cf_app_cb_t cb, uint16_t psm, uint16_t lwm);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_L2CAP_DeregisterCfPsm(uint16_t psm)
 * @brief   This function stops the use of the L2CAP CBFC Channel specified by the psm parameter and
 *          deregisters the callback function for L2CAP event.
 * @details The result of this API call is returned by a return value.
 * @param[in] psm PSM that is to be stopped to use the L2CAP CBFC Channel.\n
 *                Set the PSM registered by R_BLE_L2CAP_RegisterCfPsm().
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_NOT_FOUND(0x000D) The callback function allocated by the psm parameter is not found.
 *********************************************************************************************************************/
ble_status_t R_BLE_L2CAP_DeregisterCfPsm(uint16_t psm);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_L2CAP_ReqCfConn(uint16_t conn_hdl, st_ble_l2cap_conn_req_param_t * p_conn_req_param)
 * @brief   This function sends a connection request for L2CAP CBFC Channel.
 * @details The connection response is notified by BLE_L2CAP_EVENT_CF_CONN_CNF event.\n
 *          The result of this API call is returned by a return value.
 * @param[in] conn_hdl Connection handle identifying the remote device that the connection request is sent to.
 * @param[in] p_conn_req_param Connection request parameters.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) The p_conn_req_param parameter is specified as NULL.
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The mtu parameter or the mps parameter is out of range.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) CF Channel connection has not been established.
 * @retval  BLE_ERR_CONTEXT_FULL(0x000B) New CF Channel can not be registered or other L2CAP Command is processing.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) Insufficient memory is needed to generate this function.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The remote device specified by conn_hdl is not found.
 * @retval  BLE_ERR_NOT_YET_READY(0x0012) The psm parameter is not registered.
 *********************************************************************************************************************/
ble_status_t R_BLE_L2CAP_ReqCfConn(uint16_t conn_hdl, st_ble_l2cap_conn_req_param_t * p_conn_req_param);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_L2CAP_RspCfConn(st_ble_l2cap_conn_rsp_param_t * p_conn_rsp_param)
 * @brief   This function replies to the connection request for L2CAP CBFC Channel from the remote device.
 * @details The connection request is notified by BLE_L2CAP_EVENT_CF_CONN_IND event.
 *          The result of this API call is returned by a return value.
 * @param[in] p_conn_rsp_param Connection response parameters.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) The p_conn_rsp_param parameter is specified as NULL.
 * @retval  BLE_ERR_NOT_FOUND(0x000D) A connection request for L2CAP CBFC Channel has not been received,
 *                                   or CID specified by the lcid field in the p_conn_rsp_param parameter is not found.
 *********************************************************************************************************************/
ble_status_t R_BLE_L2CAP_RspCfConn(st_ble_l2cap_conn_rsp_param_t * p_conn_rsp_param);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_L2CAP_DisconnectCf(uint16_t lcid)
 * @brief   This function sends a disconnection request for L2CAP CBFC Channel.
 * @details When L2CAP CBFC Channel has been disconnected,
 *          BLE_L2CAP_EVENT_CF_DISCONN_CNF event is notified to the application layer.
 * @param[in] lcid CID identifying the L2CAP CBFC Channel that has been disconnected.\n
 *                 The valid range is 0x40 - (0x40 + BLE_L2CAP_MAX_CBFC_PSM - 1).
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_OPERATION(0x0009) CF Channel connection has not been established.
 * @retval  BLE_ERR_CONTEXT_FULL(0x000B) This function was called while processing other L2CAP command.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) There are no memories for L2CAP Command.
 * @retval  BLE_ERR_NOT_FOUND(0x000D) CID specified the lcid parameter is not found.
 *********************************************************************************************************************/
ble_status_t R_BLE_L2CAP_DisconnectCf(uint16_t lcid);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_L2CAP_SendCfCredit(uint16_t lcid, uint16_t credit)
 * @brief   This function sends credit to a remote device.
 * @details In L2CAP CBFC communication, if credit is 0, the remote device stops data transmission.\n
 *          Therefore when processing the received data has been completed and local device affords to receive data,
 *          the remote device is notified of the number of LE-Frame that local device can receive
 *          by this function and local device can continue to receive data from the remote device.\n
 *          The result of this API call is returned by a return value.
 * @param[in] lcid CID identifying the L2CAP CBFC Channel on local device that sends credit.
 * @param[in] credit  Credit to be sent to the remote device.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The credit parameter is set to 0.
 * @retval  BLE_ERR_CONTEXT_FULL(0x000B) This function was called while processing other L2CAP command.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) There are no memories for L2CAP Command.
 *********************************************************************************************************************/
ble_status_t R_BLE_L2CAP_SendCfCredit(uint16_t lcid, uint16_t credit);

