fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_L2CAP_SendCfData(uint16_t conn_hdl, uint16_t lcid, uint16_t data_len, uint8_t * p_sdu)
 * @brief   This function sends the data to a remote device via L2CAP CBFC Channel.
 * @details When the data transmission to Controller has been completed,
 *          BLE_L2CAP_EVENT_CF_TX_DATA_CNF event is notified to the application layer.
 * @param[in] conn_hdl Connection handle identifying the remote device to be sent the data.
 * @param[in] lcid  CID identifying the L2CAP CBFC Channel on local device used in the data transmission.
 * @param[in] data_len Length of the data.
 * @param[in] p_sdu Service Data Unit. \n
 *            Input the data length specified by the data_len parameter to the first 2 bytes (Little Endian).
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) The p_data parameter is specified as NULL.
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The length parameter is out of range.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) CF Channel connection has not been established or the data whose length
 *                                        exceeds the MTU has been sent.
 * @retval  BLE_ERR_ALREADY_IN_PROGRESS(0x000A) Data transmission has been already started.
 * @retval  BLE_ERR_CONTEXT_FULL(0x000B) L2CAP task queue is full.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) There are no memories for L2CAP Command.
 * @retval  BLE_ERR_NOT_FOUND(0x000D) CID specified the lcid parameter is not found.
 * @retval  BLE_ERR_INVALID_HDL(0x000E) The remote device specified by the conn_hdl parameter is not found.
 *********************************************************************************************************************/
ble_status_t R_BLE_L2CAP_SendCfData(uint16_t conn_hdl, uint16_t lcid, uint16_t data_len, uint8_t * p_sdu);

/*@}*/

/* ======================================== Vendor Specific API Declarations ======================================= */

/** @defgroup VS_API VS
 *  @ingroup BLE_API
 *  @{
 */

/******************************************************************************************************************//**
 * @ingroup VS_API
 * @fn ble_status_t R_BLE_VS_Init(ble_vs_app_cb_t vs_cb)
 * @brief   This function initializes Vendor Specific API and registers a callback function for Vendor Specific Event.
 * @details The result of this API call is returned by a return value.
 * @param[in] vs_cb Callback function to be registered.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) The vs_cb parameter is specified as NULL.
 * @retval  BLE_ERR_CONTEXT_FULL(0x000B) Callback function has already been registered.
 *********************************************************************************************************************/
ble_status_t R_BLE_VS_Init(ble_vs_app_cb_t vs_cb);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_VS_StartTxTest(st_ble_vs_tx_test_param_t * p_tx_test_param)
 * @brief   This function starts extended Transmitter Test.
 * @details The following extended transmitter test functions of DTM Tx are supported by this function.
 *            - Tx Power
 *            - Tx Modulation Enable/Modulation Disable
 *            - Tx packet transmission/continuous transmission
 *            - Tx packets count
 *
 *           The result of this API call is notified in BLE_VS_EVENT_TX_TEST_START event.\n
 *           If the num_of_packet field in the p_tx_test_param parameter is other than 0x0000,
 *           BLE_VS_EVENT_TX_TEST_TERM event notifies the application layer that the number of packet has been sent.\n
 *           If R_BLE_VS_EndTest() is called before the specified number of packets completions,
 *           BLE_VS_EVENT_TX_TEST_TERM event is not notified to the application layer.
 *
 *           The condition that phy field in the p_tx_test_param parameter is @ref BLE_VS_EH_TEST_PHY_CODED_S_8(0x03)
 *           and option field is modulation(bit0:0) & continuous transmission(bit1:1) is not supported.
 *
 * @param[in] p_tx_test_param Tx Test parameters.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) The p_tx_test_param parameter is specified as NULL.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) There are no memories for Vendor Specific Command.
 *********************************************************************************************************************/
ble_status_t R_BLE_VS_StartTxTest(st_ble_vs_tx_test_param_t * p_tx_test_param);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_VS_StartRxTest(st_ble_vs_rx_test_param_t * p_rx_test_param)
 * @brief   This function starts extended Receiver Test.
 * @details The result of this API call is notified in BLE_VS_EVENT_RX_TEST_START event.
 *          The following extended receiver test functions of DTM Rx are supported by this function.
 *            - Calculating the maximum, the minimum and the average of RSSI in the receiver test.
 *            - The number of CRC error packets in the receiver test.
 *
 *          The transmitter is configured to one of the following, the receiver can't receive the packets 
 *          by this function.\n
 *          - Tx Non-Modulation Enable
 *          - Tx continuous transmission
 *          \n
 *          After R_BLE_VS_EndTest() has been called,
 *          the receiver test result value are notified in BLE_VS_EVENT_TEST_END event.
 *
 * @param[in] p_rx_test_param The extended receiver test parameters.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) The p_rx_test_param parameter is specified as NULL.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) There are no memories for Vendor Specific Command.
 *********************************************************************************************************************/
ble_status_t R_BLE_VS_StartRxTest(st_ble_vs_rx_test_param_t * p_rx_test_param);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_VS_EndTest(void)
 * @brief   This function terminates the extended transmitter or receiver test.
 * @details The result of this API call is notified in BLE_VS_EVENT_TEST_END event.
 *          In case of extended receiver test, this event notifies the application layer of
 *          the result of the extended receiver test.
 *
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) There are no memories for Vendor Specific Command.
 *********************************************************************************************************************/
ble_status_t R_BLE_VS_EndTest(void);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_VS_SetTxPower(uint16_t conn_hdl, uint8_t tx_power)
 * @brief   This function configures transmit power.
 * @details This function configures the following transmit power.
 *          - The transmit power used in sending advertising PDU, scan request PDU,
 *             connection request PDU (in not connected state)
 *          - The transmit power used in sending PDU in connected state.
 *          When configuring the transmit power used in not connected state, set the conn_hdl parameter
 *          to BLE_GAP_INIT_CONN_HDL(0xFFFF).\n
 *          When the transmit power used in connected state is configured, set the conn_hdl parameter
 *          to the connection handle of the link.\n
 *          Select one of the following transmit power levels.
 *          - High
 *          - Middle
 *          - Low
 *
 *          Max transmit power of "High" is dependent on the configuration of the firmware.
 *          The result of this API call is notified in BLE_VS_EVENT_SET_TX_POWER event.
 *
 * @param[in] conn_hdl Connection handle identifying the link whose transmit power to be configured.
 *            If non connected state, set BLE_GAP_INIT_CONN_HDL(0xFFFF).
 * @param[in] tx_power Transmission power. Select one of the following.
 *                     - BLE_VS_TX_POWER_HIGH(0x00)
 *                     - BLE_VS_TX_POWER_MID(0x01)
 *                     - BLE_VS_TX_POWER_LOW(0x02)
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) There are no memories for Vendor Specific Command.
 *********************************************************************************************************************/
ble_status_t R_BLE_VS_SetTxPower(uint16_t conn_hdl, uint8_t tx_power);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_VS_GetTxPower(uint16_t conn_hdl)
 * @brief   This function gets transmit power.
 * @details This function gets the following transmit power.
 *            - The transmit power used in sending advertising PDU, scan request PDU,
 *              connection request PDU (in not connected state)
 *            - The transmit power used in sending PDU in connected state.
 *          When getting the transmit power used in not connected state, set the conn_hdl parameter to
 *          BLE_GAP_INIT_CONN_HDL(0xFFFF).\n
 *          When the transmit power used in connected state is retrieved, set the conn_hdl parameter to
 *          the connection handle of the link.
 *          The result of this API call is notified in BLE_VS_EVENT_GET_TX_POWER event.
 *
 * @param[in] conn_hdl Connection handle identifying the link whose transmit power to be retrieved.
 *                     If non connected state, set BLE_GAP_INIT_CONN_HDL(0xFFFF).
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) There are no memories for Vendor Specific Command.
 *********************************************************************************************************************/
ble_status_t R_BLE_VS_GetTxPower(uint16_t conn_hdl);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_VS_SetCodingScheme(uint8_t coding_scheme)
 * @brief   This function configure default Coding scheme(S=8 or S=2) that is used in the case of selecting Coded PHY
 *          in Primary advertising PHY or Secondary advertising PHY advertising or request for link establishment.
 * @details After setting the default Coding scheme by this function, configure the advertising parameters
 *          by R_BLE_GAP_SetAdvParam() or send a request for link establishment.\n
 *          The result of this API call is notified in BLE_VS_EVENT_SET_CODING_SCHEME_COMP event.
 * @param[in] coding_scheme Coding scheme for Primary advertising PHY, Secondary advertising PHY,
 *                          request for link establishment.The coding_scheme field is set to a bitwise OR
 *                          of the following values.
 *        | bit            |   description                                                  |
 *        |:-------------- |:-------------------------------------------------------------- |
 *        | bit0           | Coding scheme for Primary Advertising PHY(0:S=8/1:S=2).        |
 *        | bit1           | Coding scheme for Secondary Advertising PHY(0:S=8/1:S=2).      |
 *        | bit2           | Coding scheme for request for link establishment(0:S=8/1:S=2). |
 *        | All other bits | Reserved for future use.                                       |
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) There are no memories for Vendor Specific Command.
 *********************************************************************************************************************/
ble_status_t R_BLE_VS_SetCodingScheme(uint8_t coding_scheme);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_VS_SetRfControl(st_ble_vs_set_rf_ctrl_param_t * p_rf_ctrl)
 * @brief   This function performs power control on RF.
 * @details If BLE communication is not used for a long time, RF reduces the power consumption by moving to
 *          the RF Power-Down Mode.\n
 *          When RF power on, RF initialization processing is executed.\n
 *          After RF power off by this function, API functions other than this are not available
 *          until RF power on again.\n
 *          The result of this API call is notified in BLE_VS_EVENT_RF_CONTROL_COMP event.
 *          After RF power on again with this function, call R_BLE_GAP_Terminate(),
 *          R_BLE_GAP_Init() in order to restart the host stack.
 * @param[in] p_rf_ctrl RF parameters.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) The p_rf_ctrl parameter is specified as NULL.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) There are no memories for Vendor Specific Command.
 *********************************************************************************************************************/
ble_status_t R_BLE_VS_SetRfControl(st_ble_vs_set_rf_ctrl_param_t * p_rf_ctrl);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_VS_SetBdAddr(uint8_t area, st_ble_dev_addr_t * p_addr)
 * @brief   This function sets public/random address of local device to the area specified by the parameter.
 * @details If the address is written in non-volatile area, the address is used as default address
 *          on the next MCU reset.\n
 *          For more information on the random address, refer to Core Specification Vol 6, PartB,
 *          "1.3.2 Random Device Address".\n
 *          The result of this API call is notified in BLE_VS_EVENT_SET_ADDR_COMP event.
 * @param[in] area The area that the address is to be written in.\n
 *                 Select one of the following.
 *                  <table>
 *                      <tr>
 *                          <th>macro</th>
 *                          <th>description</th>
 *                      </tr>
 *                      <tr>
 *                          <td>BLE_VS_ADDR_AREA_REG(0x00)</td>
 *                          <td>
 *                              Address writing to non-volatile area is not performed.<br/>
 *                              Only the address in register is written.
 *                          </td>
 *                      </tr>
 *                      <tr>
 *                          <td>BLE_VS_ADDR_AREA_DATA_FLASH(0x01)</td>
 *                          <td>Address wiring to DataFlash area is performed.</td>
 *                      </tr>
 *                  </table>
 * @param[in] p_addr The address to be set to the area.
 *                   Set BLE_GAP_ADDR_PUBLIC(0x00) or BLE_GAP_ADDR_RAND(0x01)
 *  to the type field in the p_addr parameter.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) The p_addr parameter is specified as NULL.
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) There are no memories for Vendor Specific Command.
 *********************************************************************************************************************/
ble_status_t R_BLE_VS_SetBdAddr(uint8_t area, st_ble_dev_addr_t * p_addr);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_VS_GetBdAddr(uint8_t area, uint8_t addr_type)
 * @brief   This function gets currently configured public/random address.
 * @details The area parameter specifies the place where this function retrieves public/random address.\n
 *          The result of this API call is notified in BLE_VS_EVENT_GET_ADDR_COMP event.
 * @param[in] area The area that the address is to be retrieved.\n
 *                 Select one of the following.
 *                  <table>
 *                      <tr>
 *                          <th>macro</th>
 *                          <th>description</th>
 *                      </tr>
 *                      <tr>
 *                          <td>BLE_VS_ADDR_AREA_REG(0x00)</td>
 *                          <td>Retrieve the address in register.</td>
 *                      </tr>
 *                      <tr>
 *                          <td>BLE_VS_ADDR_AREA_DATA_FLASH(0x01)</td>
 *                          <td>Retrieve the address in DataFlash area.</td>
 *                      </tr>
 *                  </table>
 * @param[in] addr_type The address type that is type of the address to be retrieved.
 *        | macro                     |   description      |
 *        |:------------------------- |:------------------ |
 *        | BLE_GAP_ADDR_PUBLIC(0x00) | Public address.    |
 *        | BLE_GAP_ADDR_RAND(0x01)   | Random address.    |
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) There are no memories for Vendor Specific Command.
 *********************************************************************************************************************/
ble_status_t R_BLE_VS_GetBdAddr(uint8_t area, uint8_t addr_type);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_VS_GetRand(uint8_t rand_size)
 * @brief   This function generates 4-16 bytes of random number used in creating keys.
 * @details The result of this API call is notified in BLE_VS_EVENT_GET_RAND event.
 * @param[in] rand_size Length of the random number (byte).\n
 *                      The valid range is 4<=rand_size<=16.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_STATE(0x0008) The task for host stack is not running.
 * @retval  BLE_ERR_MEM_ALLOC_FAILED(0x000C) There are no memories for Vendor Specific Command.
 *********************************************************************************************************************/
ble_status_t R_BLE_VS_GetRand(uint8_t rand_size);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_VS_StartTxFlowEvtNtf(void)
 * @brief   This function starts the notification(BLE_VS_EVENT_TX_FLOW_STATE_CHG event) of
 *          the state transition of TxFlow.
 * @details If the number of the available transmission packet buffers is the following,
 *          BLE_VS_EVENT_TX_FLOW_STATE_CHG event notifies the application layer of the state of the TxFlow.
 *          - The number of the available transmission packet buffers is less than Low Water Mark.
 *          - The number of the available transmission packet buffers is more than High Water Mark.
 *          The result of this API call is returned by a return value.
 * @retval  BLE_SUCCESS(0x0000) Success
 *********************************************************************************************************************/
ble_status_t R_BLE_VS_StartTxFlowEvtNtf(void);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_VS_StopTxFlowEvtNtf(void)
 * @brief   This function stops the notification(BLE_VS_EVENT_TX_FLOW_STATE_CHG event) of
 *          the state transition of TxFlow.
 * @details The result of this API call is returned by a return value.
 * @retval  BLE_SUCCESS(0x0000) Success
 *********************************************************************************************************************/
ble_status_t R_BLE_VS_StopTxFlowEvtNtf(void);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_VS_GetTxBufferNum(uint32_t * p_buffer_num)
 * @brief   This function retrieves the number of the available transmission packet buffers.
 * @details The maximum number of the available buffers is 10.\n
 *          The result of this API call is returned by a return value.
 * @param[out] p_buffer_num The number of the available transmission packet buffers.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_PTR(0x0001) The p_buffer_num parameter is specified as NULL.
 *********************************************************************************************************************/
ble_status_t R_BLE_VS_GetTxBufferNum(uint32_t * p_buffer_num);

