fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/r_ble_da1453x_if.h
/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_VS_SetTxLimit(uint32_t tx_queue_lwm, uint32_t tx_queue_hwm)
 * @brief   This function sets the threshold for notifying the application layer of the TxFlow state.
 * @details Call this function before the notification(BLE_VS_EVENT_TX_FLOW_STATE_CHG event) has been started
 *          by R_BLE_VS_StartTxFlowEvtNtf(). \n
 *          The result is returned from this API.\n
 *          Vendor Specific API supports the flow control function(TxFlow) for the transmission
 *          on L2CAP fixed channel in Basic Mode such as GATT.\n
 *          Host stack has 10 transmission packet buffers for the transmission.\n
 *          When the number of the available transmission packet buffers has been less than Low Water Mark,
 *          the state of TxFlow transmits into the TxFlow OFF state from the TxFlow ON state
 *          that is the initial state and host stack notifies the application layer of
 *          timing to stop packet transmission.\n
 *          When host stack has sent the transmission packets to Controller and the number of the available
 *          transmission packet buffers has been more than High Water Mark, the state of TxFlow transmits into
 *          the TxFlow ON state from the TxFlow OFF state and host stack notifies the application layer of
 *          timing to restart packet transmission.\n
 *          It is possible to perform flow control on a fixed channel by using the event notification.
 * @param[in] tx_queue_lwm Low Water Mark.
 *                         Set 0-9 less than tx_queue_hwm to the parameter.
 *                         When the number of the available transmission packet buffers has been less than the value
 *                         specified by the tx_queue_lwm parameter, host stack notifies the application layer of
 *                         the timing to stop packet transmission.
 * @param[in] tx_queue_hwm High Water Mark.
 *                         Set 1-10 more than tx_queue_lwm to the parameter.
 *                         When the number of the available transmission packet buffers has been more than
 *                         the value specified by the tx_queue_hwm parameter, host stack notifies
 *                         the application layer of the timing to restart packet transmission.
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The tx_queue_lwm parameter or the tx_queue_hwm parameter is out of range.
 *********************************************************************************************************************/
ble_status_t R_BLE_VS_SetTxLimit(uint32_t tx_queue_lwm, uint32_t tx_queue_hwm);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_VS_SetScanChMap(uint16_t ch_map)
 * @brief    This function sets the scan channel map.
 * @details  Set specify the scan channel for use.\n
 *           At least one channel must be enabled.
 * @note     Calling this API while Scan is already running will not change the channel map.
 * @param[in] ch_map  Specify the channel map for use.
 *        | bit            |   description                                      |
 *        |:-------------- |:-------------------------------------------------- |
 *        | bit0           | Enable channel 37 for use (0:disable, 1:enable)    |
 *        | bit1           | Enable channel 38 for use (0:disable, 1:enable)    |
 *        | bit2           | Enable channel 39 for use (0:disable, 1:enable)    |
 *        | All other bits | Reserved for future use.                           |
 * @retval  BLE_SUCCESS(0x0000) Success
 * @retval  BLE_ERR_INVALID_ARG(0x0003) The ch_map parameter is out of range.
 *********************************************************************************************************************/
ble_status_t R_BLE_VS_SetScanChMap(uint16_t ch_map);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_VS_GetScanChMap(void)
 * @brief    This function gets currently scan channel map.
 * @details  The result of this API call is notified in BLE_VS_EVENT_GET_SCAN_CH_MAP event.
 * @retval  BLE_SUCCESS(0x0000) Success
 *********************************************************************************************************************/
ble_status_t R_BLE_VS_GetScanChMap(void);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_VS_StartFirmwareUpdate(void)
 * @brief    This function starts the firmware update procedure.
 * @details  The result of this API call is notified in BLE_VS_EVENT_START_FW_UPDATE_COMP event.
 * @retval   BLE_SUCCESS(0x0000)  Success
 * @retval   BLE_ERR_INVALID_MODE A command was sent from an invalid mode
 * @retval   BLE_ERR_UNSUPPORTED This API does not support
 *********************************************************************************************************************/
ble_status_t R_BLE_VS_StartFirmwareUpdate(void);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_VS_SendFirmwareData(uint16_t index, uint16_t length, uint8_t const * const p_data)
 * @brief     This function sends a firmware update data frame.
 * @param[in] index  The index of the current data frame.
 * @param[in] length The length of the current data frame.
 * @param[in] p_data A pointer to the data frame.
 * @details   The result of this API call is notified in BLE_VS_EVENT_SEND_FW_DATA_COMP event.
 * @retval    BLE_SUCCESS(0x0000)  Success
 * @retval    BLE_ERR_INVALID_ARG  An input parameter was invalid
 * @retval    BLE_ERR_INVALID_MODE A command was sent from an invalid mode
 * @retval    BLE_ERR_UNSUPPORTED This API does not support
 *********************************************************************************************************************/
ble_status_t R_BLE_VS_SendFirmwareData(uint16_t index, uint16_t length, uint8_t const * const p_data);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_VS_EndFirmwareUpdate(uint16_t end_index)
 * @brief     This function ends the firmware update procedure.
 * @param[in] end_index The index of the last data frame.
 * @details   The result of this API call is notified in BLE_VS_EVENT_END_FW_UPDATE_COMP event.
 * @retval    BLE_SUCCESS(0x0000)  Success
 * @retval    BLE_ERR_INVALID_MODE A command was sent from an invalid mode
 * @retval    BLE_ERR_UNSUPPORTED This API does not support
 *********************************************************************************************************************/
ble_status_t R_BLE_VS_EndFirmwareUpdate(uint16_t end_index);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_VS_GetFirmwareVersion()
 * @brief     This function requests the BLE module firmware version.
 * @details   The result of this API call is notified in BLE_VS_EVENT_GET_FW_VERSION_COMP event.
 * @retval    BLE_SUCCESS(0x0000)  Success
 * @retval    BLE_ERR_INVALID_MODE A command was sent from an invalid mode
 * @retval    BLE_ERR_UNSUPPORTED This API does not support
 *********************************************************************************************************************/
ble_status_t R_BLE_VS_GetFirmwareVersion(void);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_VS_RestartModule(void)
 * @brief   This function restarts the module.
 * @details The result of this API call is notified in BLE_VS_EVENT_MODULE_READY_COMP event.
 * @retval  BLE_SUCCESS(0x0000)  Success
 * @retval  BLE_ERR_RSP_TIMEOUT  A command did not receive a response
 * @retval  BLE_ERR_INVALID_MODE A command was sent from an invalid mode
 * @retval  BLE_ERR_UNSUPPORTED This API does not support
 *********************************************************************************************************************/
ble_status_t R_BLE_VS_RestartModule(void);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_VS_UpdateModuleFirmware(void)
 * @brief   This function starts the firmware update procedure and blocks until the procedure has completed.
 * @param[in] p_firmware_image  The index of the current data frame.
 * @param[in] firmware_image_size The length of the current data frame.
 * @retval    BLE_SUCCESS(0x0000)  Success
 * @retval    BLE_ERR_INVALID_ARG  An input parameter was invalid
 * @retval    BLE_ERR_RSP_TIMEOUT  A command did not receive a response
 * @retval    BLE_ERR_INVALID_MODE A command was sent from an invalid mode
 * @retval    BLE_ERR_UNSUPPORTED  This API does not support
 *********************************************************************************************************************/
ble_status_t R_BLE_VS_UpdateModuleFirmware(uint8_t const * const p_firmware_image, uint32_t firmware_image_size);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_VS_SetSleepMode(void)
 * @brief   This function puts the DA1453x in any of the three sleep modes.
 * @details When DA1453x goes into sleep deasserts its RTS. If RA CPU wishes to wake it up,
 *          it should toggle its RTS for
 *          5 milliseconds (assert-deassert-assert). When DA1453x exits sleep it asserts its RTS, the RA CTS should
 *          be able to catch this by setting the flow control mode to Hardware CTS.
 * @param[in] sleep_mode
 *        | macro                       |   description     |
 *        |:----------------------------|:------------------|
 *        | BLE_VS_SLEEP_OFF(0x00)      | Always active     |
 *        | BLE_VS_EXTENDED_SLEEP(0x01) | Extended Sleep    |
 *        | BLE_VS_DEEP_SLEEP(0x02)     | Deep Sleep        |
 *        | BLE_VS_HIBERNATION(0x03)    | Hibernation mode  |
 * @param[in] ram_retention, used only for deep sleep/hibernation modes
 *        | macro                       |   description     |
 *        |:----------------------------|:------------------|
 *        | BLE_VS_RAM_POWER_ON(0x00)   | RAM retained      |
 *        | BLE_VS_RAM_POWER_OFF(0x01)  | RAM not retained  |
 * @param[in] pin_selection  0-11  for port 0(P00..P011). Used only for deep sleep/hibernation modes
 * @retval    BLE_SUCCESS(0x0000)  Success
 * @retval    BLE_ERR_RSP_TIMEOUT  A command did not receive a response
 * @retval    BLE_ERR_INVALID_ARG  An input parameter was invalid
 *********************************************************************************************************************/
ble_status_t R_BLE_VS_SetSleepMode(uint8_t sleep_mode, uint8_t ram_retention, uint8_t pin_selection);

/******************************************************************************************************************//**
 * @fn ble_status_t R_BLE_VS_SetPublicBdAddress(void)
 * @brief   This function sets a public BD address
 * @param[in] p_addr The BD address
 * @retval    BLE_SUCCESS(0x0000)  Success
 * @retval    BLE_ERR_INVALID_ARG  An input parameter was invalid
 * @retval    BLE_ERR_RSP_TIMEOUT  A command did not receive a response
 * @retval    BLE_ERR_INVALID_MODE A command was sent from an invalid mode
 * @retval    BLE_ERR_UNSUPPORTED  This API does not support
 *********************************************************************************************************************/
ble_status_t R_BLE_VS_SetPublicBdAddress(st_ble_dev_addr_t * p_addr);

/*@}*/

/******************************************************************************************************************//**
 * @} (end addtogroup BLE_API)
 *********************************************************************************************************************/

/* Common macro for FSP header files. There is also a corresponding FSP_HEADER macro at the top of this file. */
FSP_FOOTER
#endif
